{"Bob Dylan": ["[Verse 1]\nIt was a dark day in Dallas, November '63\nA day that will live on in infamy\nPresident Kennedy was a-ridin' high\nGood day to be livin' and a good day to die\nBeing led to the slaughter like a sacrificial lamb\nHe said, \"Wait a minute, boys, you know who I am?\"\n\"Of course we do, we know who you are\"\nThen they blew off his head while he was still in the car\nShot down like a dog in broad daylight\nWas a matter of timing and the timing was right\nYou got unpaid debts, we've come to collect\nWe're gonna kill you with hatred, without any respect\nWe'll mock you and shock you and we'll put it in your face\nWe've already got someone here to take your place\nThe day they blew out the brains of the king\nThousands were watching, no one saw a thing\nIt happened so quickly, so quick, by surprise\nRight there in front of everyone's eyes\nGreatest magic trick ever under the sun\nPerfectly executed, skillfully done\nWolfman, oh Wolfman, oh Wolfman, howl\nRub-a-dub-dub, it's a murder most foul\n\n[Verse 2]\nHush, little children, you'll understand\nThe Beatles are comin', they're gonna hold your hand\nSlide down the banister, go get your coat\nFerry 'cross the Mersey and go for the throat\nThere's three bums comin' all dressed in rags\nPick up the pieces and lower the flags\nI'm goin' to Woodstock, it's the Aquarian Age\nThen I'll go over to Altamont and sit near the stage\nPut your head out the window, let the good times roll\nThere's a party going on behind the Grassy Knoll\nStack up the bricks, pour the cement\nDon't say Dallas don't love you, Mr. President\nPut your foot in the tank and then step on the gas\nTry to make it to the triple underpass\nBlackface singer, whiteface clown\nBetter not show your faces after the sun goes down\nUp in the red light district, they've got cop on the beat\nLiving in a nightmare on Elm Street\nWhen you're down on Deep Ellum, put your money in your shoe\nDon't ask what your country can do for you\nCash on the barrelhead, money to burn\nDealey Plaza, make a left-hand turn\nI'm going down to the crossroads, gonna flag a ride\nThe place where faith, hope, and charity died\nShoot him while he runs, boy, shoot him while you can\nSee if you can shoot the invisible man\nGoodbye, Charlie, goodbye, Uncle Sam\nFrankly, Miss Scarlett, I don't give a damn\nWhat is the truth, and where did it go?\nAsk Oswald and Ruby, they oughta know\n\"Shut your mouth,\" said a wise old owl\nBusiness is business, and it's a murder most foul\n\n[Verse 3]\nTommy, can you hear me? I'm the Acid Queen\nI'm riding in a long, black Lincoln limousine\nRidin' in the back seat next to my wife\nHeaded straight on in to the afterlife\nI'm leaning to the left, I got my head in her lap\nHold on, I've been led into some kind of a trap\nWhere we ask no quarter, and no quarter do we give\nWe're right down the street, from the street where you live\nThey mutilated his body and they took out his brain\nWhat more could they do? They piled on the pain\nBut his soul was not there where it was supposed to be at\nFor the last fifty years they've been searchin' for that\nFreedom, oh freedom, freedom over me\nI hate to tell you, mister, but only dead men are free\nSend me some lovin', then tell me no lie\nThrow the gun in the gutter and walk on by\nWake up, little Susie, let's go for a drive\nCross the Trinity River, let's keep hope alive\nTurn the radio on, don't touch the dials\nParkland Hospital, only six more miles\nYou got me dizzy, Miss Lizzy, you filled me with lead\nThat magic bullet of yours has gone to my head\nI'm just a patsy like Patsy Cline\nNever shot anyone from in front or behind\nI've blood in my eye, got blood in my ear\nI'm never gonna make it to the new frontier\nZapruder's film I seen night before\nSeen it thirty-three times, maybe more\nIt's vile and deceitful, it's cruel and it's mean\nUgliest thing that you ever have seen\nThey killed him once and they killed him twice\nKilled him like a human sacrifice\nThe day that they killed him, someone said to me, \"Son\nThe age of the Antichrist has just only begun\"\nAir Force One comin' in through the gate\nJohnson sworn in at 2:38\nLet me know when you decide to throw in the towel\nIt is what it is, and it's murder most foul\n\n[Verse 4]\nWhat's new, pussycat? What'd I say?\nI said the soul of a nation been torn away\nAnd it's beginning to go into a slow decay\nAnd that it's thirty-six hours past Judgment Day\nWolfman Jack, he's speaking in tongues\nHe's going on and on at the top of his lungs\nPlay me a song, Mr. Wolfman Jack\nPlay it for me in my long Cadillac\nPlay me that \"Only the Good Die Young\"\nTake me to the place Tom Dooley was hung\nPlay \"St. James Infirmary\" and the Court of King James\nIf you want to remember, you better write down the names\nPlay Etta James, too, play \"I'd Rather Go Blind\"\nPlay it for the man with the telepathic mind\nPlay John Lee Hooker, play \"Scratch My Back\"\nPlay it for that strip club owner named Jack\nGuitar Slim going down slow\nPlay it for me and for Marilyn Monroe\n\n[Verse 5]\nPlay \"Please Don't Let Me Be Misunderstood\"\nPlay it for the First Lady, she ain't feeling any good\nPlay Don Henley, play Glenn Frey\nTake it to the limit and let it go by\nPlay it for Carl Wilson, too\nLooking far, far away down Gower Avenue\nPlay \"Tragedy\", play \"Twilight Time\"\nTake me back to Tulsa to the scene of the crime\nPlay another one and \"Another One Bites the Dust\"\nPlay \"The Old Rugged Cross\" and \"In God We Trust\"\nRide the pink horse down that long, lonesome road\nStand there and wait for his head to explode\nPlay \"Mystery Train\" for Mr. Mystery\nThe man who fell down dead like a rootless tree\nPlay it for the reverend, play it for the pastor\nPlay it for the dog that got no master\nPlay Oscar Peterson, play Stan Getz\nPlay \"Blue Sky,\" play Dickey Betts\nPlay Art Pepper, Thelonious Monk\nCharlie Parker and all that junk\nAll that junk and \"All That Jazz\"\nPlay something for the Birdman of Alcatraz\nPlay Buster Keaton, play Harold Lloyd\nPlay Bugsy Siegel, play Pretty Boy Floyd\nPlay the numbers, play the odds\nPlay \"Cry Me a River\" for the Lord of the gods\nPlay Number nine, play Number six\nPlay it for Lindsey and Stevie Nicks\nPlay Nat King Cole, play \"Nature Boy\"\nPlay \"Down in the Boondocks\" for Terry Malloy\nPlay \"It Happened One Night\" and \"One Night of Sin\"\nThere's twelve million souls that are listening in\nPlay \"Merchant of Venice\", play \"Merchants of Death\"\nPlay \"Stella by Starlight\" for Lady Macbeth\nDon't worry, Mr. President, help's on the way\nYour brothers are comin', there'll be hell to pay\nBrothers? What brothers? What's this about hell?\nTell them, \"We're waiting, keep coming,\" we'll get them as well\nLove Field is where his plane touched down\nBut it never did get back up off the ground\nWas a hard act to follow, second to none\nThey killed him on the altar of the rising sun\nPlay \"Misty\" for me and \"That Old Devil Moon\"\nPlay \"Anything Goes\" and \"Memphis in June\"\nPlay \"Lonely at the Top\" and \"Lonely Are the Brave\"\nPlay it for Houdini spinning around in his grave\nPlay Jelly Roll Morton, play \"Lucille\"\nPlay \"Deep in a Dream\", and play \"Driving Wheel\"\nPlay \"Moonlight Sonata\" in F-sharp\nAnd \"A Key to the Highway\" for the king on the harp\nPlay \"Marching Through Georgia\" and \"Dumbarton's Drums\"\nPlay \"Darkness\" and death will come when it comes\nPlay \"Love Me or Leave Me\" by the great Bud Powell\nPlay \"The Blood-Stained Banner\", play \"Murder Most Foul\"", "[Verse 1]\nHow many roads must a man walk down\nBefore you call him a man?\nHow many seas must a white dove sail\nBefore she sleeps in the sand?\nYes, and how many times must the cannonballs fly\nBefore they're forever banned?\n\n[Refrain]\nThe answer, my friend, is blowin' in the wind\nThe answer is blowin' in the wind\n\n[Verse 2]\nYes, and how many years can a mountain exist\nBefore it is washed to the sea?\nYes, and how many years can some people exist\nBefore they're allowed to be free?\nYes, and how many times can a man turn his head\nAnd pretend that he just doesn't see?\n\n[Refrain]\nThe answer, my friend, is blowin' in the wind\nThe answer is blowin' in the wind\n\n[Verse 3]\nYes, and how many times must a man look up\nBefore he can really see the sky?\nYes, and how many ears must one man have\nBefore he can hear people cry?\nYes, and how many deaths will it take 'til he knows\nThat too many people have died?\n\n[Refrain]\nThe answer, my friend, is blowin' in the wind\nThe answer is blowin' in the wind", "[Verse 1]\n\"There must be some way out of here\"\nSaid the joker to the thief\n\"There's too much confusion\nI can't get no relief\nBusinessmen, they drink my wine\nPlowmen dig my earth\nNone of them along the line\nKnow what any of it is worth\"\n\n[Verse 2]\n\"No reason to get excited\"\nThe thief, he kindly spoke\n\"There are many here among us\nWho feel that life is but a joke\nBut you and I, we've been through that\nAnd this is not our fate\nSo let us not talk falsely now\nThe hour is getting late\"\n\n[Verse 3]\nAll along the watchtower\nPrinces kept the view\nWhile all the women came and went\nBarefoot servants too\nOutside, in the distance\nA wildcat did growl\nTwo riders were approaching\nThe wind began to howl", "Come gather 'round people, wherever you roam\nAnd admit that the waters around you have grown\nAnd accept it that soon you’ll be drenched to the bone\nIf your time to you is worth saving\nThen you better start swimmin' or you’ll sink like a stone\nFor the times they are a-changin'\n\nCome writers and critics, who prophesize with your pen\nAnd keep your eyes wide, the chance won’t come again\nAnd don’t speak too soon\nFor the wheel’s still in spin\nAnd there’s no tellin' who that it’s namin'\nFor the loser now will be later to win\nFor the times they are a-changin'\n\nCome senators, congressmen, please heed the call\nDon’t stand in the doorway, don’t block up the hall\nFor he that gets hurt will be he who has stalled\nThe battle outside ragin'\nWill soon shake your windows and rattle your walls\nFor the times they are a-changin'\n\nCome mothers and fathers throughout the land\nAnd don’t criticize what you can’t understand\nYour sons and your daughters are beyond your command\nYour old road is rapidly aging\nPlease get outta' the new one if you can’t lend your hand\nFor the times they are a-changin'\n\nThe line it is drawn, the curse it is cast\nThe slow one now will later be fast\nAs the present now will later be past\nThe order is rapidly fading\nAnd the first one now will later be last\nFor the times they are a-changin'", "[Verse 1]\nWhen the rain is blowing in your face\nAnd the whole world is on your case\nI could offer you a warm embrace\nTo make you feel my love\n\n[Verse 2]\nWhen the evening shadows and the stars appear\nAnd there is no one there to dry your tears\nI could hold you for a million years\nTo make you feel my love\n\n[Bridge 1]\nI know you haven’t made your mind up yet\nBut I would never do you wrong\nI’ve known it from the moment that we met\nNo doubt in my mind where you belong\n\n[Verse 3]\nI’d go hungry, I’d go black and blue\nI’d go crawling down the avenue\nThere’s nothing that I wouldn’t do\nTo make you feel my love\n\n[Bridge 2]\nThe storms are raging on the rolling sea\nAnd on the highway of regret\nThe winds of change are blowing wild and free\nYou ain't seen nothing like me yet\n\n[Verse 4]\nI could make you happy, make your dreams come true\nNothing that I wouldn’t do\nGo to the ends of the earth for you\nTo make you feel my love", "[Verse 1]\nOnce upon a time you dressed so fine\nThrew the bums a dime in your prime, didn't you?\nPeople call, say \"Beware doll, you're bound to fall\"\nYou thought they were all a-kiddin' you\nYou used to laugh about\nEverybody that was hangin' out\nNow you don't talk so loud\nNow you don't seem so proud\nAbout having to be scrounging your next meal\n\n[Chorus 1]\nHow does it feel?\nHow does it feel?\nTo be without a home?\nLike a complete unknown?\nLike a rolling stone?\n\n[Verse 2]\nAw, you've gone to the finest school all right, Miss Lonely\nBut ya know ya only used to get juiced in it\nNobody's ever taught ya how to live out on the street\nAnd now you’re gonna have to get used to it\nYou say you never compromise\nWith the mystery tramp, but now you realize\nHe's not selling any alibis\nAs you stare into the vacuum of his eyes\nAnd say, “Do you want to make a deal?\"\n\n[Chorus 2]\nHow does it feel?\nHow does it feel?\nTo be on your own\nWith no direction home\nA complete unknown\nLike a rolling stone?\n\n[Verse 3]\nAw, you never turned around to see the frowns\nOn the jugglers and the clowns when they all did tricks for you\nNever understood that it ain't no good\nYou shouldn't let other people get your kicks for you\nYou used to ride on a chrome horse with your diplomat\nWho carried on his shoulder a Siamese cat\nAin't it hard when you discover that\nHe really wasn't where it's at\nAfter he took from you everything he could steal?\n\n[Chorus 3]\nHow does it feel?\nHow does it feel?\nTo hang on your own\nWith no direction home\nLike a complete unknown\nLike a rolling stone?\n\n[Verse 4]\nAw, princess on the steeple and all the pretty people\nThey're all drinkin', thinkin' that they got it made\nExchangin' all precious gifts\nBut you'd better take your diamond ring, ya better pawn it, babe\nYou used to be so amused\nAt Napoleon in rags and the language that he used\nGo to him now, he calls ya, ya can't refuse\nWhen ya ain't got nothin', you got nothin' to lose\nYou're invisible now, ya got no secrets to conceal\n\n[Chorus 2]\nHow does it feel?\nAw, how does it feel?\nTo be on your own\nWith no direction home\nLike a complete unknown\nLike a rolling stone?", "[Verse 1]\nPistol shots ring out in the barroom night\nEnter Patty Valentine from the upper hall\nShe sees the bartender in a pool of blood\nCries out, “My God, they killed them all!”\nHere comes the story of the Hurricane\nThe man the authorities came to blame\nFor something that he never done\nPut in a prison cell, but one time he could-a been\nThe champion of the world\n\n[Verse 2]\nThree bodies lying there does Patty see\nAnd another man named Bello, moving around mysteriously\n“I didn’t do it,” he says, and he throws up his hands\n“I was only robbing the register, I hope you understand\nI saw them leaving,” he says, and he stops\n“One of us had better call up the cops”\nAnd so Patty calls the cops\nAnd they arrive on the scene with their red lights flashing\nIn the hot New Jersey night\n\n[Verse 3]\nMeanwhile, far away in another part of town\nRubin Carter and a couple of friends are driving around\nNumber one contender for the middleweight crown\nHad no idea what kinda shit was about to go down\nWhen a cop pulled him over to the side of the road\nJust like the time before and the time before that\nIn Paterson that’s just the way things go\nIf you’re black you might as well not show up on the street\nUnless you want to draw the heat\n\n[Verse 4]\nAlfred Bello had a partner and he had a rap for the cops\nHim and Arthur Dexter Bradley were just out prowling around\nHe said, “I saw two men running out, they looked like middleweights\nThey jumped into a white car with out-of-state plates”\nAnd Miss Patty Valentine just nodded her head\nCop said, “Wait a minute, boys, this one’s not dead”\nSo they took him to the infirmary\nAnd though this man could hardly see\nThey told him that he could identify the guilty men\n\n[Verse 5]\nFour in the morning and they haul Rubin in\nTake him to the hospital and they bring him upstairs\nThe wounded man looks up through his one dying eye\nSays, “Why did you bring him in here for? He ain't the guy!”\nYes, here’s the story of the Hurricane\nThe man the authorities came to blame\nFor something that he never done\nPut in a prison cell, but one time he could-a been\nThe champion of the world\n\n[Verse 6]\nFour months later, the ghettos are in flame\nRubin’s in South America, fighting for his name\nWhile Arthur Dexter Bradley’s still in the robbery game\nAnd the cops are putting the screws to him, looking for somebody to blame\n“Remember that murder that happened in a bar?”\n“Remember you said you saw the getaway car?”\n“You think you’d like to play ball with the law?”\n“Think it might-a been that fighter that you saw running that night?”\n“Don’t forget that you are white”\n\n[Verse 7]\nArthur Dexter Bradley said, “I’m really not sure”\nCops said, “A poor boy like you could use a break\nWe got you for the motel job and we’re talking to your friend Bello\nNow you don’t want to have to go back to jail, be a nice fellow\nYou’ll be doing society a favor\nThat sonofabitch is brave and getting braver\nWe want to put his ass in stir\nWe want to pin this triple murder on him\nHe ain’t no Gentleman Jim”\n\n[Verse 8]\nRubin could take a man out with just one punch\nBut he never did like to talk about it all that much\n\"It’s my work,\" he’d say, \"and I do it for pay\nAnd when it’s over I’d just as soon go on my way\"\nUp to some paradise\nWhere the trout streams flow and the air is nice\nAnd ride a horse along a trail\nBut then they took him to the jailhouse\nWhere they try to turn a man into a mouse\n\n[Verse 9]\nAll of Rubin’s cards were marked in advance\nThe trial was a pig-circus, he never had a chance\nThe judge made Rubin’s witnesses drunkards from the slums\nTo the white folks who watched he was a revolutionary bum\nAnd to the black folks he was just a crazy nigger\nNo one doubted that he pulled the trigger\nAnd though they could not produce the gun\nThe D.A. said he was the one who did the deed\nAnd the all-white jury agreed\n\n[Verse 10]\nRubin Carter was falsely tried\nThe crime was murder “one,” guess who testified?\nBello and Bradley and they both baldly lied\nAnd the newspapers, they all went along for the ride\nHow can the life of such a man\nBe in the palm of some fool’s hand?\nTo see him obviously framed\nCouldn’t help but make me feel ashamed to live in a land\nWhere justice is a game\n\n[Verse 11]\nNow all the criminals in their coats and their ties\nAre free to drink martinis and watch the sun rise\nWhile Rubin sits like Buddha in a ten-foot cell\nAn innocent man in a living hell\nThat’s the story of the Hurricane\nBut it won’t be over till they clear his name\nAnd give him back the time he’s done\nPut in a prison cell, but one time he could-a been\nThe champion of the world", "[Verse 1]\nWell it ain't no use to sit and wonder why, babe\nIf'n you don't know by now\nAnd it ain't no use to sit and wonder why, babe\nIt'll never do somehow\nWhen your rooster crows at the break of dawn\nLook out your window and I’ll be gone\nYou’re the reason I’m a-traveling on\nBut don’t think twice, it’s all right\n\n[Verse 2]\nAnd it ain't no use in turning on your light, babe\nThe light I never knowed\nAnd it ain't no use in turning on your light, babe\nI’m on the dark side of the road\nBut I wish there was something you would do or say\nTo try and make me change my mind and stay\nBut we never did too much talking anyway\nBut don’t think twice, it’s all right\n\n[Verse 3]\nSo it ain't no use in calling out my name, gal\nLike you never done before\nAnd it ain't no use in calling out my name, gal\nI can’t hear you anymore\nI’m a-thinking and a-wondering, walking down the road\nI once loved a woman, a child I’m told\nI gave her my heart but she wanted my soul\nBut don’t think twice, it’s all right\n\n[Verse 4]\nSo long, honey babe\nWhere I’m bound, I can’t tell\nGoodbye's too good a word, babe\nSo I’ll just say fare thee well\nI ain't a-saying you treated me unkind\nYou could've done better, but I don’t mind\nYou just kinda wasted my precious time\nBut don’t think twice, it’s all right", "[Chorus]\nHey Mr. Tambourine Man, play a song for me\nI'm not sleepy and there is no place I'm going to\nHey Mr. Tambourine Man, play a song for me\nIn the jingle jangle mornin' I'll come followin' you\n\n[Verse 1]\nThough I know that evening's empire has returned into sand\nVanished from my hand\nLeft me blindly here to stand, but still not sleeping\nMy weariness amazes me, I am branded on my feet\nI have no one to meet\nAnd my ancient empty street's too dead for dreaming\n\n[Chorus]\nHey Mr. Tambourine Man, play a song for me\nI'm not sleepy and there is no place I'm going to\nHey Mr. Tambourine Man, play a song for me\nIn the jingle jangle mornin' I'll come followin' you\n\n[Verse 2]\nTake me on a trip upon your magic swirlin' ship\nMy senses have been stripped, my hands can't feel to grip\nMy toes too numb to step, wait only for my boot heels\nTo be wandering\nI'm ready to go anywhere, I'm ready for to fade\nInto my own parade, cast your dancin' spell my way\nI promise to go under it\n\n[Chorus]\nHey Mr. Tambourine Man, play a song for me\nI'm not sleepy and there is no place I'm going to\nHey Mr. Tambourine Man, play a song for me\nIn the jingle jangle mornin' I'll come followin' you\n\n[Verse 3]\nThough you might hear laughing, spinning, swinging madly across the sun\nIt's not aimed at anyone, it's just escaping on the run\nAnd but for the sky there are no fences facing\nAnd if you hear vague traces of skipping reels of rhyme\nTo your tambourine in time, it's just a ragged clown behind\nI wouldn't pay it any mind\nIt's just a shadow you're seeing that he's chasing\n\n[Chorus]\nHey Mr. Tambourine Man, play a song for me\nI'm not sleepy and there is no place I'm going to\nHey Mr. Tambourine Man, play a song for me\nIn the jingle jangle mornin' I'll come followin' you\n\n[Verse 4]\nAnd take me disappearing through the smoke rings of my mind\nDown the foggy ruins of time, far past the frozen leaves\nThe haunted, frightened trees, out to the windy beach\nFar from the twisted reach of crazy sorrow\nYes, to dance beneath the diamond sky with one hand waving free\nSilhouetted by the sea, circled by the circus sands\nWith all memory and fate driven deep beneath the waves\nLet me forget about today until tomorrow\n\n[Chorus]\nHey Mr. Tambourine Man, play a song for me\nI'm not sleepy and there is no place I'm going to\nHey Mr. Tambourine Man, play a song for me\nIn the jingle jangle mornin' I'll come followin' you", "[Verse 1]\nJohnny's in the basement, mixin' up the medicine\nI'm on the pavement, thinkin' about the government\nThe man in the trench coat, badge out, laid off\nSays he's got a bad cough, wants to get it paid off\nLook out kid, it's somethin' you did\nGod knows when, but you're doin' it again\nYou better duck down the alleyway, looking for a new friend\nThe man in the coon-skin cap in a pig pen\nWants 11 dollar bills – you only got 10\n\n[Verse 2]\nMaggie comes fleet foot, face full of black soot\nTalkin' that the heat put plants in the bed, but\nPhone's tapped anyway\nMaggie says the many say\nThey must bust in early May, orders from the D.A.\"\nLook out kid, don't matter what you did\nWalk on your tip toes, don’t tie no bows\nBetter stay away from those that carry around a fire hose\nKeep a clean nose, watch the plainclothes\nYou don't need a weather man to know which way the wind blows\n\n[Verse 3]\nOh, get sick, get well, hang around a ink well\nHang bail, hard to tell if anything is gonna sell\nTry hard, get barred, get back, ride rail\nGet jailed, jump bail, join the Army if you fail\nLook out kid, you're gonna get hit\nBy losers, cheaters, six-time users\nHanging 'round the theaters\nGirl by the whirlpool's looking for a new fool\nDon't follow leaders, a-watch the parking meters\n\n[Verse 4]\nOh, get born, keep warm\nShort pants, romance\nLearn to dance, get dressed\nGet blessed, try to be a success\nPlease her, please him, buy gifts\nDon't steal, don't lift\n20 years of schoolin' and they put you on the day shift\nLook out kid, they keep it all hid\nBetter jump down a manhole, light yourself a candle\nDon't wear sandals, try to avoid the scandals\nDon't want to be a bum, you better chew gum\nThe pump don't work 'cause the vandals took the handles", "[Verse 1]\nOh, where have you been, my blue-eyed son?\nAnd where have you been, my darling young one?\nI’ve stumbled on the side of twelve misty mountains\nI’ve walked and I’ve crawled on six crooked highways\nI’ve stepped in the middle of seven sad forests\nI’ve been out in front of a dozen dead oceans\nI’ve been ten thousand miles in the mouth of a graveyard\n\n[Chorus]\nAnd it’s a hard, and it’s a hard, it’s a hard, it’s a hard\nIt’s a hard rain’s a-going to fall\n\n[Verse 2]\nOh, what did you see, my blue-eyed son?\nAnd what did you see, my darling young one?\nI saw a newborn baby with wild wolves all around it\nI saw a highway of diamonds with nobody on it\nI saw a black branch with blood that kept dripping\nI saw a room full of men with their hammers a-bleeding\nI saw a white ladder all covered with water\nI saw ten-thousand talkers whose tongues were all broken\nI saw guns and sharp swords in the hands of young children\n\n[Chorus]\nAnd it’s a hard, it’s a hard, it’s a hard, and it’s a hard\nIt’s a hard rain’s a-going to fall\n\n[Verse 3]\nAnd what did you hear, my blue-eyed son?\nAnd what did you hear, my darling young one?\nI heard the sound of a thunder that roared out a warning\nI heard the roar of a wave that could drown the whole world\nI heard one hundred drummers whose hands were a-blazing\nI heard ten-thousand whispering and nobody listening\nI heard one person starve, I heard many people laughing\nI heard the song of a poet who died in the gutter\nI heard the sound of a clown who cried in the alley\n\n[Chorus]\nAnd it’s a hard, it’s a hard, it’s a hard, it’s a hard\nIt’s a hard rain’s a-going to fall\n\n[Verse 4]\nOh, what did you meet, my blue-eyed son?\nAnd who did you meet, my darling young one?\nI met a young child beside a dead pony\nI met a white man who walked a black dog\nI met a young woman, her body was burning\nI met a young girl, she gave me a rainbow\nI met one man who was wounded in love\nI met another man who was wounded in hatred\n\n[Chorus]\nAnd it’s a hard, it’s a hard, it’s a hard, it’s a hard\nIt’s a hard rain’s a-going to fall\n\n[Verse 5]\nAnd what will you do now, my blue-eyed son?\nAnd what will you do now, my darling young one?\nI’m a-going back out ’fore the rain starts a-falling\nI’ll walk to the depths of the deepest dark forest\nWhere the people are many and their hands are all empty\nWhere the pellets of poison are flooding their waters\nWhere the home in the valley meets the damp dirty prison\nAnd the executioner’s face is always well hidden\nWhere hunger is ugly, where the souls are forgotten\nWhere black is the color, where none is the number\nAnd I’ll tell it, and speak it, and think it, and breathe it\nAnd reflect from the mountain so all souls can see it\nThen I’ll stand on the ocean until I start sinking\nBut I’ll know my song well before I start singing\n\n[Chorus]\nAnd it’s a hard, it’s a hard, it’s a hard, and it’s a hard\nIt’s a hard rain’s a-going to fall", "They’re selling postcards of the hanging\nThey’re painting the passports brown\nThe beauty parlor is filled with sailors\nThe circus is in town\nHere comes the blind commissioner\nThey’ve got him in a trance\nOne hand is tied to the tight-rope walker\nThe other is in his pants\nAnd the riot squad, they’re restless\nThey need somewhere to go\nAs Lady and I look out tonight\nFrom Desolation Row\n\nCinderella, she seems so easy\n\"It takes one to know one\", she smiles\nAnd puts her hands in her back pockets\nBette Davis style\nAnd in comes Romeo, he’s moaning\n“You Belong to Me I Believe”\nAnd someone says, “You’re in the wrong place my friend\nYou'd better leave”\nAnd the only sound that’s left\nAfter the ambulances go\nIs Cinderella sweeping up\nOn Desolation Row\n\nNow the moon is almost hidden\nThe stars are beginning to hide\nThe fortune-telling lady\nHas even taken all her things inside\nAll except for Cain and Abel\nAnd The Hunchback of Notre Dame\nEverybody is making love\nOr else expecting rain\nAnd the Good Samaritan, he’s dressing\nHe’s getting ready for the show\nHe’s going to the carnival tonight\nOn Desolation Row\n\nOphelia, she’s ’neath the window\nFor her I feel so afraid\nOn her twenty-second birthday\nShe already is an old maid\nTo her, death is quite romantic\nShe wears an iron vest\nHer profession’s her religion\nHer sin is her lifelessness\nAnd though her eyes are fixed upon\nNoah’s great rainbow\nShe spends her time peeking\nInto Desolation Row\n\nEinstein, disguised as Robin Hood\nWith his memories in a trunk\nPassed this way an hour ago\nWith his friend, a jealous monk\nNow he looked so immaculately frightful\nAs he bummed a cigarette\nThen he went off sniffing drainpipes\nAnd reciting the alphabet\nYou would not think to look at him\nBut he was famous long ago\nFor playing the electric violin\nOn Desolation Row\n\nDr. Filth, he keeps his world\nInside of a leather cup\nBut all his sexless patients\nThey’re trying to blow it up\nNow his nurse, some local loser\nShe’s in charge of the cyanide hole\nAnd she also keeps the cards that read\n“Have Mercy on His Soul”\nThey all play on the pennywhistle\nYou can hear them blow\nIf you lean your head out far enough\nFrom Desolation Row\n\nAcross the street they’ve nailed the curtains\nThey’re getting ready for the feast\nThe Phantom of the Opera\nIn a perfect image of a priest\nThey are spoon feeding Casanova\nTo get him to feel more assured\nThen they’ll kill him with self-confidence\nAfter poisoning him with words\nAnd the Phantom’s shouting to skinny girls\n“Get outta here if you don’t know\nCasanova is just being punished for going\nTo Desolation Row”\n\nAt midnight all the agents\nAnd the superhuman crew\nCome out and round up everyone\nThat knows more than they do\nThen they bring them to the factory\nWhere the heart attack machine\nIs strapped across their shoulders\nAnd then the kerosene\nIs brought down from the castles\nBy insurance men who go\nCheck to see that nobody is escaping\nTo Desolation Row\n\nPraise be to Nero’s Neptune\nThe Titanic sails at dawn\nEverybody’s shouting\n“Which side are you on?”\nAnd Ezra Pound and T. S. Eliot\nFighting in the captain’s tower\nWhile calypso singers laugh at them\nAnd fishermen hold flowers\nBetween the windows of the sea\nWhere lovely mermaids flow\nAnd nobody has to think too much\nAbout Desolation Row\n\nYes, I received your letter yesterday\nAbout the time the doorknob broke\nWhen you asked me how I was doing\nWas that some kinda joke?\nAll these people that you mention\nYes, I know them, they’re quite lame\nI had to rearrange their faces\nAnd give them all another name\nRight now I can’t read too good\nDon’t send me no more letters, no\nNot unless you mail them\nFrom Desolation Row", "[Verse 1]\nThe pale moon rose in its glory\nOut o'er the Western town\nShe told a sad, sad story\nOf the great ship that went down\n\n[Verse 2]\nT'was the fourteenth day of April\nOver the waves she rode\nSailing into tomorrow\nTo a gilded age foretold\n\n[Verse 3]\nThe night was black with starlight\nThe seas were sharp and clear\nMoving through the shadows\nThe promised hour was near\n\n[Verse 4]\nLights were holding steady\nGliding over the foam\nAll the lords and ladies\nHeading for their eternal home\n\n[Verse 5]\nThe chandeliers were swaying\nFrom the balustrades above\nThe orchestra was playing\nSongs of faded love\n\n[Verse 6]\nThe watchman, he lay dreaming\nAs the ballroom dancers twirled\nHe dreamed the Titanic was sinking\nInto the underworld\n\n[Verse 7]\nLeo took his sketchbook\nHe was often so inclined\nHe closed his eyes and painted\nThe scenery in his mind\n\n[Verse 8]\nCupid struck his bosom\nAnd broke it with a snap\nThe closest woman to him\nHe fell into her lap\n\n[Verse 9]\nHe heard a loud commotion\nSomething sounded wrong\nHis inner spirit was saying\nThat he couldn't stand here long\n\n[Verse 10]\nHe staggered to the quarterdeck\nNo time now to sleep\nWater on the quarterdeck\nAlready three foot deep\n\n[Verse 11]\nSmokestack was leaning sideways\nHeavy feet began to pound\nHe walked into the whirlwind\nSky splitting all around\n\n[Verse 12]\nThe ship was going under\nThe universe had opened wide\nThe roll was called up yonder\nThe angels turned aside\n\n[Verse 13]\nLights down in the hallway\nFlickering dim and dull\nDead bodies already floating\nIn the double bottom hull\n\n[Verse 14]\nThe engines then exploded\nPropellers they failed to start\nThe boilers overloaded\nThe ship's bow split apart\n\n[Verse 15]\nPassengers were flying\nBackward, forward, far and fast\nThey mumbled, fumbled, and tumbled\nEach one more weary than the last\n\n[Verse 16]\nThe veil was torn asunder\n'Tween the hours of twelve and one\nNo change, no sudden wonder\nCould undo what had been done\n\n[Verse 17]\nThe watchman lay there dreaming\nAt forty-five degrees\nHe dreamed that the Titanic was sinking\nDropping to her knees\n\n[Verse 18]\nWellington he was sleeping\nHis bed began to slide\nHis valiant heart was beating\nHe pushed the tables aside\n\n[Verse 19]\nGlass of shattered crystal\nLay scattered roundabout\nHe strapped on both his pistols\nHow long could he hold out?\n\n[Verse 20]\nHis men and his companions\nWere nowhere to be seen\nIn silence there he waited for\nTime and space to intervene\n\n[Verse 21]\nThe passageway was narrow\nThere was blackness in the air\nHe saw every kind of sorrow\nHeard voices everywhere\n\n[Verse 22]\nAlarm-bells were ringing\nTo hold back the swelling tide\nFriends and lovers clinging\nTo each other side by side\n\n[Verse 23]\nMothers and their daughters\nDescending down the stairs\nJumped into the icy waters\nLove and pity sent their prayers\n\n[Verse 24]\nThe rich man, Mister Astor\nKissed his darling wife\nHe had no way of knowing\nBe the last trip of his life\n\n[Verse 25]\nCalvin, Blake, and Wilson\nGambled in the dark\nNot one of them would ever live to\nTell the tale or disembark\n\n[Verse 26]\nBrother rose up 'gainst brother\nIn every circumstance\nThey fought and slaughtered each other\nIn a deadly dance\n\n[Verse 27]\nThey lowered down the lifeboats\nFrom the sinking wreck\nThere were traitors, there were turncoats\nBroken backs and broken necks\n\n[Verse 28]\nThe bishop left his cabin\nTo help all those in need\nTurned his eyes up to the heavens\nSaid, \"The poor are yours to feed\"\n\n[Verse 29]\nDavey the brothel-keeper\nCame out dismissed his girls\nSaw the water getting deeper\nSaw the changing of his world\n\n[Verse 30]\nJim Backus smiled\nHe never learned to swim\nSaw the little crippled child\nAnd he gave his seat to him\n\n[Verse 31]\nHe saw the starlight shining\nStreaming from the East\nDeath was on the rampage\nBut his heart was now at peace\n\n[Verse 32]\nThey battened down the hatches\nBut the hatches wouldn't hold\nThey drowned upon the staircase\nOf brass and polished gold\n\n[Verse 33]\nLeo said to Cleo\nI think I'm going mad\nBut he'd lost his mind already\nWhatever mind he had\n\n[Verse 34]\nHe tried to block the doorway\nTo save all those from harm\nBlood from an open wound\nPouring down his arm\n\n[Verse 35]\nPetals fell from flowers\nTell all of them were gone\nIn the long and dreadful hours\nThe wizard's curse played on\n\n[Verse 36]\nThe host was pouring brandy\nHe was going down slow\nHe stayed right to the end and he\nWas the last to go\n\n[Verse 37]\nThere were many, many others\nNameless here forever more\nThey never sailed the ocean\nOr left their homes before\n\n[Verse 38]\nThe watchman, he lay dreaming\nThe damage had been done\nHe dreamed the Titanic was sinking\nAnd he tried to tell someone\n\n[Verse 39]\nThe captain, barely breathing\nKneeling at the wheel\nAbove him and beneath him\nFifty thousand tons of steel\n\n[Verse 40]\nHe looked over at his compass\nAnd he gazed into its face\nNeedle pointing downward\nHe knew he lost the race\n\n[Verse 41]\nIn the dark illumination\nHe remembered bygone years\nHe read the Book of Revelation\nAnd he filled his cup with tears\n\n[Verse 42]\nWhen the Reaper's task had ended\nSixteen hundred had gone to rest\nThe good, the bad, the rich, the poor\nThe loveliest and the best\n\n[Verse 43]\nThey waited at the landing\nAnd they tried to understand\nBut there is no understanding\nFor the judgment of God's hand\n\n[Verse 44]\nThe news came over the wires\nAnd struck with deadly force\nThe love had lost its fires\nAll things had run their course\n\n[Verse 45]\nThe watchman he lay dreaming\nOf all the things that can be\nHe dreamed the Titanic was sinking\nInto the deep blue sea", "[Verse 1]\nEarly one morning the sun was shining\nI was laying in bed\nWondering if she'd changed at all\nIf her hair was still red\nHer folks they said our lives together\nSure was going to be rough\nThey never did like Mama's homemade dress\nPapa's bankbook wasn't big enough\nAnd I was standing on the side of the road\nRain falling on my shoes\nHeading out for the East Coast\nLord knows I've paid some dues\nGetting through\nTangled up in blue\n\n[Verse 2]\nShe was married when we first met\nSoon to be divorced\nI helped her out of a jam, I guess\nBut I used a little too much force\nWe drove that car as far as we could\nAbandoned it out West\nSplit up on a dark sad night\nBoth agreeing it was best\nShe turned around to look at me\nAs I was walking away\nI heard her say over my shoulder\n\"We'll meet again someday\nOn the avenue\"\nTangled up in blue\n\n[Verse 3]\nI had a job in the great north woods\nWorking as a cook for a spell\nBut I never did like it all that much\nAnd one day the ax just fell\nSo I drifted down to New Orleans\nWhere I lucky was to be employed\nWorking for a while on a fishing boat\nRight outside of Delacroix\nBut all the while I was alone\nThe past was close behind\nI seen a lot of women\nBut she never escaped my mind\nAnd I just grew\nTangled up in blue\n\n[Verse 4]\nShe was working in a topless place\nAnd I stopped in for a beer\nI just kept looking at the side of her face\nIn the spotlight, so clear\nAnd later on, when the crowd thinned out\nI was just about to do the same\nShe was standing there, in back of my chair\nSaid to me \"Tell me, don't I know your name?\"\nI muttered something underneath my breath\nShe studied the lines on my face\nI must admit, I felt a little uneasy\nWhen she bent down to tie the laces\nOf my shoe\nTangled up in blue\n\n[Verse 5]\nShe lit a burner on the stove\nAnd offered me a pipe\n\"I thought you'd never say hello\" she said\n\"You look like the silent type\"\nThen she opened up a book of poems\nAnd handed it to me\nWritten by an Italian poet\nFrom the thirteenth century\nAnd every one of them words rang true\nAnd glowed like burning coal\nPouring off of every page\nLike it was written in my soul\nFrom me to you\nTangled up in blue\n\n[Verse 6]\nI lived with them on Montague Street\nIn a basement down the stairs\nThere was music in the cafes at night\nAnd revolution in the air\nThen he started into dealing with slaves\nAnd something inside of him died\nShe had to sell everything she owned\nAnd froze up inside\nAnd when it finally, the bottom fell out\nI became withdrawn\nThe only thing I knew how to do\nWas to keep on keeping on\nLike a bird that flew\nTangled up in blue\n\n[Verse 7]\nSo now I'm going back again\nI got to get to her somehow\nAll the people we used to know\nThey're an illusion to me now\nSome are mathematicians\nSome are carpenter's wives\nDon't know how it all got started\nI don't know what they're doing with their lives\nBut me, I'm still on the road\nA-heading for another joint\nWe always did feel the same\nWe just saw it from a different point\nOf view\nTangled up in blue", "[Verse 1]\nCome, you masters of war\nYou that build the big guns\nYou that build the death planes\nYou that build all the bombs\nYou that hide behind walls\nYou that hide behind desks\nI just want you to know\nI can see through your masks\n\n[Verse 2]\nYou that never done nothing\nBut build to destroy\nYou play with my world\nLike it’s your little toy\nYou put a gun in my hand\nAnd you hide from my eyes\nAnd you turn and run farther\nWhen the fast bullets fly\n\n[Verse 3]\nLike Judas of old\nYou lie and deceive\nA world war can be won\nYou want me to believe\nBut I see through your eyes\nAnd I see through your brain\nLike I see through the water\nThat runs down my drain\n\n[Verse 4]\nYou fasten all the triggers\nFor the others to fire\nThen you set back and watch\nWhile the death count gets higher\nYou hide in your mansion\nWhile the young people’s blood\nFlows out of their bodies\nAnd is buried in the mud\n\n[Verse 5]\nYou’ve thrown the worst fear\nThat can ever be hurled\nFear to bring children\nInto the world\nFor threatening my baby\nUnborn and unnamed\nYou ain't worth the blood\nThat runs in your veins\n\n[Verse 6]\nHow much do I know\nTo talk out of turn\nYou might say that I’m young\nYou might say I’m unlearned\nBut there’s one thing I know\nThough I’m younger than you\nThat even Jesus would never\nForgive what you do\n\n[Verse 7]\nLet me ask you one question\nIs your money that good\nWill it buy you forgiveness\nDo you think that it could\nI think you will find\nWhen your death takes its toll\nAll the money you made\nWill never buy back your soul\n\n[Verse 8]\nAnd I hope that you die\nAnd your death will come soon\nI will follow your casket\nBy the pale afternoon\nAnd I’ll watch while you’re lowered\nDown to your deathbed\nAnd I’ll stand over your grave\n'Til I’m sure that you’re dead", "[Intro]\nOoh, ooh\nOoh, ooh\n\n[Verse 1]\nMama, take this badge off of me\nI can’t use it anymore\nIt’s getting dark, too dark to see\nI feel I’m knockin' on heaven’s door\n\n[Chorus]\nKnock, knock, knockin' on heaven’s door\nKnock, knock, knockin' on heaven’s door\nKnock, knock, knockin' on heaven’s door\nKnock, knock, knockin' on heaven's door\n\n[Verse 2]\nMama, put my guns in the ground\nI can’t shoot them anymore\nThat long black cloud is coming down\nI feel I’m knockin' on heaven’s door\n\n[Chorus]\nKnock, knock, knockin' on heaven’s door\nKnock, knock, knockin' on heaven’s door\nKnock, knock, knockin' on heaven’s door\nKnock, knock, knockin' on heaven's door\n\n[Outro]\nOoh, ooh\nOoh, ooh", "[Verse 1]\nDarkness at the break of noon\nShadows even the silver spoon\nThe handmade blade, the child's balloon\nEclipses both the sun and moon\nTo understand you know too soon\nThere is no sense in trying\n\n[Verse 2]\nPointed threats they bluff with scorn\nSuicide remarks are torn\nFrom the fools gold mouthpiece the hollow horn\nPlays wasted words, proves to warn\nThat he not busy being born\nIs busy dying\n\n[Verse 3]\nTemptation's page flies out the door\nYou follow, find yourself at war\nWatch waterfalls of pity roar\nYou feel to moan, but unlike before\nYou discover that you'd just be one more\nPerson crying\n\n[Chorus]\nSo don't fear if you hear\nA foreign sound to your ear\nIt's alright, Ma, I'm only sighing\n\n[Verse 4]\nAs some warn victory, some downfall\nPrivate reasons, great or small\nCan be seen in the eyes of those that call\nTo make all that should be killed to crawl\nWhile others say don't hate nothing at all\nExcept hatred\n\n[Verse 5]\nDisillusioned words like bullets bark\nAs human gods aim for their mark\nMake everything from toy guns that spark\nTo flesh-colored Christs that glow in the dark\nIt's easy to see without lookin' too far\nThat not much is really sacred\n\n[Verse 6]\nWhile preachers preach of evil fates\nTeachers teach that knowledge waits\nCan lead to hundred-dollar plates\nGoodness hides behind its gates\nBut even the President of the United States\nSometimes must have to stand naked\n\n[Chorus]\nAnd though the rules of the road have been lodged\nIt's only people's games that you got to dodge\nAnd it's alright, Ma, I can make it\n\n[Verse 7]\nAdvertising signs that con\nYou into thinking you're the one\nThat can do what's never been done\nThat can win what's never been won\nMeantime, life outside goes on\nAll around you\n\n[Verse 8]\nYou lose yourself, you reappear\nYou suddenly find you got nothing to fear\nAlone you stand with nobody near\nWhen a trembling distant voice, unclear\nStartles your sleeping ears to hear\nThat somebody thinks they really found you\n\n[Verse 9]\nA question in your nerves is lit\nYet you know there is no answer fit\nTo satisfy, ensure you not to quit\nTo keep it in your mind and not forget\nThat it is not he, or she, or them, or it\nThat you belong to\n\n[Chorus]\nBut though the masters make the rules\nFor the wise men and the fools\nI got nothing, Ma, to live up to\n\n[Verse 10]\nFor them that must obey authority\nThat they do not respect in any degree\nWho despise their jobs, their destiny\nSpeak jealously of them that are free\nDo what they do just to be\nNothing more than something they invest in\n\n[Verse 11]\nWhile some on principles baptized\nTo strict party platform ties\nSocial clubs in drag disguise\nOutsiders they can freely criticize\nTell nothing except who to idolize\nAnd say \"God bless him\"\n\n[Verse 12]\nWhile one who sings with his tongue on fire\nGargles in the rat race choir\nBent out of shape from society's pliers\nCares not to come up any higher\nBut rather get you down in the hole\nThat he's in\n\n[Chorus]\nBut I mean no harm, nor put fault\nOn anyone that lives in a vault\nBut it's alright, Ma, if I can't please him\n\n[Verse 13]\nOld lady judges watch people in pairs\nLimited in sex, they dare\nTo push fake morals, insult and stare\nWhile money doesn't talk, it swears\nObscenity, who really cares\nPropaganda, all is phony\n\n[Verse 14]\nWhile them that defend what they cannot see\nWith a killer's pride, security\nIt blows the minds most bitterly\nFor them that think death's honesty\nWon't fall upon 'em naturally\nLife sometimes must get lonely\n\n[Verse 15]\nMy eyes collide head-on with stuffed\nGraveyards, false goals, I scuff\nAt pettiness which plays so rough\nWalk upside down inside handcuffs\nKick my legs to crash it off\nSay, okay, I've had enough\nWhat else can you show me?\n\n[Chorus]\nAnd if my thought-dreams could be seen\nThey'd probably put my head in a guillotine\nBut it's alright, Ma, it's life, and life only", "A tear goes down my day is real\nBut your drying eye upon the shame\nEach needs a road for me from you\nWhat paradise? what can I do?\nThat die for my and the day is dark\nI can’t believe for your touch\nWhat I could find oh time is right\nIf I fell in love to fall in love\nTo fall in love with you\n\nThe day is dark, our time is right\nDay in the night deep in the night\nI can’t yet be back I heard my- surprise\nI see it in your lips I knew it in your eyes\nWell I feel your love and I feel no shame\nI can’t unleash your horde I call your name\nWhat you’re to me what can I do?\nTo fall in love to fall in love\nTo fall in love with you\n\nIt just rolls upon the sand\nEver this for now I’m made a man\nCan make you see what I can find\nI know it in my days ah in my daily mind\nOh will ages roll will ages fly?\nI hear your name where angels lie\nWhat do I know? for to come it’s true\nTo fall in love To fall in love\nTo fall in love with you\n\nHow can the doors trust on a nail?\nHow can I be surprised of most every day?\nIn the distant road I can’t be the same\nI feel no love I feel no shame\nI can’t watch the bay out on my own\nWe’ve a destined man I can attest it all\nI didn’t I could find where I could go\nTo fall in love to fall in love\nTo fall in love with you", "[Verse 1]\nIf you’re travelin' the north country fair\nWhere the winds hit heavy on the borderline\nRemember me to one who lives there\nFor she once was a true love of mine\n\n[Verse 2]\nIf you go when the snowflakes storm\nWhen the rivers freeze and summer ends\nPlease see if she has a coat so warm\nTo keep her from the howling winds\n\n[Verse 3]\nPlease see if her hair hangs long\nIf it rolls and flows all down her breast\nPlease see for me if her hair's hangin' long\nFor that’s the way I remember her best\n\n[Verse 4]\nI’m a-wondering if she remembers me at all\nMany times I’ve often prayed\nIn the darkness of my night\nIn the brightness of my day\n\n[Verse 5]\nSo if you’re travelin' the north country fair\nWhere the winds hit heavy on the borderline\nRemember me to one who lives there\nFor she once was a true love of mine", "Ain’t it just like the night to play tricks when you’re tryin' to be so quiet?\nWe sit here stranded, though we’re all doin’ our best to deny it\nAnd Louise holds a handful of rain, temptin’ you to defy it\nLights flicker from the opposite loft\nIn this room the heat pipes just cough\nThe country music station plays soft\nBut there’s nothing, really nothing to turn off\nJust Louise and her lover so entwined\nAnd these visions of Johanna that conquer my mind\n\nIn the empty lot where the ladies play blindman’s bluff with the key chain\nAnd the all-night girls they whisper of escapades out on the “D” train\nWe can hear the night watchman click his flashlight\nAsk himself if it’s him or them that’s really insane\nLouise, she’s all right, she’s just near\nShe’s delicate and seems like the mirror\nBut she just makes it all too concise and too clear\nThat Johanna’s not here\nThe ghost of ’lectricity howls in the bones of her face\nWhere these visions of Johanna have now taken my place\n\nNow, little boy lost, he takes himself so seriously\nHe brags of his misery, he likes to live dangerously\nAnd when bringing her name up\nHe speaks of a farewell kiss to me\nHe’s sure got a lotta gall to be so useless and all\nMuttering small talk at the wall while I’m in the hall\nHow can I explain?\nIt's so hard to get on\nAnd these visions of Johanna, they kept me up past the dawn\n\nInside the museums, Infinity goes up on trial\nVoices echo this is what salvation must be like after a while\nBut Mona Lisa musta had the highway blues\nYou can tell by the way she smiles\nSee the primitive wallflower freeze\nWhen the jelly-faced women all sneeze\nHear the one with the mustache say, “Jeeze\nI can’t find my knees”\nOh, jewels and binoculars hang from the head of the mule\nBut these visions of Johanna, they make it all seem so cruel\n\nThe peddler now speaks to the countess who’s pretending to care for him\nSayin’, “Name me someone that’s not a parasite and I’ll go out and say a prayer for him”\nBut like Louise always says\n“Ya can’t look at much, can ya man?”\nAs she, herself, prepares for him\nAnd Madonna, she still has not showed\nWe see this empty cage now corrode\nWhere her cape of the stage once had flowed\nThe fiddler, he now steps to the road\nHe writes ev’rything’s been returned which was owed\nOn the back of the fish truck that loads\nWhile my conscience explodes\nThe harmonicas play the skeleton keys and the rain\nAnd these visions of Johanna are now all that remain", "[Verse 1]\nYou must leave now\nTake what you need, you think will last\nBut whatever you wish to keep, you better grab it fast\nYonder stands your orphan with his gun\nCrying like a fire in the sun\n\n[Chorus]\nLook out, the saints are coming through\nAnd it's all over now, Baby Blue\n\n[Verse 2]\nThe highway is for gamblers, better use your sense\nTake what you have gathered from coincidence\nThe empty handed painter from your streets\nIs drawing crazy patterns on your sheets\n\n[Chorus]\nThe sky, too, is folding under you\nAnd it's all over now, Baby Blue\n\n[Verse 3]\nAll your seasick sailors, they are rowing home\nYour empty handed armies are going home\nYour lover who just walked out the door\nHas taken all his blankets from the floor\n\n[Chorus]\nThe carpet, too, is moving under you\nAnd it's all over now, Baby Blue\n\n[Verse 4]\nLeave your stepping stones behind\nThere's something that calls for you\nForget the dead you've left\nThey will not follow you\nThe vagabond who's rapping at your door\nIs standing in the clothes that you once wore\n\n[Chorus]\nStrike another match, go start anew\nAnd it's all over now, Baby Blue", "[Verse 1]\nYou walk into the room\nWith your pencil in your hand\nYou see somebody naked\nAnd you, you say, \"Who is that man?\"\nYou try so hard\nBut you don't understand\nJust what you will say\nWhen you get home\n\n[Refrain]\nBecause something is happening here\nBut ya' don't know what it is\nDo you, Mister Jones?\n\n[Verse 2]\nYou raise up your head\nAnd you ask \"Is this where it is?\"\nAnd somebody points to you and says\n\"It's his\"\nAnd you say \"What's mine?\"\nAnd somebody else says \"Well, what is?\"\nAnd you say, \"Oh my God, am I here all alone?\"\n\n[Refrain]\nBut something is happening\nAnd ya' don't know what it is\nDo you, Mister Jones?\n\n[Verse 3]\nYou hand in your ticket\nAnd you go watch the geek\nWho immediately walks up to you\nWhen he hears you speak\nAnd says \"How does it feel to\nBe such a freak?\"\nAnd you say, \"Impossible\"\nAs he hands you a bone\n\n[Refrain]\nAnd something is happening here\nBut ya' don't know what it is\nDo you, Mister Jones?\n\n[Verse 4]\nYou have many contacts\nAmong the lumberjacks\nTo get you facts\nWhen someone attacks your imagination\nBut nobody has any respect\nAnyway they already expect you\nTo all give a check\nTo tax-deductible charity organization\nAw, you've been with the professors\nAnd they've all liked your looks\nWith great lawyers you have\nDiscussed lepers and crooks\nYou've been through all of\nF. Scott Fitzgerald's books\nYou are very well read\nIt's well known\n\n[Refrain]\nBut something is happening here\nAnd ya' don't know what it is\nDo you, Mister Jones?\n\n[Verse 5]\nWell the sword swallower, he comes up to you\nAnd then he kneels\nHe crosses himself\nAnd then he clicks his high heels\nAnd without further notice\nHe asks you how it feels\nAnd he says, \"Here is your throat back\nThanks for the loan\"\n\n[Refrain]\nAnd you know something is happening\nBut ya' don't know what it is\nDo you, Mr. Jones?\n\n[Verse 6]\nNow you see this one-eyed midget\nShouting the word \"Now\"\nAnd you say, \"For what reason?\"\nAnd he says, \"How?\"\nAnd you say, \"What does this mean?\"\nAnd he screams back \"You're a cow\nGive me some milk or else go home\"\n\n[Refrain]\nAnd you know something's happening\nBut ya' don't know what it is\nDo you, Mr. Jones?\n\n[Verse 7]\nWell, you walk into the room\nLike a camel and then you frown\nYou put your eyes in your pocket\nAnd your nose on the ground\nThere oughtta be a law\nAgainst you comin' around\nYou should be made\nTo wear earphones\n\n[Refrain]\n'Cause something is happening\nAnd ya' don't know what it is\nDo you, Mr. Jones?", "[Verse 1]\nLay, lady, lay\nLay across my big brass bed\nLay, lady, lay\nLay across my big brass bed\nWhatever colors you have in your mind\nI’ll show them to you and you’ll see them shine\n\n[Verse 2]\nLay, lady, lay\nLay across my big brass bed\nStay, lady, stay\nStay with your man awhile\nUntil the break of day, let me see ya' make him smile\nHis clothes are dirty but his, his hands are clean\nAnd you’re the best thing that he’s ever seen\n\n[Verse 3]\nStay, lady, stay\nStay with your man awhile\nWhy wait any longer for the world to begin\nYou can have your cake and eat it too\nWhy wait any longer for the one you love\nWhen he’s standing in front of you\n\n[Verse 4]\nLay, lady, lay\nLay across my big brass bed\nStay, lady, stay\nStay while the night is still ahead\nI long to see you in the morning light\nI long to reach for you in the night\nStay, lady, stay\nStay while the night is still ahead", "[Verse 1]\n'Twas in another lifetime\nOne of toil and blood\nWhen blackness was a virtue\nThe road was full of mud\nI came in from the wilderness\nA creature void of form\n\"Come in,\" she said, \"I'll give ya\nShelter from the storm\"\n\n[Verse 2]\nAnd if I pass this way again\nYou can rest assured\nI'll always do my best for her\nOn that I give my word\nIn a world of steel-eyed death and men\nWho are fighting to be warm\n\"Come in,\" she said, \"I'll give ya\nShelter from the storm\"\n\n[Verse 3]\nNot a word was spoke between us\nThere was little risk involved\nEverything up to that point\nHad been left unresolved\nTry imagining a place\nWhere it's always safe and warm\n\"Come in,\" she said, \"I'll give ya\nShelter from the storm\"\n\n[Verse 4]\nI was burned out from exhaustion\nBuried in the hail\nPoisoned in the bushes\nAnd blown out on the trail\nHunted like a crocodile\nRavaged in the corn\n\"Come in,\" she said, \"I'll give ya\nShelter from the storm\"\n\n[Verse 5]\nSuddenly I turned around\nAnd she was standing there\nWith silver bracelets on her wrists\nAnd flowers in her hair\nShe walked up to me so gracefully\nAnd took my crown of thorns\n\"Come in,\" she said, \"I'll give ya\nShelter from the storm\"\n\n[Verse 6]\nNow there's a wall between us\nSomething there's been lost\nI took too much for granted\nI got my signals crossed\nJust to think that it all began\nOn an uneventful morn\n\"Come in,\" she said, \"I'll give ya\nShelter from the storm\"\n\n[Verse 7]\nWell the deputy walks on hard nails\nAnd the preacher rides a mount\nBut nothing really matters much\nIt's doom alone that counts\nAnd the one-eyed undertaker\nHe blows a futile horn\n\"Come in,\" she said, \"I'll give ya\nShelter from the storm\n\n[Verse 8]\nI've heard newborn babies wailing\nLike a mourning dove\nAnd old men with broken teeth\nStranded without love\nDo I understand your question, then\nIs it hopeless and forlorn\n\"Come in,\" she said, \"I'll give ya\nShelter from the storm\"\n\n[Verse 9]\nIn a little hilltop village\nThey gambled for my clothes\nI bargained for salvation\nAnd she gave me a lethal dose\nI offered up my innocence\nAnd I got repaid with scorn\n\"Come in,\" she said, \"I'll give ya\nShelter from the storm\"\n\n[Verse 10]\nWell, I'm living in a foreign country\nBut I'm bound to cross the line\nBeauty walks a razor's edge\nSomeday I'll make it mine\nIf I could only turn back the clock\nTo when God and her were born\n\"Come in,\" she said, \"I'll give ya\nShelter from the storm\"", "[Verse 1]\nListen to that Duquesne whistle blowing\nBlowing like it's gonna sweep my world away\nI wanna stop at Carbondale and keep on going\nThat Duquesne train gon' rock me night and day\n\nYou say I'm a gambler, you say I'm a pimp\nBut I ain't neither one\n\nListen to that Duquesne whistle blowing\nSounding like it's on a final run\n\n[Verse 2]\nListen to that Duquesne whistle blowing\nBlowing like she never blowed before\nBlue light blinking, red light glowing\nBlowing like she's at my chamber door\n\nYou smiling through the fence at me\nJust like you always smiled before\n\nListen to that Duquesne whistle blowing\nBlowing like she ain't gon' blow no more\n\n[Verse 3]\nCan't you hear that Duquesne whistle blowing?\nBlowing like the sky's gonna blow apart\nYou're the only thing alive that keeps me going\nYou're like a time bomb in my heart\n\nI can hear a sweet voice steadily calling\nMust be the mother of our Lord\n\nListen to that Duquesne whistle blowing\nBlowing like my woman's on board\n\n[Verse 4]\nListen to that Duquesne whistle blowing\nBlowing like it's gon' blow my blues away\nYou old rascal, I know exactly where you're going\nI'll lead you there myself at the break of day\n\nI wake up every morning with that woman in my bed\nEverybody telling me she's gone to my head\n\nListen to that Duquesne whistle blowing\nBlowing like it's gon' kill me dead\n\n[Verse 5]\nCan't you hear that Duquesne whistle blowing?\nBlowing through another no good town\n\nThe lights on my native land are glowing\nI wonder if they'll know me next time 'round\nI wonder if that old oak tree's still standing\nThat old oak tree, the one we used to climb\n\nListen to that Duquesne whistle blowing\nBlowing like she's blowing right on time", "[Verse 1]\nSomeone’s got it in for me\nThey’re planting stories in the press\nWhoever it is I wish they’d cut it out quick\nBut when they will I can only guess\nThey say I shot a man named Gray\nAnd took his wife to Italy\nShe inherited a million bucks\nAnd when she died it came to me\nI can’t help it if I’m lucky\n\n[Verse 2]\nPeople see me all the time\nAnd they just can’t remember how to act\nTheir minds are filled with big ideas\nImages and distorted facts\nEven you, yesterday\nYou had to ask me where it was at\nI couldn’t believe after all these years\nYou didn’t know me any better than that\nSweet lady\n\n[Chorus]\nIdiot wind\nBlowing every time you move your mouth\nBlowing down the backroads heading south\nIdiot wind\nBlowing every time you move your teeth\nYou’re an idiot, babe\nIt’s a wonder that you still know how to breathe\n\n[Verse 3]\nI ran into the fortune-teller\nWho said beware of lightning that might strike\nI haven’t known peace and quiet\nFor so long, I can’t remember what it’s like\nThere’s a lone soldier on the cross\nSmoke pouring out of a boxcar door\nYou didn’t know it, you didn’t think it could be done\nIn the final end he won the war\nAfter losing every battle\n\n[Verse 4]\nI woke up on the roadside\nDaydreaming about the way things sometimes are\nVisions of your chestnut mare\nShoot through my head and are making me see stars\nYou hurt the ones that I love best\nAnd cover up the truth with lies\nOne day you’ll be in the ditch\nFlies buzzing around your eyes\nBlood on your saddle\n\n[Chorus]\nIdiot wind\nBlowing through the flowers on your tomb\nBlowing through the curtains in your room\nIdiot wind\nBlowing every time you move your teeth\nYou’re an idiot, babe\nIt’s a wonder that you still know how to breathe\n\n[Verse 5]\nIt was gravity which pulled us down\nAnd destiny which broke us apart\nYou tamed the lion in my cage\nBut it just wasn’t enough to change my heart\nNow everything’s a little upside down\nAs a matter of fact, the wheels have stopped\nWhat’s good is bad, what’s bad is good\nYou’ll find out when you reach the top\nYou’re on the bottom\n\n[Verse 6]\nI noticed at the ceremony\nYour corrupt ways had finally made you blind\nI can’t remember your face anymore\nYour mouth has changed, your eyes don’t look into mine\nThe priest wore black on the seventh day\nAnd sat stone-faced while the building burned\nI waited for you on the running boards\nNear the cypress trees, while the Spring time turned\nSlowly into Autumn\n\n[Chorus]\nIdiot wind\nBlowing like a circle around my skull\nFrom the Grand Coulee Dam to the Capitol\nIdiot wind\nBlowing every time you move your teeth\nYou’re an idiot, babe\nIt’s a wonder that you still know how to breathe\n\n[Verse 7]\nI can’t feel you anymore\nI can’t even touch the books you’ve read\nEvery time I crawl past your door\nI been wishing I've been somebody else instead\nDown the highway, down the tracks\nDown the road to ecstasy\nI followed you beneath the stars\nHounded by your memory\nAnd all your raging glory\n\n[Verse 8]\nI been double-crossed now\nFor the very last time and now I’m finally free\nI kissed goodbye the howling beast\nOn the borderline which separated you from me\nYou’ll never know the hurt I suffered\nNor the pain I rise above\nAnd I’ll never know the same about you\nYour holiness or your kind of love\nAnd it makes me feel so sorry\n\n[Chorus]\nIdiot wind\nBlowing through the buttons of our coats\nBlowing through the letters that we wrote\nIdiot wind\nBlowing through the dust upon our shelves\nWe’re idiots, babe\nIt’s a wonder we can even feed ourselves", "[Verse 1]\nCrimson flames tied through my ears\nRolling high and mighty traps\nPounced with fire on flaming roads\nUsing ideas as my maps\n“We’ll meet on edges, soon,” said I\nProud 'neath heated brow\n\n[Refrain]\nAh, but I was so much older then\nI’m younger than that now\n\n[Verse 2]\nHalf-wracked prejudice leaped forth\n“Rip down all hate,” I screamed\nLies that life is black and white\nSpoke from my skull, I dreamed\nRomantic facts of musketeers\nFoundationed deep, somehow\n\n[Refrain]\nAh, but I was so much older then\nI’m younger than that now\n\n[Verse 3]\nGirls’ faces formed the forward path\nFrom phony jealousy\nTo memorizing politics\nOf ancient history\nFlung down by corpse evangelists\nUn-thought of, though, somehow\n\n[Refrain]\nAh, but I was so much older then\nI’m younger than that now\n\n[Verse 4]\nA self-ordained professor’s tongue\nToo serious to fool\nSpouted out that liberty\nIs just equality in school\n“Equality,” I spoke the word\nAs if a wedding vow\n\n[Refrain]\nAh, but I was so much older then\nI’m younger than that now\n\n[Verse 5]\nIn a soldier’s stance, I aimed my hand\nAt the mongrel dogs who teach\nFearing not that I’d become my enemy\nIn the instant that I preach\nMy existence led by confusion boats\nMutiny from stern to bow\n\n[Refrain]\nAh, but I was so much older then\nI’m younger than that now\n\n[Verse 6]\nYes, my guard stood hard when abstract threats\nToo noble to neglect\nDeceived me into thinking\nI had something to protect\nGood and bad, I define these terms\nQuite clear, no doubt, somehow\n\n[Refrain]\nAh, but I was so much older then\nI’m younger than that now", "[Verse 1]\nNobody feels any pain\nTonight as I stand inside the rain\nEverybody knows that baby’s got new clothes\nBut lately I see her ribbons and her bows\nHave fallen from her curls\n\n[Chorus]\nShe takes just like a woman, yeah she does\nShe makes love just like a woman, yeah she does\nAnd she aches just like a woman\nBut she breaks just like a little girl\n\n[Verse 2]\nQueen Mary, she’s my friend\nYes, I believe I’ll go see her again\nNobody has to guess that baby can’t be blessed\n'Til she finally sees that she’s like all the rest\nWith her fog, her amphetamine and her pearls\n\n[Chorus]\nShe takes just like a woman, yes\nShe makes love just like a woman, yeah she does\nAnd she aches just like a woman\nBut she breaks just like a little girl\n\n[Bridge]\nYeah, it was raining from the first\nAnd I was dying there of thirst\nSo I came in here\nAnd your long-time curse hurts\nBut what’s worse\nIs this pain in here\nI can’t stay in here\n\n[Verse 3]\nAin’t it clear that I just can’t fit\nYes, I believe it’s time for us to quit\nBut when we meet again, introduced as friends\nPlease don’t let on that you knew me when\nI was hungry and it was your world\n\n[Chorus]\nAh, you fake just like a woman, yes, you do\nYou make love just like a woman, yes, you do\nThen you ache just like a woman\nBut ya' break just like a little girl\n\n[Instrumental]", "Oh, I’m sailin' away my own true love\nI’m a-sailin' away in the morning\nIs there somethin' I can send you from across the sea\nFrom the place that I’ll be landing?\n\nNo, there’s nothin' you can send me, my own true love\nThere’s nothin' I'm a-wishing to be ownin'\nJust a-carry yourself back to me unspoiled\nFrom across that lonesome ocean\n\nAh, but I just thought you might want somethin' fine\nMade of silver or of golden\nEither from the mountains of Madrid\nOr from the coast of Barcelona\n\nWell, if I had the stars from the darkest night\nAnd the diamonds from the deepest ocean\nI’d forsake them all for your sweet kiss\nFor that’s all I’m a-wishin' to be ownin'\n\nWell I might be gone a long old time\nAnd it’s only that I’m asking\nIs there somethin' I can send you to remember me by\nTo make your time more easy passing\n\nOh, how can, how can you ask me again\nIt only brings me sorrow\nThe same thing I would want today\nI want again tomorrow\n\nI got a letter on a lonesome day\nIt was from her ship a-sailin'\nSayin' I don’t know when I’ll be comin' back again\nIt depends on how I’m a-feelin'\n\nIf a-you, my love, must think that-a-way\nI’m sure your mind is a-roamin'\nI’m sure your thoughts are not with me\nBut with the country to where you’re goin'\n\nSo take heed, take heed of the western winds\nTake heed of the stormy weather\nAnd yes, there’s somethin' you can send back to me\nSpanish boots of Spanish leather", "[Verse 1]\nGo away from my window\nLeave at your own chosen speed\nI’m not the one you want, babe\nI’m not the one you need\nYou say you're looking for someone\nWho's never weak but always strong\nTo protect you and defend you\nWhether you are right or wrong\nSomeone to open each and every door\n\n[Hook]\nBut it ain't me, babe\nNo, no, no, it ain't me, babe\nIt ain't me you’re looking for, babe\n\n[Verse 2]\nGo lightly from the ledge, babe\nGo lightly on the ground\nI’m not the one you want, babe\nI will only let you down\nYou say you're looking for someone\nWho will promise never to part\nSomeone to close his eyes for you\nSomeone to close his heart\nSomeone who will die for you and more\n\n[Hook]\nBut it ain't me, babe\nNo, no, no, it ain't me, babe\nIt ain't me you’re looking for, babe\n\n[Verse 3]\nGo melt back in the night\nEverything inside is made of stone\nThere's nothing in here moving\nAnd anyway I'm not alone\nYou say you're lookin' for someone\nWho'll pick you up each time you fall\nTo gather flowers constantly\nAnd to come each time you call\nA lover for your life and nothing more\n\n[Hook]\nBut it ain't me, babe\nNo, no, no, it ain't me, babe\nIt ain't me you’re looking for, babe", "[Verse 1]\nThey sat together in the park\nAs the evening sky grew dark\nShe looked at him and he felt a spark\nTingle to his bones\n'Twas then he felt alone\nAnd wished that he'd gone straight\nAnd watched out for a simple twist of fate\n\n[Verse 2]\nThey walked alone by the old canal\nA little confused, I remember well\nAnd stopped into a strange hotel\nWith a neon burning bright\nHe felt the heat of the night\nHit him like a freight train\nMoving with a simple twist of fate\n\n[Verse 3]\nA saxophone someplace far-off played\nAs she was walking on by the arcade\nAs the light bust through a beat-up shade\nWhere he was wakin' up\nShe dropped a coin into the cup\nOf a blind man at the gate\nAnd forgot about a simple twist of fate\n\n[Verse 4]\nHe woke up, the room was bare\nHe didn't see her anywhere\nHe told himself he didn't care\nPushed the window open wide\nFelt an emptiness inside\nTo which he just could not relate\nBrought on by a simple twist of fate\n\n[Verse 5]\nHe hears the ticking of the clocks\nAnd walks along with a parrot that talks\nHunts her down by the waterfront docks\nWhere the sailors all come in\nMaybe she'll pick him out again\nHow long must he wait?\nOne more time, for a simple twist of fate\n\n[Verse 6]\nPeople tell me it's a sin\nTo know and feel too much within\nI still believe she was my twin\nBut I lost the ring\nShe was born in spring\nBut I was born too late\nBlame it on a simple twist of fate", "Oh God said to Abraham, “Kill me a son”\nAbe said, “Man, you must be puttin' me on”\nGod say, “No.”\nAbe say, “What?”\nGod say, “You can do what you want, Abe, but\nThe next time you see me comin' you better run”\nWell Abe says, “Where you want this killin' done?”\nGod says, “Out on Highway 61”\n\nWell Georgia Sam he had a bloody nose\nWelfare Department they wouldn’t give him no clothes\nHe asked poor Howard where can I go\nHoward said there’s only one place I know\nSam said tell me quick man I got to run\nOld Howard just pointed with his gun\nAnd said \"That way, down Highway 61\"\n\nWell Mack the Finger said to Louie the King\nI got forty red, white and blue shoestrings\nAnd a thousand telephones that don’t ring\nDo you know where I can get rid of these things?\nAnd Louie the King said \"Let me think for a minute son\"\nAnd he said \"Yes, I think it can be easily done\nJust take everything down to Highway 61\"\n\nNow the fifth daughter on the twelfth night\nTold the first father that things weren’t right\n\"My complexion\" she says \"is much too white\"\nHe said \"Come here and step into the light\"\nHe says \"Hmm you’re right\nLet me tell the second mother this has been done\"\nBut the second mother was with the seventh son\nAnd they were both out on Highway 61\n\nNow the rovin' gambler he was very bored\nTryin' to create a next world war\nHe found a promoter who nearly fell off the floor\nHe said \"I never engaged in this kind of thing before\nBut yes I think it can be very easily done\nWe’ll just put some bleachers out in the sun\nAnd have it on Highway 61\"", "[Verse 1]\nWell, they'll stone you when you're tryin' to be so good\nThey'll stone you just like they said they would\nThey'll stone you when you're trying to go home\nThen they'll stone you when you're there all alone\n\n[Chorus]\nBut I would not feel so all alone\nEverybody must get stoned\n\n[Verse 2]\nWell, they'll stone you when you're walking on the street\nThey'll stone you when you're trying to keep your seat\nThey'll stone you when you're walking on the floor\nThey'll stone you when you're walking through the door\n\n[Chorus]\nBut I would not feel so all alone\nEverybody must get stoned\n\n[Verse 3]\nThey'll stone you when you're at the breakfast table\nThey'll stone you when you are young and able\nThey'll stone you when you're trying to make a buck\nThey'll stone you and then they'll say, \"Good luck\"\n\n[Chorus]\nYeah, but I would not feel so all alone\nEverybody must get stoned\n\n[Verse 4]\nWell, they'll stone you and say that that's the end\nThen they'll stone you and then they'll come back again\nThey'll stone you when you're riding in your car\nThey'll stone you when you're playing your guitar\n\n[Chorus]\nYes, but I would not feel so all alone\nEverybody must get stoned, alright\n\n[Verse 5]\nWell, they'll stone you when you are all alone\nThey'll stone you when you are walking home\nThey'll stone you and then say they're all brave\nThey'll stone you when you're sent down in your grave\n\n[Chorus]\nBut I would not feel so all alone\nEverybody must get stoned", "[Verse 1]\nThe sweet pretty things are in bed now of course\nThe city fathers they’re trying to endorse\nThe reincarnation of Paul Revere’s horse\nBut the town has no need to be nervous\nThe ghost of Belle Starr she hands down her wits\nTo Jezebel the nun she violently knits\nA bald wig for Jack the Ripper who sits\nAt the head of the chamber of commerce\n\n[Chorus]\nMama’s in the factory\nShe ain't got no shoes\nDaddy’s in the alley\nHe’s lookin' for food\nI am in the kitchen\nWith the tombstone blues\n\n[Verse 2]\nThe hysterical bride in the penny arcade\nScreaming she moans, “I’ve just been made”\nThen sends out for the doctor who pulls down the shade\nAnd says, “My advice is to not let the boys in”\nNow the medicine man comes and he shuffles inside\nHe walks with a swagger and he says to the bride\n“Stop all this weeping, swallow your pride\nYou will not die, it’s not poison”\n\n[Chorus]\nMama’s in the factory\nShe ain't got no shoes\nDaddy’s in the alley\nHe’s lookin' for food\nI’m in the kitchen\nWith the tombstone blues\n\n[Verse 3]\nWell, John the Baptist, after torturing a thief\nLooks up at his hero, the commander-in-chief\nSaying, “Tell me, great hero, but please make it brief\nIs there a hole for me to get sick in?”\nThe commander-in-chief answers him while chasing a fly\nSaying, \"Death to all those who would whimper and cry\"\nAnd dropping a barbell, he points to the sky\nSaying, \"The sun’s not yellow, it’s chicken\"\n\n[Chorus]\nMama’s in the factory\nShe ain't got no shoes\nDaddy’s in the alley\nHe’s lookin' for food\nI am in the kitchen\nWith the tombstone blues\n\n[Verse 4]\nThe king of the Philistines his soldiers to save\nPuts jawbones on their tombstones and flatters their graves\nPuts the pied pipers in prison and fattens the slaves\nThen sends them out to the jungle\nGypsy Davey with a blowtorch he burns out their camps\nWith his faithful slave Pedro behind him he tramps\nWith a fantastic collection of stamps\nTo win friends and influence his uncle\n\n[Chorus]\nMama’s in the factory\nShe ain't got no shoes\nDaddy’s in the alley\nHe’s lookin' for food\nI’m in trouble\nWith the tombstone blues\n\n[Verse 5]\nThe geometry of innocence, flesh on the bone\nCauses Galileo’s math book to get thrown\nAt Delilah who's sitting worthlessly alone\nBut the tears on her cheeks are from laughter\nNow I wish I could give Brother Bill his great thrill\nI would set him in chains at the top of the hill\nThen send out for some pillars and Cecil B. DeMille\nHe could die happily ever after\n\n[Chorus]\nMama’s in the factory\nShe ain't got no shoes\nDaddy’s in the alley\nHe’s lookin' for food\nI am in the kitchen\nWith the tombstone blues\n\n[Verse 6]\nWhere Ma Rainey and Beethoven once unwrapped their bedroll\nTuba players now rehearse around the flagpole\nAnd the National Bank at a profit sells road maps for the soul\nTo the old folks home and the college\nNow I wish I could write you a melody so plain\nThat could hold you dear lady from going insane\nThat could ease you and cool you and cease the pain\nOf your useless and pointless knowledge\n\n[Chorus]\nMama’s in the factory\nShe ain't got no shoes\nDaddy’s in the alley\nHe’s lookin' for food\nI am in the kitchen\nWith the tombstone blues", "[Verse 1]\nThe guilty undertaker sighs\nThe lonesome organ grinder cries\nThe silver saxophones say I should refuse you\nThe cracked bells and washed-out horns\nBlow into my face with scorn\nBut it’s not that way\nI wasn’t born to lose you\n\n[Chorus]\nI want you, I want you\nI want you, so bad\nHoney, I want you\n\n[Verse 2]\nThe drunken politician leaps\nUpon the street where mothers weep\nAnd the saviors who are fast asleep, they wait for you\nAnd I wait for them to interrupt\nMe drinking from my broken cup\nAnd ask me to\nOpen up the gate for you\n\n[Chorus]\nI want you, I want you\nYes I want you, so bad\nHoney, I want you\n\n[Bridge]\nHow my fathers, they’ve gone down\nTrue love they’ve been without it\nBut all their daughters put me down\n'Cause I don’t think about it\n\n[Verse 3]\nWell, I return to the Queen of Spades\nAnd talk with my chambermaid\nShe knows that I’m not afraid to look at her\nShe is good to me\nAnd there’s nothing she doesn’t see\nShe knows where I’d like to be\nBut it doesn’t matter\n\n[Chorus]\nI want you, I want you\nYes I want you, so bad\nHoney, I want you\n\n[Verse 4]\nNow your dancing child with his Chinese suit\nHe spoke to me, I took his flute\nNo, I wasn’t very cute to him, was I?\nBut I did it, because he lied\nAnd because he took you for a ride\nUh because time was on his side\nAnd because I\n\n[Chorus]\nI want you, I want you\nYes I want you, so bad\nHoney, I want you", "Today, and tomorrow, and yesterday, too\nThe flowers are dyin' like all things do\nFollow me close, I’m going to Bally-na-Lee\nI'll lose my mind if you don't come with me\nI fuss with my hair, and I fight blood feuds\nI contain multitudes\n\nGot a tell-tale heart like Mr. Poe\nGot skeletons in the walls of people you know\nI’ll drink to the truth and the things we said\nI'll drink to the man that shares your bed\nI paint landscapes, and I paint nudes\nI contain multitudes\n\nA red Cadillac and a black mustache\nRings on my fingers that sparkle and flash\nTell me, what's next? What shall we do?\nHalf my soul, baby, belongs to you\nI rollick and I frolic with all the young dudes\nI contain multitudes\n\nI'm just like Anne Frank, like Indiana Jones\nAnd them British bad boys, The Rolling Stones\nI go right to the edge, I go right to the end\nI go right where all things lost are made good again\nI sing the songs of experience like William Blake\nI have no apologies to make\nEverything's flowing all at the same time\nI live on a boulevard of crime\nI drive fast cars, and I eat fast foods\nI contain multitudes\n\nPink pedal-pushers, red blue jeans\nAll the pretty maids, and all the old queens\nAll the old queens from all my past lives\nI carry four pistols and two large knives\nI'm a man of contradictions, I'm a man of many moods\nI contain multitudes\n\nYou greedy old wolf, I'll show you my heart\nBut not all of it, only the hateful part\nI’ll sell you down the river, I’ll put a price on your head\nWhat more can I tell you? I sleep with life and death in the same bed\nGet lost, madame, get up off my knee\nKeep your mouth away from me\nI'll keep the path open, the path in my mind\nI’ll see to it that there's no love left behind\nI'll play Beethoven's sonatas, and Chopin’s preludes\nI contain multitudes", "[Verse 1]\nMay God bless and keep you always\nMay your wishes all come true\nMay you always do for others\nAnd let others do for you\nMay you build a ladder to the stars\nAnd climb on every rung\nMay you stay forever young\nForever young, forever young\nMay you stay forever young\n\n[Verse 2]\nMay you grow up to be righteous\nMay you grow up to be true\nMay you always know the truth\nAnd see the lights surrounding you\nMay you always be courageous\nStand upright and be strong\nMay you stay forever young\nForever young, forever young\nMay you stay forever young\n\n[Verse 3]\nMay your hands always be busy\nMay your feet always be swift\nMay you have a strong foundation\nWhen the winds of changes shift\nMay your heart always be joyful\nMay your song always be sung\nMay you stay forever young\nForever young, forever young\nMay you stay forever young", "(Intro)\n\nOh, the ragman draws circles\nUp and down the block\nI’d ask him what the matter was\nBut I know that he don’t talk\nAnd the ladies treat me kindly\nAnd they furnish me with tape\nBut deep inside my heart\nI know I can't escape\n\nOh, Mama, can this really be the end\nTo be stuck inside of Mobile\nWith the Memphis blues again\n\nWell, Shakespeare, he’s in the alley\nWith his pointed shoes and his bells\nSpeaking to some French girl\nWho says she knows me well\nAnd I would send a message\nTo find out if she’s talked\nBut the post office has been stolen\nAnd the mailbox is locked\n\nOh, Mama, can this really be the end\nTo be stuck inside of Mobile\nWith the Memphis blues again\n\nMona tried to tell me\nTo stay away from the train line\nShe said that all the railroad men\nJust drink up your blood like wine\nAnd I said, “Oh, I didn’t know that\nBut then again, there’s only one I’ve met\nAnd he just smoked my eyelids\nAnd punched my cigarette”\n\nOh, Mama, can this really be the end\nTo be stuck inside of Mobile\nWith the Memphis blues again\n\nGrandpa died last week\nAnd now he’s buried in the rocks\nBut everybody still talks about\nHow badly they were shocked\nBut me, I expected it to happen\nI knew he’d lost control\nWhen I, he built a fire on Main Street\nAnd shot it full of holes\n\nOh, Mama, can this really be the end\nTo be stuck inside of Mobile\nWith the Memphis blues again\n\nNow the senator came down here\nShowing everyone his gun\nHanding out free tickets\nTo the wedding of his son\nAnd me, I nearly got busted\nAnd wouldn’t it be my luck\nTo get caught without a ticket\nAnd be discovered beneath a truck\n\nOh, Mama, is this really the end\nTo be stuck inside of Mobile\nWith the Memphis blues again\n\nNow the tea preacher looked so baffled\nWhen I asked him why he dressed\nWith twenty pounds of headlines\nStapled to his chest\nBut he cursed me when I proved to him\nThen I whispered, said “Not even you can hide\nYou see, you’re just like me\nI hope you’re satisfied”\n\nAw, Mama, can this really be the end\nTo be stuck inside of Mobile\nWith the Memphis blues again\n\nNow the rainman gave me two cures\nThen he said, “Jump right in”\nThe one was Texas medicine\nThe other was just railroad gin\nAnd like a fool I mixed them\nAnd it strangled up my mind\nAnd now people just get uglier\nAnd I have no sense of time\n\nOh, Mama, can this really be the end\nTo be stuck inside of Mobile\nWith the Memphis blues again\n\nWhen Ruthie says come see her\nIn her honky-tonk lagoon\nWhere I can watch her waltz for free\n’Neath her Panamanian moon\nAnd I say, “Aw come on now\nYou know ya' know about my debutante”\nAnd she says, “Your debutante just knows what you need\nBut I know what you want”\n\nOh, Mama, can this really be the end\nTo be stuck inside of Mobile\nWith the Memphis blues again\n\nNow the bricks lay on Grand Street\nWhere the neon madmen climb\nThey all fall there so perfectly\nIt all seems so well timed\nAnd here I sit so patiently\nWaiting to find out what price\nYou have to pay to get out of\nGoing through all these things twice\n\nOh, Mama, is this really the end\nTo be stuck inside of Mobile\nWith the Memphis blues again", "[Verse 1]\nDoctor, doctor tell me the time of day\nAnother bottle's empty, another penny spent\nHe turned around and he slowly walked away\nThey shot him in the back and down he went\n\n[Chorus]\nShine your light\nMovin' on\nYou burned so bright\nRoll on, John\n\n[Verse 2]\nFrom the Liverpool docks to the red-light Hamburg streets\nDown in the quarry with the quarrymen\nPlaying to the big crowds, playing to the cheap seats\nAnother day in the life on your way to your journey's end\n\n[Chorus]\n\n[Verse 3]\nSailin' through the trade winds bound for the South\nRags on your back just like any other slave\nThey tied your hands and they clamped your mouth\nWasn't no way out of that deep dark cave\n\n[Chorus]\n\n[Verse 4]\nI heard the news today, oh boy\nThey hauled your ship up on the shore\nNow the city gone dark, there is no more joy\nThey tore the heart right out and cut him to the core\n\n[Chorus]\n\n[Verse 5]\nPut on your bags and get 'em packed\nLeave right now, you won't be far from wrong\nThe sooner you go the quicker you'll be back\nYou've been cooped up on an island far too long\n\n[Chorus]\n\n[Verse 6]\nSlow down you're moving way too fast\nCome together right now over me\nYour bones are weary, you're about to breathe your last\nLord, you know how hard that it can be\n\n[Chorus]\n\n[Verse 7]\nRoll on, John, roll through the rain and snow\nTake the right-hand road and go where the buffalo roam\nThey'll trap you in an ambush before you know\nToo late now to sail back home\n\n[Chorus]\n\n[Verse 8]\nTyger, tyger burning bright\nI pray the Lord my soul to keep\nIn the forests of the night\nCover 'em over and let him sleep\n\n[Chorus]", "[Verse 1]\nI ain't gonna work on Maggie's farm no more\nNo, I ain't gonna work on Maggie's farm no more\nWell, I wake up in the morning\nFold my hands and pray for rain\nI got a head full of ideas\nThat are drivin' me insane\n\n[Bridge]\nIt's a shame the way she makes me scrub the floor\nI ain't gonna work on Maggie's farm no more\n\n[Verse 2]\nI ain't gonna work for Maggie's brother no more\nNo, I ain't gonna work for Maggie's brother no more\nWell, he hands you a nickel\nHe hands you a dime\nHe asks you with a grin\nIf you're having a good time\n\n[Bridge]\nThen he fines you every time you slam the door\nI ain't gonna work for Maggie's brother no more\n\n[Verse 3]\nI ain't gonna work for Maggie's Pa no more\nNo, I ain't gonna work for Maggie's Pa no more\nWell, he puts his cigar\nOut in your face just for kicks\nHis bedroom window\nIt is made out of bricks\n\n[Bridge]\nThe National Guard stands around his door\nAh, I ain't gonna work for Maggie's Pa no more\n\n[Verse 4]\nI ain't gonna work for Maggie's Ma no more\nNo, I ain't gonna work for Maggie's Ma no more\nWell, she talks to all the servants\nAbout man and God and law\nEverybody says\nShe's the brains behind Pa\n\n[Bridge]\nShe's 68, but she says she's 54\nI ain't gonna work for Maggie's Ma no more\n\n[Verse 5]\nI ain't gonna work on Maggie's farm no more\nI ain't gonna work on Maggie's farm no more\nWell, I try my best\nTo be just like I am\nBut everybody wants you\nTo be just like them\n\n[Bridge]\nThey say \"Sing while you slave\" and I just get bored\nAh, I ain't gonna work on Maggie's farm no more", "See the pyramids along the Nile\nWatch the sun rise from a tropic isle\nJust remember, darling, all the while\nYou belong to me\n\nSee the market place in old Algiers\nSend me photographs and souvenirs\nJust remember when a dream appears\nYou belong to me\n\nI'll be so alone without you\nMaybe you'll be lonesome too... and blue\n\nFly the ocean in a silver plane\nSee the jungle when it's wet with rain\nJust remember till you're home again\nYou belong to me\n\nI'll be so alone without you\nMaybe you'll be lonesome too... and blue\n\nFly the ocean in a silver plane\nSee the jungle when it's wet with rain\nJust remember till you're home again\nYou belong to me", "[Verse 1]\nYou got a lot of nerve\nTo say you are my friend\nWhen I was down\nYou just stood there grinning\n\n[Verse 2]\nYou got a lot of nerve\nTo say you got a helping hand to lend\nYou just want to be on\nThe side that’s winning\n\n[Verse 3]\nYou say I let you down\nYou know it’s not like that\nIf you’re so hurt\nWhy then don’t you show it?\n\n[Verse 4]\nYou say you lost your faith\nBut that’s not where it’s at\nYou had no faith to lose\nAnd you know it\n\n[Verse 5]\nI know the reason\nThat you talk behind my back\nI used to be among the crowd\nYou’re in with\n\n[Verse 5]\nDo you take me for such a fool\nTo think I’d make contact\nWith the one who tries to hide\nWhat he don’t know to begin with\n\n[Verse 6]\nYou see me on the street\nYou always act surprised\nYou say “How are you? Good luck!”\nBut you don’t mean it\n\n[Verse 7]\nWhen you know as well as me\nYou’d rather see me paralyzed\nWhy don’t you just come out once\nAnd scream it\n\n[Verse 8]\nNo, I do not feel that good\nWhen I see the heartbreaks you embrace\nIf I was a master thief\nPerhaps I’d rob them\n\n[Verse 9]\nAnd now I know you’re dissatisfied\nWith your position and your place\nDon’t you understand\nIt’s not my problem\n\n[Verse 10]\nI wish that for just one time\nYou could stand inside my shoes\nAnd just for that one moment\nI could be you\n\n[Verse 11]\nYes, I wish that for just one time\nYou could stand inside my shoes\nYou’d know what a drag it is\nTo see you", "[Verse 1]\nWhen you're lost in the rain in Juarez\nWhen it's Easter time too\nAnd your gravity fails\nAnd negativity don't pull you through\nDon't put on any airs\nWhen you're down on Rue Morgue Avenue\nThey got some hungry women there\nAnd they really make a mess outta you\n\n[Verse 2]\nNow if you see Saint Annie\nPlease tell her \"Thanks a lot\"\nI cannot move\nMy fingers are all in a knot\nI don't have the strength\nTo get up and take another shot\nAnd my best friend, my doctor\nWon't even say what it is I've got\n\n[Verse 3]\nSweet Melinda\nThe peasants call her the Goddess of Gloom\nShe speaks good English\nAnd she invites you up into her room\nAnd you're so kind\nAnd careful not to go to her too soon\nAnd she takes your voice\nAnd leaves you howling at the moon\n\n[Verse 4]\nUp on Housing Project Hill\nIt's either fortune or fame\nYou must pick one or the other\nThough neither of them are to be what they claim\nIf you're lookin' to get silly\nYou better go back to from where you came\nBecause the cops don't need you\nAnd man, they expect the same\n\n[Verse 5]\nNow all the authorities\nThey just stand around and boast\nHow they blackmailed the Sergeant-at-Arms\nInto leaving his post\nAnd picking up Angel\nWho just arrived here from the coast\nWho looked so fine at first\nBut left lookin' just like a ghost\n\n[Verse 6]\nI started out on Burgundy\nBut soon hit the harder stuff\nEverybody said they'd stand behind me\nWhen the game got rough\nBut the joke was on me\nThere was nobody even there to bluff\nI'm going back to New York City\nI do believe I've had enough", "My love she speaks like silence\nWithout ideals or violence\nShe doesn't have to say she's faithful\nYet she's true, like ice, like fire\n\nPeople carry roses\nAnd make promises by the hours\nMy love she laughs like the flowers\nValentines can't buy her\n\nIn the dime stores and bus stations\nPeople talk of situations\nRead books, repeat quotations\nDraw conclusions on the wall\n\nSome speak of the future\nMy love she speaks softly\nShe knows there's no success like failure\nAnd that failure's no success at all\n\nThe cloak and dagger dangles\nMadams light the candles\nIn ceremonies of the horsemen\nEven a pawn must hold a grudge\n\nStatues made of match sticks\nCrumble into one another\nMy love winks, she does not bother\nShe knows too much to argue or to judge\n\nThe bridge at midnight trembles\nThe country doctor rambles\nBankers' nieces seek perfection\nExpecting all the gifts that wise men bring\n\nThe wind howls like a hammer\nThe night blows rainy\nMy love she's like some raven\nAt my window with a broken wing", "[Verse 1]\nWho's got a beard that's long and white?\nSanta's got a beard that's long and white\nWho comes around on a special night?\nSanta comes around on a special night\n\nSpecial Night, beard that's white\n\n[Chorus]\nMust be Santa\nMust be Santa\nMust be Santa, Santa Clause\n\n[Verse 2]\nWho wears boots and a suit of red?\nSanta wears boots and a suit of red\nWho wears a long cap on his head?\nSanta wears a long cap on his head\n\nCap on head, suit that's red\nSpecial night, beard that's white\n\n[Chorus]\nMust be Santa\nMust be Santa\nMust be Santa, Santa Clause\n\n[Verse 3]\nWho's got a big red cherry nose?\nSanta's got a big red cherry nose\nWho laughs this way - \"HO HO HO\"?\nSanta laughs this way \"HO HO HO\"\n\nHO HO HO, cherry nose\nCap on head, suit that's red\nSpecial night, beard that's white\n\n[Chorus]\nMust be Santa\nMust be Santa\nMust be Santa, Santa Clause\n\n[Verse 4]\nWho very soon will come our way?\nSanta very soon will come our way\nEight little reindeer pull his sleigh?\nSanta's little reindeer pull his sleigh\n\nReindeer sleigh, come our way\nHO HO HO, cherry nose\nCap on head, suit that's red\nSpecial night, beard that's white\n\n[Chorus]\nMust be Santa\nMust be Santa\nMust be Santa, Santa Clause\n\n[Verse 5]\nDasher, Dancer, Prancer, Vixen\nEisenhower, Kennedy, Johnson, Nixon\nDasher, Dancer, Prancer, Vixen\nCarter, Reagan, Bush and Clinton\n\nReindeer sleigh, come our way\nHO HO HO, cherry nose\nCap on head, suit that's red\nSpecial night, beard that's white\n\n[Chorus]\nMust be Santa\nMust be Santa\nMust be Santa, Santa Clause\nMust be Santa\nMust be Santa\nMust be Santa, Santa Clause", "[Verse 1]\nWell I'm grinding my life out, steady and sure\nNothing more wretched than what I must endure\nI'm drenched in the light that shines from the sun\nI could stone you to death for the wrongs that you done\nSooner or later you make a mistake\nI'll put you in a chain that you never will break\nLegs and arms and body and bone\nI pay in blood, but not my own\n\n[Verse 2]\nNight after night, day after day\nThey strip your useless hopes away\nThe more I take the more I give\nThe more I die the more I live\nI got something in my pocket make your eyeballs swim\nI got dogs could tear you limb from limb\nI'm circling around the Southern Zone\nI pay in blood, but not my own\n\n[Verse 3]\nLow cards are what I've got\nBut I'll play this hand whether I like it or not\nI'm sworn to uphold the laws of God\nYou could put me out in front of a firing squad\nI've been out and around with the rowdy men\nJust like you, my handsome friend\nMy head's so hard, must be made of stone\nI pay in blood, but not my own\n\n[Verse 4]\nAnother politician pumping out the piss\nAnother angry beggar blowing you a kiss\nYou got the same eyes that your mother does\nIf only you could prove who your father was\nSomeone must have slipped a drug in your wine\nYou gulped it down and you cross the line\nMan can't live by bread alone\nI pay in blood, but not my own\n\n[Verse 5]\nHow I made it back home, nobody knows\nOr how I survived so many blows\nI've been through hell, what good did it do?\nYou bastard! I'm suppose to respect you?\nI'll give you justice, I'll fatten your purse\nShow me your moral virtues first\nHear me holler and hear me moan\nI pay in blood but not my own\n\nYou pet your lover in the bed\nCome here, I'll break your lousy head\nOur nation must be saved and freed\nYou've been accused of murder, how do you plead?\nThis is how I spend my days\nI came to bury, not to praise\nI'll drink my fill and sleep alone\nI pay in blood, but not my own", "[Verse 1]\nWith your mercury mouth in the missionary times\nAnd your eyes like smoke and your prayers like rhymes\nAnd your silver cross, and your voice like chimes\nOh, who do they think could bury you?\nWith your pockets well protected at last\nAnd your streetcar visions which ya' place on the grass\nAnd your flesh like silk, and your face like glass\nWho could they get to carry you?\n\n[Chorus]\nSad-eyed lady of the lowlands\nWhere the sad-eyed prophet say that no man comes\nMy warehouse eyes, my Arabian drums\nShould I put them by your gate\nOr, sad-eyed lady, should I wait?\n\n[Verse 2]\nWith your sheets like metal and your belt like lace\nAnd your deck of cards missing the jack and the ace\nAnd your basement clothes and your hollow face\nWho among them can think he could outguess you?\nWith your silhouette when the sunlight dims\nInto your eyes where the moonlight swims\nAnd your matchbook songs and your gypsy hymns\nWho among them would try to impress you?\n\n[Chorus]\nSad-eyed lady of the lowlands\nWhere the sad-eyed prophet say that no man comes\nMy warehouse eyes, my Arabian drums\nShould I put them by your gate\nOr, sad-eyed lady, should I wait?\n\n[Verse 3]\nThe kings of Tyrus with their convict list\nAre waiting in line for their geranium kiss\nAnd ya' wouldn’t know it woulda' happened like this\nBut a'who among them really wants just to kiss you?\nWith your childhood flames on your midnight rug\nAnd your Spanish manners and your mother’s drugs\nAnd your cowboy mouth and your curfew plugs\nWho among them do ya' think could resist you?\n\n[Chorus]\nSad-eyed lady of the lowlands\nWhere the sad-eyed prophet say that no man comes\nMy warehouse eyes, my Arabian drums\nShould I leave them by your gate\nOr, sad-eyed lady, should I wait?\n\n[Verse 4]\nOh, the farmers and the businessmen, they all did decide\nTo show you where the dead angels are that they used to hide\nBut why did they pick you to sympathize with their side?\nHow could they ever mistake you?\nThey wished you’d accepted the blame for the farm\nBut with the sea at your feet and the phony false alarm\nAnd with the child of the hoodlum wrapped up in your arms\nHow could they ever have persuaded you?\n\n[Chorus]\nSad-eyed lady of the lowlands\nWhere the sad-eyed prophet say that no man comes\nMy warehouse eyes, my Arabian drums\nShould I leave them by your gate\nOr, sad-eyed lady, should I wait?\n\n[Verse 5]\nWith your sheet-metal memory of Cannery Row\nAnd your magazine-husband who one day just had to go\nAnd your gentleness now, which you just can’t help but show\nWho among them do you think would employ you?\nNow you stand with your thief, you’re on his parole\nWith your holy medallion an' your fingertips now that fold\nAnd your saintlike face and your ghost-like soul\nWho among them could ever think it could destroy you?\n\n[Chorus]\nSad-eyed lady of the lowlands\nWhere the sad-eyed prophet say that no man comes\nMy warehouse eyes, my Arabian drums\nShould I leave them by your gate\nOr, sad-eyed lady, should I wait?", "[Verse 1]\nI’ve seen love go by my door\nIt’s never been this close before\nNever been so easy or so slow\nI've been shooting in the dark too long\nWhen something’s not right, it’s wrong\nYou're gonna make me lonesome when you go\n\n[Verse 2]\nDragon clouds so high above\nI’ve only known careless love\nIt always just hit me from below\nBut this time 'round it’s more correct\nRight on target, so direct\nYou're gonna make me lonesome when you go\n\n[Verse 3]\nPurple clover, Queen Anne's lace\nCrimson hair across your face\nYou could make me cry, if you don’t know\nCan’t remember what I was thinking of\nYou might be spoilin’ me too much, love\nYou're gonna make me lonesome when you go\n\n[Bridge 1]\nFlowers on the hillside blooming crazy\nCrickets talking back and forth in rhyme\nBlue river running slow and lazy\nI could stay with you forever and never realize the time\n\n[Verse 4]\nSituations have ended sad\nRelationships have all been bad\nMine’ve been like Verlaine’s and Rimbaud\nBut there’s no way I can compare\nAll them scenes to this affair\nYou're gonna make me lonesome when you go\n\n[Bridge 2]\nYou're gonna make me wonder what I’m doin’\nStaying far behind without you\nYou're gonna make me wonder what I’m sayin’\nYou're gonna make me give myself a good talking-to\n\n[Verse 5]\nI’ll look for you in old Honolulu\nSan Francisco or Ashtabula\nYou're gonna have to leave me now, I know\nBut I’ll see you in the sky above\nIn the tall grass, in the ones I love\nYou're gonna make me lonesome when you go", "[Verse 1]\nIf you see her, say hello, she might be in Tangier\nShe left here last early Spring, is livin' there, I hear\nSay for me that I'm all right though things get kind of slow\nShe might think that I've forgotten her, don't tell her it isn't so\n\n[Verse 2]\nWe had a falling out, like lovers often will\nAnd to think of how she left that night, it still brings me a chill\nAnd though our separation, it pierced me to the heart\nShe still lives inside of me, we've never been apart\n\n[Verse 3]\nIf you get close to her, kiss her once for me\nAlways have respected her for doing what she did and gettin' free\nOh, whatever makes her happy, I won't stand in the way\nThough the bitter taste still lingers on from the night I tried to make her stay\n\n[Verse 4]\nI see a lot of people as I make the rounds\nAnd I hear her name here and there as I go from town to town\nAnd I've never gotten used to it, I've just learned to turn it off\nEither I'm too sensitive or else I'm gettin' soft\n\n[Verse 5]\nSundown, yellow moon, I replay the past\nI know every scene by heart, they all went by so fast\nIf she's passin' back this way, I'm not that hard to find\nTell her she can look me up if she's got the time", "[Verse 1]\nShe's got everything she needs\nShe's an artist, she don't look back\nShe's got everything she needs\nShe's an artist, she don't look back\nShe can take the dark out of the nighttime\nAnd paint the daytime black\n\n[Verse 2]\nYou will start out standing\nProud to steal her anything she sees\nYou will start out standing\nProud to steal her anything she sees\nBut you will wind up peeking through her keyhole\nDown upon your knees\n\n[Verse 3]\nShe never stumbles\nShe's got no place to fall\nShe never stumbles\nShe's got no place to fall\nShe's nobody's child\nThe Law can't touch her at all\n\n[Instrumental Interlude]\n\n[Verse 4]\nShe wears an Egyptian ring\nIt sparkles before she speaks\nShe wears an Egyptian ring\nIt sparkles before she speaks\nShe's a hypnotist collector\nYou are a walking antique\n\n[Verse 5]\nBow down to her on Sunday\nSalute her when her birthday comes\nBow down to her on Sunday\nSalute her when her birthday comes\nFor Halloween buy her a trumpet\nAnd for Christmas get her a drum", "[Verse 1]\nOne time ago a crazy dream came to me\nI dreamt I was walking to World War Three\nI went to the doctor the very next day\nTo see what kind of words he could say\nHe said it was a bad dream\n\"I wouldn’t worry about it none, though\nThem old dreams are only in your head\"\n\n[Verse 2]\nI said “Hold it Doc, a World War passed through my brain”\nHe said “Nurse, get your pad, the boy’s insane”\nHe grabbed my arm, I said “Ouch!”\nAs I landed on the psychiatric couch\nHe said “Tell me about it”\n\n[Verse 3]\nWell, the whole thing started at 3 o’clock fast\nIt was all over by a quarter past\nI was down in the sewer with some little lover\nWhen I peeked out from a manhole cover\nWondering who turned the lights on us\n\n[Verse 4]\nWell, I got up and I walked around\nUp and down the lonesome town\nI stood a-wondering which way to go\nI lit a cigarette on a parking meter\nAnd walked on down the road\nIt was a normal day\n\n[Verse 4]\nWell, I rung the fallout shelter bell\nAnd I leaned my head and I give a yell\n“Give me a string bean, I’m a hungry man”\nA shotgun fired, and away I ran\nI don’t blame him too much though, he didn't know me\n\n[Verse 5]\nDown at the corner by the hot-dog stand\nI seen a man\nI said “Howdy friend, I guess there’s just us two”\nHe screamed a bit, and away he flew\nThought I was a Communist\n\n[Verse 6]\nWell, I spied me a girl and before she could leave\nI said “Let’s go and play Adam and Eve”\nI took her by the hand, and my heart was thumping\nWhen she said “Hey man, you crazy or something?\nYou seen what happened last time they started”\n\n[Verse 7]\nWell, I seen me a Cadillac window uptown\nThere was nobody around\nI got into the driver’s seat\nAnd I drove down 42nd Street\nIn my Cadillac\nGood car to drive after a war\n\n[Verse 8]\nWell, I remember seeing some ad\nSo I turned on my Conelrad\nBut I didn’t pay the Con Ed bill\nSo the radio didn’t work so well\nTurned on my record player —\nIt was Rock-a-day Johnny, singing “Tell Your Ma, Tell Your Pa\nOur Love’s A-going to Grow, Ooh-wah, Ooh-wah”\n\n[Verse 9]\nI was feeling kind of lonesome and blue\nI needed somebody to talk to\nSo I called up the operator of time\nJust to hear a voice of some kind\n“When you hear the beep it will be three o’clock”\nShe said that for over an hour\nAnd I hung up\n\n[Verse 10]\nWell, the doctor interrupted me just about then\nSaying “Hey I’ve been having the same old dreams\nBut mine was a little different, you see\nI dreamt the only person left after the war was me\nI didn’t see you around\"\n\n[Verse 11]\nWell, now time passed and now it seems\nEverybody’s having them dreams\nEverybody sees their self\nWalking around with no one else\n\n[Outro]\n\"Half of the people can be part right all of the time\nAnd some of the people can be all right part of the time\nBut all of the people can’t be all right all of the time\"\nI think Abraham Lincoln said that\n“I’ll let you be in my dream if I can be in yours”\nI said that", "[Verse 1]\nI laid on a dune, I looked at the sky\nWhen the children were babies and played on the beach\nYou came up behind me, I saw you go by\nYou were always so close and still within reach\n\n[Chorus]\nSara, Sara\nWhatever made you want to change your mind?\nSara, Sara\nSo easy to look at, so hard to define\n\n[Verse 2]\nI can still see them playing with their pails in the sand\nThey run to the water their buckets to fill\nI can still see the shells falling out of their hands\nAs they follow each other back up the hill\n\n[Chorus]\nSara, Sara\nSweet virgin angel, sweet love of my life\nSara, Sara\nRadiant jewel, mystical wife\n\n[Verse 3]\nSleeping in the woods by a fire in the night\nDrinking white rum in a Portugal bar\nThem playing leapfrog and hearing about Snow White\nYou in the marketplace in Savanna-la-Mar\n\n[Chorus]\nSara, Sara\nIt’s all so clear, I could never forget\nSara, Sara\nLoving you is the one thing I’ll never regret\n\n[Verse 4]\nI can still hear the sounds of those Methodist bells\nI’d taken the cure and had just gotten through\nStaying up for days in the Chelsea Hotel\nWriting “Sad Eyed Lady of the Lowlands” for you\n\n[Chorus]\nSara, Sara\nWherever we travel we’re never apart\nSara, oh Sara\nBeautiful lady, so dear to my heart\n\n[Verse 5]\nHow did I meet you? I don’t know\nA messenger sent me in a tropical storm\nYou were there in the winter, moonlight on the snow\nAnd on Lily Pond Lane when the weather was warm\n\n[Chorus]\nSara, oh Sara\nScorpio Sphinx in a calico dress\nSara, Sara\nYou must forgive me my unworthiness\n\n[Verse 6]\nNow the beach is deserted except for some kelp\nAnd a piece of an old ship that lies on the shore\nYou always responded when I needed your help\nYou give me a map and a key to your door\n\n[Chorus]\nSara, oh Sara\nGlamorous nymph with an arrow and bow\nSara, oh Sara\nDon’t ever leave me, don’t ever go", "[Verse 1]\nIn Scarlet Town, where I was born\nThere’s ivy leaf and silver thorn\nThe streets have names that you can’t pronounce\nGold is down to a quarter of an ounce\nThe music starts and the people sway\nEverybody says, “Are you going my way?\"\nUncle Tom still working' for Uncle Bill\nScarlet Town is under the hill\n\n[Verse 2]\nScarlet Town in the month of May\nSweet William Holme on his deathbed lay\nMistress Mary by the side of the bed\nKissing' his face and putting' prayers on his head\nSo brave and true, so gentle is he\nI’ll weep for him as he would weep for me\nLittle Boy Blue come blow your horn\nIn Scarlet Town, where I was born\n\n[Verse 3]\nScarlet Town, in the hot noon hours\nThere’s palm-leaf shadows and scattered flowers\nBeggars crouching at the gate\nHelp comes, but it comes too late\nBy marble slabs and in fields of stone\nYou make your humble wishes known\nI touched the garment, but the hem was torn\nIn Scarlet Town, where I was born\n\n[Verse 4]\nIn Scarlet Town, the end is near\nThe Seven Wonders of the World are here\nThe evil and the good living' side by side\nAll human forms seem glorified\nPut your heart on a platter and see who will bite\nSee who will hold you and kiss you good night\nThere’s walnut groves and maplewood\nIn Scarlet Town crying' won’t do no good\n\n[Verse 5]\nIn Scarlet Town, you fight your father’s foes\nUp on the hill, a chilly wind blows\nYou fight ‘em on high and you fight 'em down in\nYou fight 'em with whiskey, morphine and gin\nYou’ve got legs that can drive men mad\nA lot of things we didn’t do that I wish we had\nIn Scarlet Town, the sky is clear\nYou’ll wish to God that you stayed right here\n\n[Verse 6]\nSet ‘em Joe, play “Walking the Floor\"\nPlay it for my flat-chested junkie whore\nI’m staying up late, I’m making amends\nWhile we smile, all heaven descends\nIf love is a sin, then beauty is a crime\nAll things are beautiful in their time\nThe black and the white, the yellow and the brown\nIt’s all right there in front of you in Scarlet Town", "[Verse 1]\nOur conversation was short and sweet\nIt nearly swept me off-a my feet\nAnd I'm back in the rain, oh, oh\nAnd you are on dry land\nYou made it there somehow\nYou're a big girl now\n\n[Verse 2]\nBird on the horizon, sitting on a fence\nHe's singing his song for me at his own expense\nAnd I'm just like that bird, oh, oh\nSinging just for you\nI hope that you can hear\nHear me singing through these tears\n\n[Verse 3]\nTime is a jet plane, it moves too fast\nOh, but what a shame that all we've shared can't last\nI can change, I swear, oh, oh\nSee what you can do\nI can make it through\nYou can make it too\n\n[Verse 4]\nLove is so simple, to quote a phrase\nYou've known it all the time, I'm learning it these days\nOh, I know where I can find you, oh, oh\nIn somebody's room\nIt's a price I have to pay\nYou're a big girl all the way\n\n[Verse 5]\nA change in the weather is known to be extreme\nBut what's the sense of changing horses in midstream?\nI'm going out of my mind, oh, oh\nWith a pain that stops and starts\nLike a corkscrew to my heart\nEver since we've been apart", "Oh my name it ain't nothin'\nMy age it means less\nThe country I come from\nIs called the Midwest\nI’s taught and brought up there\nThe laws to abide\nAnd that the land that I live in\nHas God on its side\n\nOh the history books tell it\nThey tell it so well\nThe cavalries charged\nThe Indians fell\nThe cavalries charged\nThe Indians died\nAh the country was young\nWith God on its side\n\nThe Spanish-American\nWar had its day\nAnd the Civil War too\nWas soon laid away\nAnd the names of the heroes\nI’s made to memorize\nWith guns in their hands\nAnd God on their side\n\nThe First World War boys\nIt came and it went\nThe reason for fightin'\nI never did get\nBut I learned to accept it\nAccept it with pride\nFor you don’t count the dead\nWhen God’s on your side\n\nThe Second World War\nCame to an end\nWe forgave the Germans\nAnd then we were friends\nThough they murdered six million\nIn the ovens they fried\nThe Germans now too\nHave God on their side\n\nI’ve learned to hate the Russians\nAll through my whole life\nIf another war comes\nIt’s them we must fight\nTo hate them and fear them\nTo run and to hide\nAnd accept it all bravely\nWith God on my side\n\nBut now we got weapons\nOf chemical dust\nIf fire them we’re forced to\nThen fire them we must\nOne push of the button\nAnd a shot the world wide\nAnd ya' never ask questions\nWhen God’s on your side\n\nThrough many dark hour\nI been thinking about this\nThat Jesus Christ\nWas betrayed by a kiss\nBut I can’t think for ya'\nYou’ll have to decide\nWhether Judas Iscariot\nHad God on his side\n\nSo now as I’m leavin'\nI’m weary as Hell\nThe confusion I’m feelin'\nAin't no tongue can tell\nThe words fill my head\nAnd they fall to the floor\nIf God’s on our side\nHe’ll stop the next war", "I was riding on the Mayflower\nWhen I thought I spied some land\nI yelled for Captain Arab\nI have you understand\nWho came running to the deck\nSaid, \"Boys, forget the whale\nLook on over yonder\nCut the engines\nChange the sail\nHaul on the bowline\"\nWe sang that melody\nLike all tough sailors do\nWhen they're far away at sea\n\n\"I think I'll call it America\"\nI said as we hit land\nI took a deep breath\nI fell down, I could not stand\nCaptain Arab he started\nWriting up some deeds\nHe said, \"Let's set up a fort\nAnd start buyin' a place with beads\"\nJust then this cop comes down the street\nCrazy as a loon\nHe throws us all in jail\nFor carrying harpoons\n\nAh, me I busted out\nDon't even ask me how\nI went to get some help\nI walked by a Guernsey cow\nWho directed me down\nTo the Bowery slums\nWhere people carried signs around\nSayin', \"Ban the bums\"\nI jumped right into line\nSayin' \"I hope that I'm not late\"\nWhen I realized I hadn't eaten\nFor five days straight\n\nI went into a restaurant\nLooking for the cook\nI told him I was the editor\nOf a famous etiquette book\nThe waitress he was handsome\nHe wore a powder blue cape\nI ordered some Suzette, I said\n\"Could you please make that Crepe?\"\nJust then the whole kitchen exploded\nFrom boilin' fat\nFood was flyin' everywhere\nI left without my hat\n\nNow, I didn't mean to be nosy\nBut I went into a bank\nTo get some bail for Arab\nAnd all the boys back in the tank\nThey asked me for some collateral\nAnd I pulled down my pants\nThey threw me in the alley\nWhen up comes this girl from France\nWho invited me to her house\nI went, but she had a friend\nWho knocked me out\nAnd robbed my boots\nAnd I was on the street again\n\nWell, I rapped upon a house\nWith the US flag upon display\nI said, \"Could you help me out\nI got some friends down the way\"\n\"The man says, \"Get out of here\nI'll tear you limb from limb\"\nI said, \"You know they refused Jesus, too\"\nHe said, \"You're not Him\nGet out of here before I break your bones\nI ain't your pop\"\nI decided to have him arrested\nAnd I went lookin' for a cop\n\nI ran right outside\nI hopped inside a cab\nI went out the other door\nThis Englishman said, \"Fab\"\nAs he saw me leap a hot dog stand\nAnd a chariot that stood\nParked across from a building\nAdvertising brotherhood\nI ran right through the front door\nLike a hobo sailor does\nBut it was just a funeral parlor\nAnd the man asked me who I was\n\nI repeated that my friends\nWere all in jail, with a sigh\nHe gave me his card\nHe said, \"Call me if they die\"\nI shook his hand and said goodbye\nRan out to the street\nWhen a bowling ball came down the road\nAnd knocked me off my feet\nA pay phone was ringing\nAnd it just about blew my mind\nWhen I picked it up and said hello\nThis foot came through the line\n\nWell, by this time I's fed up\nAt tryin' to make a stab\nAt bringing back any help\nFor my friends and captain Arab\nI decided to flip a coin\nLike either heads or tails\nWould let me know if I should go\nBack to ship or back to jail\nSo I hocked my sailor suit\nAnd I got a coin to flip\nIt came up tails\nIt rhymed with sails\nSo I made it back to the ship\n\nWell, I got back and took\nThe parking ticket off the mast\nI was ripping it to shreds\nWhen this coastguard boat went past\nThey asked me my name\nAnd I said, \"Captain Kidd\"\nThey believed me but\nThey wanted to know\nWhat exactly that I did\nI said for the Pope of Eruke\nI was employed\nThey let me go right away\nThey were very paranoid\n\nWell, the last I heard of Arab\nHe was stuck on a whale\nThat was married to the deputy\nSheriff of the jail\nBut the funniest thing was\nWhen I was leavin' the bay\nI saw three ships sailin'\nThere were all heading my way\nI asked the captain what his name was\nAnd how come he didn't drive a truck\nHe said his name was Columbus\nI just said, \"Good luck\"", "Well, I ride on a mail train, baby\nCan't buy a thrill\nWell, I been up all night\nLeanin' on the windowsill\nWell, if I die\nOn top of the hill\nAnd if I don’t make it\nYou know my baby will\n\nDon't the moon look good, mama\nShining through the trees?\nDon't the brakeman look good, mama\nFlaggin' down the “Double E?”\nDon't the sun look good\nGoin' down over the sea?\nBut don’t my gal look fine\nWhen she's comin' after me?\n\nNow the wintertime is coming\nThe windows are filled with frost\nI went to tell everybody\nBut I could not get across\nWell, I want to be your lover, baby\nI don’t want to be your boss\nDon’t say I never warned you\nWhen your train gets lost", "[Verse 1]\nIt was late last night when the boss came home\nTo a deserted mansion and a desolate throne\nServant said: “Boss, the lady’s gone\nShe left this morning just ‘fore dawn.”\n\n[Verse 2]\n“You got something to tell me, tell it to me, man\nCome to the point as straight as you can”\n“Old Henry Lee, chief of the clan\nCame riding through the woods and took her by the hand”\n\n[Verse 3]\nThe boss he lay back flat on his bed\nHe cursed the heat and he clutched his head\nHe pondered the future of his fate\nTo wait another day would be far too late\n\n[Verse 4]\n“Go fetch me my coat and my tie\nAnd the cheapest labour that money can buy\nSaddle me up my buckskin mare\nIf you see me go by, put up a prayer” (The Boss)\n\n[Verse 5]\nWell, they rode all night, and they rode all day\nEastward, long down the broad highway\nHis spirit was tired and his vision was bent\nHis men deserted him and onward he went\n\n[Verse 6]\nHe came to a place where the light was dull\nHis forehead pounding in his skull\nHeavy heart was racked with pain\nInsomnia raging in his brain\n\n[Verse 7]\nWell, he threw down his helmet and his cross-handled sword\nHe renounced his faith, he denied his lord\nCrawled on his belly, put his ear to the wall\nOne way or another put an end to it all\n\n[Verse 8]\nHe leaned down, cut the electric wire\nStared into the flames and he snorted the fire\nPeered through the darkness, caught a glimpse of the two\nIt was hard to tell for certain who was who\n\n[Verse 9]\nHe lowered himself down on a golden chain\nHis nerves were quaking in every vein\nHis knuckles were bloody, he sucked in the air\nHe ran his fingers through his greasy hair\n\n[Verse 10]\nThey looked at each other and their glasses clinked\nOne single unit, inseparably linked\n“Got a strange premonition there’s a man close by” (Henry Lee)\n“Don’t worry about him, he wouldn’t harm a fly” (The Wife)\n\n[Verse 11]\nFrom behind the curtain, the boss he crossed the floor\nHe moved his feet and he bolted the door\nShadows hiding the lines in his face\nWith all the nobility of an ancient race\n\n[Verse 12]\nShe turned, she was startled with a look of surprise\nWith a hatred that could hit the skies\n“You’re a reckless fool, I could see it in your eyes\nTo come this way was by no means wise” (The Wife)\n\n[Verse 13]\n“Get up, stand up, you greedy-lipped wench\nAnd cover your face or suffer the consequence\nYou are making my heart feel sick\nPut your clothes back on, double-quick” (The Boss)\n\n[Verse 14]\n“Silly boy, you think me a saint\nI’ll listen no more to your words of complaint\nYou’ve given me nothing but the sweetest lies\nNow hold your tongue and feed your eyes” (The Wife)\n\n[Verse 15]\n“I’d have given you the stars and the planets, too\nBut what good would these things do you?\nBow the heart if not the knee\nOr never again this world you’ll see” (The Boss)\n\n[Verse 16]\n“Oh, please let not your heart be cold\nThis man is dearer to me than gold” (The Wife)\n“Oh, my dear, you must be blind\nHe’s a gutless ape with a worthless mind” (The Boss)\n\n[Verse 17]\n“You’ve had your way too long with me\nNow it’s me who’ll determine how things shall be” (The Wife)\n“Try to escape,” he cussed and cursed\n‘You’ll have to try to get past me first” (The Boss)\n\n[Verse 18]\n“Do not let your passion rule\nYou think my heart the heart of a fool\nAnd you, sir, you can not deny\nYou made a monkey of me, what and for why?” (The Boss)\n\n[Verse 19]\n“I’ll have no more of this insulting chat\nThe devil can have you, I’ll see to that\nLook sharp or step aside\nOr in the cradle you’ll wish you’d died” (Henry Lee)\n\n[Verse 20]\nThe gun went boom and the shot rang clear\nFirst bullet grazed his ear\nSecond ball went right straight in\nAnd he bent in the middle like a twisted pin\n\n[Verse 21]\nHe crawled to the corner and he lowered his head\nHe gripped the chair and he grabbed the bed\nIt would take more than needle and thread\nBleeding from the mouth, he’s as good as dead\n\n[Verse 22]\n“You shot my husband down, you fiend” (The Wife)\n“Husband? What husband? What the hell do you mean?\nHe was a man of strife, a man of sin\nI cut him down and threw him to the wind” (Henry Lee)\n\n[Verse 23]\nThis she said with angry breath\n“You too shall meet the lord of death\nIt was I who brought your soul to life” (The Wife)\nThen she raised her robe and she drew out a knife\n\n[Verse 24]\nHis face was hard and caked with sweat\nHis arms ached and his hands were wet\n“You’re a murderous queen and a bloody wife\nIf you don’t mind, I’ll have the knife” (Henry Lee)\n\n[Verse 25]\n“We’re two of a kind and our blood runs hot\nBut we’re no way similar in body or thought\nAll husbands are good men, as all wives know” (The Wife)\nThen she pierced him to the heart and his blood did flow\n\n[Verse 26]\nHis knees went limp and he reached for the door\nHis tomb was sealed, he slid to the floor\nHe whispered in her ear: “This is all your fault\nMy fighting days have come to a halt” (Henry Lee)\n\n[Verse 27]\nShe touched his lips and kissed his cheek\nHe tried to speak but his breath was weak\n“You died for me, now I’ll die for you” (The Wife)\nShe put the blade to her heart and she ran it through\n\n[Verse 28]\nAll three lovers together in a heap\nThrown into the grave, forever to sleep\nFuneral torches blazed away\nThrough the towns and the villages all night and all day", "[Verse 1]\nThe festival was over, and the boys were all planning for a fall\nThe cabaret was quiet except for the drilling in the wall\nThe curfew had been lifted and the gambling wheel shut down\nAnyone with any sense had already left town\nHe was standing in the doorway looking like the Jack of Hearts\n\n[Verse 2]\nHe moved across the mirrored room, “Set it up for everyone,” he said\nThen everyone commenced to do what they were doing before he turned their heads\nThen he walked up to a stranger and he asked him with a grin\n“Could you kindly tell me, friend, what time the show begins?”\nThen he moved into the corner, face down like the Jack of Hearts\n\n[Verse 3]\nBackstage the girls were playing five-card stud by the stairs\nLily had two queens, she was hoping for a third to match her pair\nOutside the streets were filling up, the window was open wide\nA gentle breeze was blowing, you could feel it from inside\nLily called another bet and drew up the Jack of Hearts\n\n[Verse 4]\nBig Jim was no one’s fool, he owned the town's only diamond mine\nHe made his usual entrance looking so dandy and so fine\nWith his bodyguards and silver cane and every hair in place\nHe took whatever he wanted to and he laid it all to waste\nBut his bodyguards and silver cane were no match for the Jack of Hearts\n\n[Verse 5]\nRosemary combed her hair and took a carriage into town\nShe slipped in through the side door looking like a queen without a crown\nShe fluttered her false eyelashes and whispered in his ear\n“Sorry, darling, that I’m late,” but he didn't seem to hear\nHe was staring into space over at the Jack of Hearts\n\n[Verse 6]\n“I know I’ve seen that face somewhere,” Big Jim was thinking to himself\n“Maybe down in Mexico or a picture up on somebody’s shelf”\nBut then the crowd began to stamp their feet and the house lights did dim\nAnd in the darkness of the room there was only Jim and him\nStaring at the butterfly who just drew the Jack of Hearts\n\n[Verse 7]\nLily was a princess, she was fair-skinned and precious as a child\nShe did whatever she had to do, she had that certain flash every time she smiled\nShe had come away from a broken home, had lots of strange affairs\nWith men in every walk of life which took her everywhere\nBut she’d never met anyone quite like the Jack of Hearts\n\n[Verse 8]\nThe hanging judge came in unnoticed and was being wined and dined\nThe drilling in the wall kept up but no one seemed to pay it any mind\nIt was known all around that Lily had Jim’s ring\nAnd nothing would ever come between Lily and the king\nNo, nothing ever would except maybe the Jack of Hearts\n\n[Verse 9]\nRosemary started drinking hard and seeing her reflection in the knife\nShe was tired of the attention, tired of playing the role of Big Jim’s wife\nShe had done a lot of bad things, even once tried suicide\nWas looking to do just one good deed before she died\nShe was gazing to the future, riding on the Jack of Hearts\n\n[Verse 10]\nLily took her dress off, buried it away\n“Has your luck run out?” she laughed at him, “Well, I guess you must\nHave known it would someday\nBe careful not to touch the wall, there’s a brand-new coat of paint\nI’m glad to see you’re still alive, you’re looking like a saint”\nDown the hallway footsteps were coming for the Jack of Hearts\n\n[Verse 11]\nThe backstage manager was pacing all around by his chair\n“There’s something funny going on,” he said, “I can just feel it in the air”\nHe went to get the hanging judge, but the hanging judge was drunk\nAs the leading actor hurried by in the costume of a monk\nThere was no actor anywhere better than the Jack of Hearts\n\n[Verse 12]\nNo one knew the circumstance but they say that it happened pretty quick\nThe door to the dressing room burst open and a Colt revolver clicked\nAnd Big Jim was standing there, ya couldn't say surprised\nRosemary right beside him, steady in her eyes\nShe was with Big Jim but she was leaning to the Jack of Hearts\n\n[Verse 13]\nTwo doors down the boys finally made it through the wall\nAnd cleaned out the bank safe, it’s said that they got off with quite a haul\nIn the darkness by the riverbed they waited on the ground\nFor one more member who had business back in town\nBut they couldn't go no further without the Jack of Hearts\n\n[Verse 14]\nThe next day was hanging day, the sky was overcast and black\nBig Jim lay covered up, killed by a penknife in the back\nAnd Rosemary on the gallows, she didn't even blink\nThe hanging judge was sober, he hadn't had a drink\nThe only person on the scene missing was the Jack of Hearts\n\n[Verse 15]\nThe cabaret was empty now, a sign said, “Closed for repair”\nLily had already taken all of the dye out of her hair\nShe was thinking ’bout her father, who she very rarely saw\nThinking ’bout Rosemary and thinking about the law\nBut most of all she was thinking ’bout the Jack of Hearts", "When your mother sends back all your invitations\nAnd your father to your sister he explains\nThat you’re tired of yourself and all of your creations\n\nWon’t you come see me, Queen Jane?\nWon’t you come see me, Queen Jane?\n\nNow when all of the flower ladies want back what they have lent you\nAnd the smell of their roses does not remain\nAnd all of your children start to resent you\n\nWon’t you come see me, Queen Jane?\nWon’t you come see me, Queen Jane?\n\nNow when all the clowns that you have commissioned\nHave died in battle or in vain\nAnd you’re sick of all this repetition\n\nWon’t you come see me, Queen Jane?\nWon’t you come see me, Queen Jane?\n\nOh, when all of your advisers heave their plastic\nAt your feet to convince you of your pain\nTrying to prove that your conclusions should be more drastic\n\nWon’t you come see me, Queen Jane?\nWon’t you come see me, Queen Jane?\n\nNow when all of the bandits that you turned your other cheek to\nAll lay down their bandanas and complain\nAnd you want somebody ya' don’t have to speak to\n\nWon’t you come see me, Queen Jane?\nAw, won’t you come see me, Queen Jane?", "[Verse 1]\nBuckets of rain\nBuckets of tears\nGot all them buckets comin’ out of my ears\nBuckets of moonbeams in my hand\nYou got all the love\nHoney baby, I can stand\n\n[Verse 2]\nI been meek\nAnd hard like an oak\nI've seen pretty people disappear like smoke\nFriends will arrive, friends will disappear\nIf you want me\nHoney baby, I’ll be here\n\n[Verse 3]\nI like your smile\nAnd your fingertips\nI like the way that you move your hips\nI like the cool way you look at me\nEverything about you is bringing me misery\n\n[Verse 4]\nLittle red wagon\nLittle red bike\nI ain’t no monkey, but I know what I like\nI like the way you love me strong and slow\nI’m taking you with me\nHoney baby, when I go\n\n[Verse 5]\nLife is sad\nLife is a bust\nAll you can do is do what you must\nYou do what you must do, and you do it well\nI do it for you\nHoney baby, can’t you tell?", "When she said\n“Don’t waste your words, they’re just lies”\nI cried she was deaf\nAnd she worked on my face until breaking my eyes\nAn' said, “What else you got left?”\nYeah, it was then that I got up to leave\nBut she said, “Don’t forget\nEverybody must give something back\nFor something they get”\n\nI stood there and hummed\nI tapped on her drum I asked her \"How come?\"\nAnd she buttoned her boot\nAnd straightened her suit\nThen she said, “Don’t get cute”\nSo I forced my hands in my pockets\nAnd felt with my thumbs\nAnd gallantly handed her\nMy very last piece of gum\n\nShe threw me outside\nI stood in the dirt where everyone walked\nAnd after finding out I’d\nForgotten my shirt\nI went back and knocked\nI waited in the hallway, she went to get it\nAnd I tried to make sense\nOut of that picture of you in your wheelchair\nThat leaned up against\n\nHer Jamaican rum\nAnd when she did come, I asked her for some\nShe said, “No, dear”\nI said, “Your words aren’t clear\nYou’d better spit out your gum”\nShe screamed 'til her face got so red\nThen she fell on the floor\nAnd I covered her up and then\nThought I’d go look through her drawer\n\nAnd when I was through\nI filled up my shoe\nAnd brought it to you\nAnd you, you took me in\nYou loved me then\nYou never wasted time\nAnd I, I never took much\nI never asked for your crutch\nNow don’t ask for mine", "They say every man must need protection\nThey say every man must fall\nYet I swear I see my reflection\nSome place so high above the wall\n\nI see my light come shining\nFrom the west down to the east\nAny day now, any day now\nI shall be released\n\nDown here next to me in this lonely crowd\nThere's a man who swears he's not to blame\nAll day long I hear him cry so loud\nCalling out that he's been framed\nYeah\n\nI see my light come shining\nFrom the west down to the east\nAny day now, any day now\nI shall be released", "[Verse 1]\nI'm gonna walk across the desert 'til I'm in my right mind\nI won't even think about what I left behind\nNothing back there anyway that I can call my own\nGo back home, leave me alone\nIt's a long road, it's a long and narrow way\nIf I can't work up to you, you'll surely have to work down to me someday\n\n[Verse 2]\nEver since the British burned the White House down\nThere's a bleeding wound in the heart of town\nI saw you drinking from an empty cup\nI saw you buried and I saw you dug up\nIt's a long road, it's a long and narrow way\nIf I can't work up to you, you'll surely have to work down to me someday\n\n[Verse 3]\nLook down angel from the skies\nHelp my weary soul to rise\nI kissed her cheek I dragged your plow\nYou broke my heart, I was your friend 'til now\nIt's a long road, it's a long and narrow way\nIf I can't work up to you, you'll surely have to work down to me someday\n\n[Verse 4]\nIn the courtyard of the golden sun\nYou stand and fight or you break and run\nYou went and lost your lovely head\nFor a drink of wine and a crust of bread\nIt's a long road, it's a long and narrow way\nIf I can't work up to you, you'll surely have to work down to me someday\n\n[Verse 5]\nWe looted and we plundered on distant shores\nWhy is my share not equal to yours\nYour father left you, your mother too\nEven death has washed its hands of you\nIt's a long road, it's a long and narrow way\nIf I can't work up to you, you'll surely have to work down to me someday\n\n[Verse 6]\nThis is hard country to stay alive in\nBlades are everywhere and they're breaking my skin\nI'm armed to the hilt and I'm struggling hard\nYou won't get out of here unscarred\nIt's a long road, it's a long and narrow way\nIf I can't work up to you, you'll surely have to work down to me someday\n\n[Verse 7]\nYou got too many lovers waiting at the wall\nIf I had a thousand tongues, I couldn't count them all\nYesterday I could've thrown them all in the sea\nToday, even one, may be too much for me\nIt's a long road, it's a long and narrow way\nIf I can't work up to you, you'll surely have to work down to me someday\n\n[Verse 8]\nCan't walk them, baby, you could do no wrong\nPut your arms around me, where they belong\nI won't take you on a roller-coaster ride\nLay my hands all over you, tie you to my side\nIt's a long road, it's a long and narrow way\nIf I can't work up to you, you'll surely have to work down to me someday\n\n[Verse 9]\nI've got a heavy stacked woman with a smile on her face\nAnd she has crowned my soul with grace\nIm still hurting from an arrow that pierced my chest\nI'm gonna have to take my head and bury it between your breasts\nIt's a long road, it's a long and narrow way\nIf I can't work up to you, you'll surely have to work down to me someday\n\n[Verse 10]\nBeen dark all night but now it's dawn\nThe moving finger is moving on\nYou can guard me while I sleep\nKiss away the tears I weep\nIt's a long road, it's a long and narrow way\nIf I can't work up to you, you'll surely have to work down to me someday\n\n[Verse 11]\nI love women and she loves men\nWe've been to the west and we going back again\nI heard a voice at the dusk of day\nSaying, \"Be gentle brother, be gentle and pray.\"\nIt's a long road, it's a long and narrow way\nIf I can't work up to you, you'll surely have to work down to me someday", "[Verse 1]\nShadows are falling\nAnd I’ve been here all day\nIt’s too hot to sleep\nAnd time is running away\nFeel like my soul has\nTurned into steel\nI’ve still got the scars\nThat the sun didn’t heal\nThere’s not even room enough\nTo be anywhere\n\n[Refrain]\nIt’s not dark yet\nBut it’s getting there\n\n[Verse 2]\nWell, my sense of humanity\nHas gone down the drain\nBehind every beautiful thing\nThere’s been some kind of pain\nShe wrote me a letter\nAnd she wrote it so kind\nShe put down in writing\nWhat was in her mind\nI just don’t see why I should even care\n\n[Refrain]\nIt’s not dark yet\nBut it’s getting there\n\n[Verse 3]\nWell, I’ve been to London\nAnd I’ve been to gay Paris\nI’ve followed the river\nAnd I got to the sea\nI’ve been down on the bottom\nOf a world full of lies\nI ain’t looking for nothing\nIn anyone’s eyes\nSometimes my burden\nIs more than I can bear\n\n[Refrain]\nIt’s not dark yet\nBut it’s getting there\n\n[Instrumental Interlude]\n\n[Verse 4]\nI was born here, and I’ll die here\nAgainst my will\nI know it looks like I’m moving\nBut I’m standing still\nEvery nerve in my body\nIs so vacant and numb\nI can’t even remember what it was\nI came here to get away from\nDon’t even hear a murmur of a prayer\n\n[Refrain]\nIt’s not dark yet\nBut it’s getting there", "[Harmonizing]\n\n[Verse 1]\nThe man in me will do nearly any task\nAnd as for compensation, there’s little he would ask\nTake a woman like you\nTo get through to the man in me\n\n[Verse 2]\nStorm clouds are raging all around my door\nI think to myself I might not take it anymore\nTake a woman like your kind\nTo find the man in me\n\n[Verse 3]\nBut, oh, what a wonderful feeling\nJust to know that you are near\nSets my heart a-reeling\nFrom my toes up to my ears\n\n[Verse 4]\nThe man in me will hide sometimes to keep from bein’ seen\nBut that’s just because he doesn’t want to turn into some machine\nTook a woman like you\nTo get through to the man in me", "[Verse 1]\nI married Isis on the fifth day of May\nBut I could not hold on to her very long\nSo I cut off my hair and I rode straight away\nFor the wild unknown country where I could not go wrong\n\n[Verse 2]\nI came to a high place of darkness and light\nDividing line ran through the center of town\nI hitched up my pony to a post on the right\nWent in to a laundry to wash my clothes down\n\n[Verse 3]\nA man in the corner approached me for a match\nI knew right away, he was not ordinary\nHe said “Are you looking for something easy to catch?”\nSaid “I got no money”\nHe said “That ain't necessary”\n\n[Verse 4]\nWe set out that night, for the cold in the North\nI gave him my blanket, and he gave me his word\nI said “Where are we going?” He said we’d be back by the fourth\nI said “That’s the best news that I’ve ever heard”\n\n[Verse 5]\nI was thinking about turquoise, I was thinking about gold\nI was thinking about diamonds, and the world’s biggest necklace\nAs we rode through the canyons, through the devilish cold\nI was thinking about Isis, how she thought I was so reckless\n\n[Verse 6]\nHow she told me that one day we would meet up again\nAnd things would be different the next time we wed\nIf I only could hang on and just be her friend\nI still can’t remember all the best things she said\n\n[Verse 7]\nWe came to the pyramids, all embedded in ice\nHe said “There’s a body I’m trying to find\nIf I carry it out it’ll bring a good price”\n'Twas then that I knew what he had on his mind\n\n[Verse 8]\nThe wind it was a-howlin', and the snow was outrageous\nWe chopped through the night\nAnd we chopped through the dawn\nWhen he died I was hoping that it wasn’t contagious\nBut I made up my mind that I had to go on\n\n[Verse 9]\nI broke into the tomb, but the casket was empty\nThere was no jewels, no nothing! I felt I’d been had\nWhen I saw that my partner was just being friendly\nWhen I took up his offer I must've been mad\n\n[Verse 10]\nI picked up his body and I dragged him inside\nThrew him down in the hole, and I put back the cover\nI said a quick prayer, then I felt satisfied\nThen I rode back to find Isis, just to tell her I love her\n\n[Verse 11]\nShe was there in the meadow, where the creek used to rise\nBlinded by sleep, and in need of a bed\nI came in from the East, with the sun in my eyes\nI cursed her one time, then I rode on ahead\n\n[Verse 12]\nShe said “Where you been?” I said “No place special”\nShe said “You look different” I said “Well... I guess”\nShe said “You been gone” I said “That’s only natural”\nShe said “You going to stay?” I said “If you want me to, yes\"\n\n[Verse 13]\nIsis, oh, Isis, you mystical child\nWhat drives me to you is what drives me insane\nI still can remember the way that you smiled\nOn the fifth day of May in the drizzling rain", "[Verse 1]\nWell, I see you got your\nBrand new leopard-skin pillbox hat\nYes, I see you got your\nBrand new leopard-skin pillbox hat\nWell, you must tell me, baby\nHow your head feels under something like that\nUnder your brand new leopard-skin pillbox hat\n\n[Verse 2]\nWell, you look so pretty in it\nHoney, can I jump on it sometime?\nYes, I just want to see\nIf it’s really the expensive kind\nYou know it balances on your head\nJust like a mattress balances\nOn a bottle of wine\nYour brand new leopard-skin pillbox hat\n\n[Verse 3]\nWell, if you want to see the sun rise\nHoney, I know where\nWe'll go out and see it sometime\nWe’ll both just sit there and stare\nMe with my belt wrapped around my head\nAnd you just sittin' there\nIn your brand new leopard-skin pillbox hat\n\n[Guitar Solo]\n\n[Verse 4]\nWell, I asked the doctor if I could see you\n\"It’s bad for your health,\" he said\nYes, I disobeyed his orders\nI came to see you\nBut I found him there instead\nYou know, I don’t mind you cheatin' on me\nBut I sure wish he’d take that off his head\nYour brand new leopard-skin pillbox hat\n\n[Verse 5]\nWell, I see you got a new boyfriend\nYou know, I never seen him before\nWell, I saw you making love with him\nYou forgot to close the garage door\nYou might think he loves you for your money\nBut I know what he really loves you for\nIt’s your brand new leopard-skin pillbox hat", "[Verse 1]\nA worried man with a worried mind\nNo one in front of me and nothing behind\nThere’s a woman on my lap and she’s drinking champagne\nGot white skin, got assassin’s eyes\nI’m looking up into the sapphire-tinted skies\nI’m well dressed, waiting on the last train\nStanding on the gallows with my head in a noose\nAny minute now I’m expecting all hell to break loose\n\n[Chorus]\nPeople are crazy and times are strange\nI’m locked in tight, I’m out of range\nI used to care, but things have changed\n\n[Verse 2]\nThis place ain’t doing me any good\nI’m in the wrong town, I should be in Hollywood\nJust for a second there I thought I saw something move\nGonna take dancing lessons, do the jitterbug rag\nAin’t no shortcuts, gonna dress in drag\nOnly a fool in here would think he’s got anything to prove\nLot of water under the bridge, lot of other stuff too\nDon’t get up gentlemen, I’m only passing through\n\n[Chorus]\nPeople are crazy and times are strange\nI’m locked in tight, I’m out of range\nI used to care, but things have changed\n\n[Verse 3]\nI’ve been walking forty miles of bad road\nIf the Bible is right, the world will explode\nI’ve been trying to get as far away from myself as I can\nSome things are too hot to touch\nThe human mind can only stand so much\nYou can’t win with a losing hand\nFeel like falling in love with the first woman I meet\nPutting her in a wheelbarrow and wheeling her down the street\n\n[Chorus]\nPeople are crazy and times are strange\nI’m locked in tight, I’m out of range\nI used to care, but things have changed\n\n[Verse 4]\nI hurt easy, I just don’t show it\nYou can hurt someone and not even know it\nThe next sixty seconds could be like an eternity\nGonna get low down, gonna fly high\nAll the truth in the world adds up to one big lie\nI’m in love with a woman who don’t even appeal to me\nMr. Jinx and Miss Lucy, they jumped in the lake\nI’m not that eager to make a mistake\n\n[Chorus]\nPeople are crazy and times are strange\nI’m locked in tight, I’m out of range\nI used to care, but things have changed", "[Verse 1]\nI'm searching for phrases\nTo sing your praises\nI need to tell someone\nIt's soon after midnight\nAnd my day has just begun\n\n[Verse 2]\nA gal named Honey\nTook my money\nShe was passing by\nIt's soon after midnight\nAnd the moon is in my eye\n\n[Verse 3]\nMy heart is cheerful\nIt's never fearful\nI've been down on the killing floors\nI'm in no great hurry\nI'm not afraid of your fury\nI've faced stronger walls than yours\n\n[Verse 4]\nCharlotte's a harlot\nDresses in scarlet\nMary dresses in green\nIt's soon after midnight\nAnd I've got a date with the fairy queen\n\n[Verse 5]\nThey chirp and they chatter\nWhat does it matter?\nThey're lying there dying in their blood\nTwo-timing Slim\nWho's ever heard of him\nI'll drag his corpse through the mud\n\n[Verse 6]\nIt's now or never\nMore than ever\nWhen I met you I didn't think you would do\nIt's soon after midnight\nAnd I don't want nobody but you", "All the early Roman Kings in their sharkskin suits\nBowties and buttons, high top boots\nDriving the spikes in, blazing the rails\nNailed in their coffins in top hats and tails\nFly away little bird, fly away, flap your wings\nFly by night like the early Roman Kings\n\nAll the early Roman Kings in the early, early morn’\nComing down the mountain, distributing the corn\nSpeeding through the forest, racing down the track\nYou try to get away, they drag you back\nTomorrow is Friday, we’ll see what it brings\nEverybody’s talking ‘bout the early Roman Kings\n\nThey’re peddlers and they’re meddlers, they buy and they sell\nThey destroyed your city, they’ll destroy you as well\nThey’re lecherous and treacherous, hell bent for leather\nEach of them bigger than all men put together\nSluggers and muggers wearing fancy gold rings\nAll the women going crazy for the early Roman Kings\n\nI'll dress up your wounds with a blood clotted rag\nI ain’t afraid to make love to a bitch or a hag\nIf you see me coming and you’re standing there\nWave your handkerchief in the air\nI ain’t dead yet, my bell still rings\nI keep my fingers crossed like the early Roman Kings\n\nI'll strip you of life, strip you of breath\nShip you down to the house of death\nOne day you will ask for me\nThere’ll be no one else that you’ll want to see\nBring down my fiddle, tune up my strings\nGonna break it wide open like the early Roman Kings\n\nI was up on black mountain the day Detroit fell\nThey killed them all off and they sent them to hell\nDing Dong Daddy, you’re coming up short\nGonna put you on trial in a Sicilian court\nI’ve had my fun, I’ve had my flings\nGonna shake ‘em all down like the early Roman Kings", "A bullet from the back of a bush took Medgar Evers’ blood\nA finger fired the trigger to his name\nA handle hid out in the dark\nA hand set the spark\nTwo eyes took the aim\nBehind a man’s brain\nBut he can’t be blamed\nHe’s only a pawn in their game\n\nA South politician preaches to the poor white man\n“You got more than the blacks, don’t complain\nYou’re better than them, you been born with white skin,” they explain\nAnd the Negro’s name\nIs used it is plain\nFor the politician’s gain\nAs he rises to fame\nAnd the poor white remains\nOn the caboose of the train\nBut it ain't him to blame\nHe’s only a pawn in their game\n\nThe deputy sheriffs, the soldiers, the governors get paid\nAnd the marshals and cops get the same\nBut the poor white man’s used in the hands of them all like a tool\nHe’s taught in his school\nFrom the start by the rule\nThat the laws are with him\nTo protect his white skin\nTo keep up his hate\nSo he never thinks straight\n'Bout the shape that he’s in\nBut it ain't him to blame\nHe’s only a pawn in their game\n\nFrom the poverty shacks, he looks from the cracks to the tracks\nAnd the hoof beats pound in his brain\nAnd he’s taught how to walk in a pack\nShoot in the back, with his fist in a clinch\nTo hang and to lynch\nTo hide 'neath the hood\nTo kill with no pain\nLike a dog on a chain\nHe ain't a-got no name\nBut it ain't him to blame\nHe’s only a pawn in their game\n\nToday, Medgar Evers was buried from the bullet he caught\nThey lowered him down as a king\nBut when the shadowy sun sets on the one\nThat fired the gun\nHe’ll see by his grave\nOn the stone that remains\nCarved next to his name\nHis epitaph plain\nOnly a pawn in their game", "[Chorus 1: Bob Dylan]\nIf you’re travelin' to the north country fair\nWhere the winds hit heavy on the borderline\nRemember me to one who lives there\nFor she once was a true love of mine\n\n[Verse 1: Johnny Cash]\nSee for me that her hair's hangin' down\nIt curls and falls all down her breast\nSee for me that her hair's hangin' down\nThat's the way I remember her best\n\n[Verse 2: Bob Dylan]\nIf you go when the snowflakes fall\nWhen the rivers freeze and summer ends\nPlease see for me if she's wearing a coat so warm\nTo keep her from the howling winds\n\n[Chorus 2: Johnny Cash & Bob Dylan]\nIf you’re travelin' in the north country fair\nWhere the winds hit heavy on the borderline\nPlease say hello (Remember me) to the one who lives there\nFor she once was a true love of mine\n\nIf you’re travelin' in the north country fair\nWhere the winds hit heavy on the borderline\nRemember me to the one who lives there\nFor she once was a true love of mine\n\n[Outro: Johnny Cash & Bob Dylan]\nA true love of mine\nA true love of mine\nA true love of mine\nA true love of mine\nA true love of mine\nA true love of mine\nShe once was a true love of mine", "Down the street the dogs are barkin'\nAnd the day is a-gettin' dark\nAs the night comes in a-falling\nThe dogs will lose their bark\nAnd the silent night will shatter\nFrom the sounds inside my mind\nYes I’m one too many mornings\nAnd a thousand miles behind\n\nFrom the crossroads of my doorstep\nMy eyes start to fade\nAnd I turn my head back to the room\nWhere my love and I have laid\nAnd I gaze back to the street\nThe sidewalk and the sign\nAnd I’m one too many mornings\nAnd a thousand miles behind\n\nIt’s a restless hungry feeling\nThat don’t mean no one no good\nWhen everything I’m a-sayin'\nYou can say it just as good\nYou’re right from your side\nI'm right from mine\nWe’re both just one too many mornings\nAnd a thousand miles behind", "[Verse 1]\nWell, I took me a woman late last night\nI’s three-fourths drunk, she looked alright\n'Til she started peeling off her onion gook\nTook off her wig, said, “How do I look?\"\nI's high flying, bare-naked\nOut the window\n\n[Verse 2]\nWell, sometimes I might get drunk\nWalk like a duck and smell like a skunk\nDon’t hurt me none, it don’t hurt my pride\nBecause I got my little lady right by my side\nShe's a tryin to hide, pretendin' she don't know me\n\n[Verse 3]\nI’s out there painting on the old woodshed\nWhen a can of black paint, it fell on my head\nI went down to scrub and rub\nBut I had to sit in back of the tub\nCost a quarter\nHalf price\n\n[Verse 4]\nWell, my telephone rang, it would not stop\nIt’s President Kennedy calling me up\nHe said, “My friend, Bob\nWhat do we need to make the country grow?”\nI said, “My friend, John, Brigitte Bardot\nAnita Ekberg\nSophia Loren”\nCountry'll grow\n\n[Verse 5]\nWell, I got a woman, five feet short\nShe yells and hollers and screams and snorts\nShe tickles my nose, pats me on the head\nRolls me over and kicks me out of bed\nShe’s a man-eater, meat-grinder, bad loser\n\n[Verse 6]\nOh, there ain't no use in me working all the time\nI got a woman who works herself blind\nWorks up to her britches, up to her neck\nWrites me letters and sends me checks\nShe’s a humdinger\nFolk singer\n\n[Verse 7]\nLate one day in the middle of the week\nEyes were closed, I was half asleep\nI chased me a woman up the hill\nRight in the middle of an air-raid drill\nI jumped a fallout shelter\nI jumped a string bean\nI jumped a TV dinner\nI jumped a shotgun\n\n[Verse 8]\nNow, the man on the stand, he wants my vote\nHe’s a-running for office on the ballot note\nHe’s out there preaching in front of the steeple\nTelling me he loves all kinds of people\nHe’s eatin' bagels\nHe’s eatin' pizza\nHe’s eatin' chitlins\n\n[Verse 9]\nOh, set me down on a television floor\nI’ll flip the channel to number four\nOut of the shower comes a football man\nWith a bottle of oil in his hand\nGreasy kid stuff\nWhat I want to know, Mr. Football Man, is\nWhat do you do about Willy Mays\nMartin Luther King\nOlatunji\n\n[Verse 10]\nWell, the funniest woman I ever seen\nWas the great-granddaughter of Mr. Clean\nShe takes about fifteen baths a day\nWants me to grow a mustache on my face\nShe’s insane\n\n[Verse 11]\nWell, they ask me why I’m drunk all the time\nIt levels my head and eases my mind\nI just walk along and stroll and sing\nI see better days and I do better things\nI catch dinosaurs\nMake love to Elizabeth Taylor\nCatch hell from Richard Burton", "[Verse 1]\nIt's been such a long long time\nSince we loved each other when our hearts were true\nOne time, for one brief day, I was the man for you\n\nLast night I heard you talking in your sleep\nSaying things you shouldn't say, oh baby\nYou just may have to go to jail someday\n\n[Verse 2]\nIs there a place we can go?\nIs there anybody we can see?\nMaybe it's the same for you as it is for me\n\nI ain't seen my family in twenty years\nThat ain't easy to understand, they may be dead by now\nI lost track of em after they lost their land\n\n[Verse 3]\nShake it up baby, twist and shout\nYou know what it's all about\nWhat are you doing out there in the sun anyway?\nDon't you know, the sun can burn your brains right out\n\n[Verse 4]\nMy enemy crashed into the dust\nStopped dead in his tracks and he lost his lust\nHe was run down hard and he broke apart\nHe died in shame, he had an iron heart\n\n[Verse 5]\nI wear dark glasses to cover my eyes\nThere are secrets in em that I can't disguise\nCome back baby\nIf I hurt your feelings, I apologize\n\n[Verse 6]\nTwo trains running side by side, forty miles wide\nDown the eastern line\nYou don't have to go\nI just came to you because you're a friend of mine\n\n[Verse 7]\nI think that when my back was turned\nThe whole world behind me burned\nIt's been a while\nSince we walked down that long, long aisle\n\n[Verse 8]\nWe cried on a cold and frosty morn\nWe cried because our souls were torn\nSo much for tears\nSo much for these long and wasted years", "[Verse 1]\nStanding on the waters casting your bread\nWhile the eyes of the idol with the iron head are glowing\nDistant ships sailing into the mist\nYou were born with a snake in both of your fists while a hurricane was blowing\nFreedom just around the corner for you\nBut with the truth so far off, what good will it do?\n\n[Chorus]\nJokerman dance to the nightingale tune\nBird fly high by the light of the moon\nOh, oh, oh, Jokerman\n\n[Verse 2]\nSo swiftly the sun sets in the sky\nYou rise up and say goodbye to no one\nFools rush in where angels fear to tread\nBoth of their futures, so full of dread, you don't show one\nShedding off one more layer of skin\nKeeping one step ahead of the persecutor within\n\n[Chorus]\nJokerman dance to the nightingale tune\nBird fly high by the light of the moon\nOh, oh, oh, Jokerman\n\n[Verse 3]\nYou're a man of the mountains, you can walk on the clouds\nManipulator of crowds, you're a dream twister\nYou're going to Sodom and Gomorrah\nBut what do you care? Ain't nobody there would want to marry your sister\nFriend to the martyr, a friend to the woman of shame\nYou look into the fiery furnace, see the rich man without any name\n\n[Chorus]\nJokerman dance to the nightingale tune\nBird fly high by the light of the moon\nOh, oh, oh, Jokerman\n\n[Verse 4]\nWell, the Book of Leviticus and Deuteronomy\nThe law of the jungle and the sea are your only teachers\nIn the smoke of the twilight on a milk-white steed\nMichelangelo indeed could've carved out your features\nResting in the fields, far from the turbulent space\nHalf asleep near the stars with a small dog licking your face\n\n[Chorus]\nJokerman dance to the nightingale tune\nBird fly high by the light of the moon\nOh, oh, oh, Jokerman\n\n[Verse 5]\nWell, the rifleman's stalking the sick and the lame\nPreacherman seeks the same, who'll get there first is uncertain\nNightsticks and water cannons, tear gas, padlocks\nMolotov cocktails and rocks behind every curtain\nFalse-hearted judges dying in the webs that they spin\nOnly a matter of time till night comes stepping in\n\n[Chorus]\nJokerman dance to the nightingale tune\nBird fly high by the light of the moon\nOh, oh, oh, Jokerman\n\n[Verse 6]\nIt's a shadowy world, skies are slippery grey\nA woman just gave birth to a prince today and dressed him in scarlet\nHe'll put the priest in his pocket, put the blade to the heat\nTake the motherless children off the street\nAnd place them at the feet of a harlot\nOh, Jokerman, you know what he wants\nOh, Jokerman, you don't show any response\n\n[Chorus]\nJokerman dance to the nightingale tune\nBird fly high by the light of the moon\nOh, oh, oh, Jokerman", "[Verse 1]\nPerhaps it's the color of the sun cut flat\nAnd covering the crossroads I'm standing at\nOr maybe it's the weather or something like that\nBut mama you been on my mind\n\n[Verse 2]\nI don't mean trouble please don't put me down or get upset\nI am not pleading, or saying I can't forget you\nI do not pace the floor bowed down and bent, but yet\nMama you been on my mind\n\n[Verse 3]\nEven though my eyes are hazy\nAnd my thoughts they might be narrow\nWhere you been don't bother me\nOr bring me down with sorrow\nI don't even mind who you'll be waking with tomorrow\nMama you're just on my mind\n\n[Verse 4]\nI'm not asking you to say words like yes or no\nPlease, understand me, I have no place I'm calling you to go\nI'm just whispering to myself so I can't pretend that I don't know\nMama you are on my mind\n\n[Verse 5]\nWhen you wake up in the morning, baby look inside your mirror\nYou know I won't be next to you, you know I won't be near\nI'd just be curious to know if you can see yourself as clear\nAs someone who has had you on his mind", "William Zanzinger killed poor Hattie Carroll\nWith a cane that he twirled around his diamond ring finger\nAt a Baltimore hotel society gatherin'\nAnd the cops was called in and his weapon took from him\nAs they rode him in custody down to the station\nAnd booked William Zanzinger for first-degree murder\nBut you who philosophize disgrace and criticize all fears\nTake the rag away from your face\nNow ain't the time for your tears\n\nWilliam Zanzinger, who at twenty-four years\nOwns a tobacco farm of six hundred acres\nWith rich wealthy parents who provide and protect him\nAnd high office relations in the politics of Maryland\nReacted to his deed with a shrug of his shoulders\nAnd swear words and sneering, and his tongue it was a-snarling\nAnd in a matter of minutes on bail was out walking\nBut you who philosophize disgrace and criticize fears\nTake the rag away from your face\nNow ain't the time for your tears\n\nHattie Carroll was a maid in the kitchen\nShe was fifty-one years old and gave birth to ten children\nWho carried the dishes and took out the garbage\nAnd never sat once at the head of the table\nAnd didn’t even talk to the people at the table\nWho just cleaned up all the food from the table\nAnd emptied the ashtrays on a whole other level\nGot killed by a blow, lay slain by a cane\nThat sailed through the air and came down through the room\nDoomed and determined to destroy all the gentle\nAnd she never done nothin' to William Zanzinger\nAnd you who philosophize disgrace and criticize all fears\nTake the rag away from your face\nNow ain't the time for your tears\n\nIn the courtroom of honor, the judge pounded his gavel\nTo show that all’s equal and that the courts are on the level\nAnd that the strings in the books ain’t pulled and persuaded\nAnd that even the nobles get properly handled\nOnce that the cops have chased after and caught ’em\nAnd that the ladder of law has no top and no bottom\nStared at the person who killed for no reason\nWho just happened to be feelin' that way without warnin'\nAnd he spoke through his cloak, most deep and distinguished\nAnd handed out strongly, for penalty and repentance\nWilliam Zanzinger with a six-month sentence\nAh, but you who philosophize disgrace and criticize all fears\nBury the rag deep in your face\nFor now’s the time for your tears", "[Verse 1]\nI didn’t mean to treat you so bad\nYou shouldn’t take it so personal\nI didn’t mean to make you so sad\nYou just happened to be there, that’s all\nWhen I saw you say goodbye to your friend and smile\nI thought that it was well understood\nThat you’d be comin' back in a little while\nI didn’t know that you were sayin’ goodbye for good\n\n[Chorus]\nBut, sooner or later, one of us must know\nThat you just did what you’re supposed to do\nSooner or later, one of us must know\nThat I really did try to get close to you\n\n[Verse 2]\nI couldn’t see what you could show me\nYour scarf had kept your mouth well hid\nI couldn’t see how you could know me\nBut you said you knew me and I believed you did\nWhen you whispered in my ear\nAnd asked me if I was leavin' with you or her\nI didn’t realize just what I did hear\nI didn’t realize how young you were\n\n[Chorus]\nBut, sooner or later, one of us must know\nThat you just did what you’re supposed to do\nSooner or later, one of us must know\nThat I really did try to get close to you\n\n[Verse 3]\nAnd I couldn’t see when it started snowin'\nYour voice was all that I heard\nI couldn’t see where we were goin'\nBut you said ya' knew an’ I took your word\nAnd then ya' told me later, as I apologized\nThat you were just kiddin’ me, you weren’t really from the farm\nAn’ I told you, as ya' clawed out my eyes\nThat I never really meant to do you any harm\n\n[Chorus]\nBut, sooner or later, one of us must know\nThat you just did what you’re supposed to do\nSooner or later, one of us must know\nThat I really did try to get close to you", "[Verse 1]\nMeet me in the morning, 56th and Wabasha\nMeet me in the morning, 56th and Wabasha\nHoney, we could be in Kansas\nBy time the snow begins to thaw\n\n[Verse 2]\nThey say the darkest hour is right before the dawn\nThey say the darkest hour is right before the dawn\nBut you wouldn’t know it by me\nEvery day’s been darkness since you been gone\n\n[Verse 3]\nLittle rooster crowing, there must be something on his mind\nLittle rooster crowing, there must be something on his mind\nWell, I feel just like that rooster\nHoney, ya treat me so unkind\n\n[Verse 4]\nWell, I struggled through barbed wire, felt the hail fall from above\nWell, I struggled through barbed wire, felt the hail fall from above\nWell, you know I even outran the hound dogs\nHoney, you know I’ve earned your love\n\n[Verse 5]\nLook at the sun sinking like a ship\nLook at the sun sinking like a ship\nAin’t that just like my heart, babe\nWhen you kissed my lips?", "[Verse 1]\nSixteen years\nSixteen banners united over the fields\nWhere the good shepherd grieves\nDesperate men, desperate women divided\nSpreading their wings 'neath falling leaves\n\n[Verse 2]\nFortune calls\nI stepped forth from the shadows to the marketplace\nMerchants and thieves, hungry for power, my last deal gone down\nShe's smelling sweet like the meadows where she was born\nOn Midsummer's Eve near the tower\n\n[Verse 3]\nThe cold-blooded moon\nThe captain waits above the celebration\nSending his thoughts to a beloved maid\nWhose ebony face is beyond communication\nThe captain is down but still believing that his love will be repaid\n\n[Verse 4]\nThey shaved her head\nShe was torn between Jupiter and Apollo\nA messenger arrived with a black nightingale\nI seen her on the stairs and I couldn't help but follow\nFollow her down past the fountain where they lifted her veil\n\n[Verse 5]\nI stumbled to my feet\nI rode past destruction in the ditches\nWith the stitches still mending 'neath a heart-shaped tattoo\nRenegade priests and treacherous young witches\nWere handing out the flowers that I'd given to you\n\n[Verse 6]\nThe palace of mirrors\nWhere dog soldiers are reflected\nThe endless road and the wailing of chimes\nThe empty rooms where her memory is protected\nWhere the angels' voices whisper to the souls of previous times\n\n[Verse 7]\nShe wakes him up\nForty-eight hours later the sun is breaking\nNear broken chains, mountain laurel and rolling rocks\nShe's begging to know what measures he now will be taking\nHe's pulling her down and she's clutching onto his long golden locks\n\n[Verse 8]\nGentlemen, he said I don't need your organization, I've shined your shoes\nI've moved your mountains and marked your cards\nBut Eden is burning either get ready for elimination\nOr else your hearts must have the courage for the changing of the guards\n\n[Verse 9]\nPeace will come\nWith tranquillity and splendor on the wheels of fire\nBut will offer no reward when her false idols fall\nAnd cruel death surrenders with its pale ghost retreating\nBetween the King and the Queen of Swords", "Of war and peace the truth just twists\nIt's curfew gull it glides\nUpon four-legged forest clouds\nThe cowboy angel rides\nWith his candle lit into the sun\nThough its glow is waxed in black\nAll except when 'neath the trees of Eden\n\nThe lamppost stands with folded arms\nIt's iron claws attached\nTo curbs 'neath holes where babies wail\nThough it shadows metal badge\nAll and all can only fall\nWith a crashing but meaningless blow\nNo sound ever comes from the Gates of Eden\n\nThe savage soldier sticks his head in sand\nAnd then complains\nUnto the shoeless hunter who's gone deaf\nBut still remains\nUpon the beach where hound dogs bay\nAt ships with tattooed sails\nHeading for the Gates of Eden\n\nWith a time-rusted compass blade\nAladdin and his lamp\nSits with Utopian hermit monks\nSide saddle on the Golden Calf\nAnd on their promises of paradise\nYou will not hear a laugh\nAll except inside the Gates of Eden\n\nRelationships of ownership\nThey whisper in the wings\nTo those condemned to act accordingly\nAnd wait for succeeding kings\nAnd I try to harmonize with songs\nThe lonesome sparrow sings\nThere are no kings inside the Gates of Eden\n\nThe motorcycle black Madonna\nTwo-wheeled gypsy queen\nAnd her silver-studded phantom cause\nThe gray flannel dwarf to scream\nAs he weeps to wicked birds of prey\nWho pick up on his bread crumb sins\nAnd there are no sins inside the Gates of Eden\n\nThe kingdoms of experience\nIn the precious winds they rot\nWhile paupers change possessions\nEach one wishing for what the other has got\nAnd the princess and the prince\nDiscuss what's real and what is not\nIt doesn't matter inside the Gates of Eden\n\nThe foreign sun, it squints upon\nA bed that is never mine\nAs friends and other strangers\nFrom their fates try to resign\nLeaving men wholly totally free\nTo do anything they wish to do but die\nAnd there are no trials inside the Gates of Eden\n\nAt dawn my lover comes to me\nAnd tells me of her dreams\nWith no attempts to shovel the glimpse\nInto the ditch of what each one means\nAt times I think there are no words\nBut these to tell what's true\nAnd there are no truths outside the Gates of Eden", "[Verse 1]\nEvery step of the way we walk the line\nYour days are numbered, so are mine\nTime is piling’ up, we struggle and we scrape\nWe’re all boxed in, nowhere to escape\n\n[Verse 2]\nCity’s just a jungle; more games to play\nTrapped in the heart of it, trying' to get away\nI was raised in the country, I been working’ in the town\nI been in trouble ever since I set my suitcase down\n\n[Verse 3]\nGot nothing' for you, I had nothing' before\nDon’t even have anything for myself anymore\nSky full of fire, pain pouring’ down\nNothing you can sell me, I’ll see you around\n\n[Verse 4]\nAll my powers of expression and thoughts so sublime\nCould never do you justice in reason or rhyme\nOnly one thing I did wrong\nStayed in Mississippi a day too long\n\n[Verse 5]\nWell, the devil’s in the alley, mule’s in the stall\nSay anything you wanna, I have heard it all\nI was thinking’ 'bout the things that Rosie said\nI was dreaming I was sleeping' in Rosie’s bed\n\n[Verse 6]\nWalking through the leaves, falling from the trees\nFeeling like a stranger nobody sees\nSo many things that we never will undo\nI know you’re sorry, I’m sorry too\n\n[Verse 7]\nSome people will offer you their hand and some won’t\nLast night I knew you, tonight I don’t\nI need something strong to distract my mind\nI’m gonna look at you ’til my eyes go blind\n\n[Verse 8]\nWell I got here following' the southern star\nI crossed that river just to be where you are\nOnly one thing I did wrong\nStayed in Mississippi a day too long\n\n[Verse 9]\nWell my ship’s been split to splinters and it’s sinking' fast\nI’m drowning in the poison, got no future, got no past\nBut my heart is not weary, it’s light and it’s free\nI’ve got nothing but affection for all those who’ve sailed with me\n\n[Verse 10]\nEverybody moving if they ain’t already there\nEverybody got to move somewhere\nStick with me baby, stick with me anyhow\nThings should start to get interesting' right about now\n\n[Verse 11]\nMy clothes are wet, tight on my skin\nNot as tight as the corner that I painted myself in\nI know that fortune is waiting’ to be kind\nSo give me your hand and say you’ll be mine\n\n[Verse 12]\nWell, the emptiness is endless, cold as the clay\nYou can always come back, but you can’t come back all the way\nOnly one thing I did wrong\nStayed in Mississippi a day too long", "[Verse 1]\nWhile riding on a train going west\nI fell asleep for to take my rest\nI dreamed a dream that made me sad\nConcerning myself and the first few friends I had\n\n[Verse 2]\nWith half-damp eyes I stared to the room\nWhere my friends and I spent many an afternoon\nWhere we together weathered many a storm\nLaughin and singin till the early hours of the morn\n\n[Verse 3]\nBy the old wooden stove where our hats was hung\nOur words was told, our songs was sung\nWhere we longed for nothing and were satisfied\nJokin and talkin about the world outside\n\n[Verse 4]\nWith hungry hearts through the heat and cold\nWe never much thought we could get very old\nWe thought we could sit forever in fun\nAnd our chances really was a million to one\n\n[Instrument Break]\n\n[Verse 5]\nAs easy it was to tell black from white\nIt was all that easy to tell wrong from right\nAnd our choices, they were few so the thought never hit\nThat the one road we traveled would ever shatter or split\n\n[Verse 6]\nHow many a year has passed and gone\nMany a gamble has been lost and won\nAnd many a road taken by many a first friend\nAnd each one I’ve never seen again\n\n[Instrument Break]\n\n[Verse 7]\nI wish, I wish, I wish in vain\nThat we could sit simply in that room again\nTen thousand dollars at the drop of a hat\nAnd I’d give it all gladly if our lives could be like that", "[Verse 1]\nI got this graveyard woman, you know\nShe keeps my kids\nBut my soulful mama, you know\nShe keeps me hid\nShe’s a junkyard angel, and she\nAlways gives me bread\n\n[Chorus]\nWell, if I go down dyin', you know\nShe bound to put a blanket on my bed\n\n[Verse 2]\nWell, when the pipeline gets broken\nAnd I'm lost on the river bridge\nI’m all cracked up on the highway\nAnd in the water’s edge\nHere again she comes, down the thruway\nReady to sew me up with a thread\n\n[Chorus]\nWell, if I go down dyin', you know\nShe bound to put a blanket on my bed\n\n[Verse 3]\nWell, she don’t make me nervous\nShe don’t talk too much\nShe walks like Bo Diddley\nAnd she don’t need no crutch\nShe keeps this .410\nAll loaded with lead\n\n[Chorus]\nWell, if I go down dyin', you know\nShe bound to put a blanket on my bed\n\n[Bridge]\nCome on!\n\n[Verse 4]\nWell, you know I\nNeed a steam shovel, mama, to\nKeep away the dead\nI need a dump truck, baby, to\nUnload my head\nShe brings me everything and more\nAnd just like I said\n\n[Chorus]\nWell, if I go down dyin', you know\nShe bound to put a blanket on my bed", "[Chorus]\nThere is a house down in New Orleans\nThey call the Rising Sun.\nAnd it's been the ruin of many a-poor girl\nAnd me—oh, God—I'm one\n\n[Verse 1]\nMy mother was a tailor\nShe sewed these new blue jeans\nMy sweetheart was a gambler, Lord\nDown in New Orleans\n\n[Verse 2]\nNow the only thing a gambler needs\nIs a suitcase and a trunk\nAnd the only time he's satisfied\nIs when he's on a drunk\n\n[Verse 3]\nHe fills his glasses up to the brim\nAnd he'll pass the cards around\nAnd the only pleasure he gets out of life\nIs ramblin' from town to town\n\n[Verse 4]\nOh, tell my baby sister\nNot to do what I have done!\nBut shun that house in New Orleans\nThey call the Rising Sun\n\n[Verse 5]\nWell it's one foot on the platform\nThe other foot on the train!\nI'm goin' back to New Orleans\nTo wear that ball and chain\n\n[Verse 6]\nI'm a goin' back to New Orleans\nMy race is almost run!\nI'm goin' back to end my life\nDown in the Rising Sun\n\n[Chorus]\nThere is a house in New Orleans\nThey call the Rising Sun\nIt's been the ruin of many a-poor girl\nAnd me—oh, God—I'm one", "[Verse 1]\n'Twas down in Mississippi no so long ago\nWhen a young boy from Chicago town stepped through a Southern door\nThis boy's dreadful tragedy I can still remember well\nThe color of his skin was black and his name was Emmett Till\n\n[Verse 2]\nSome men they dragged him to a barn and there they beat him up\nThey said they had a reason, but I can't remember what\nThey tortured him and did some things too evil to repeat\nThere was screaming sounds inside the barn, there was laughing sounds out on the street\n\n[Verse 3]\nThen they rolled his body down a gulf amidst a bloody red rain\nAnd they threw him in the waters wide to cease his screaming pain\nThe reason that they killed him there, and I'm sure it ain't no lie\nWas just for the fun of killing' him and to watch him slowly die\n\n[Verse 4]\nAnd then to stop, the United States of yelling for a trial\nTwo brothers they confessed that they had killed poor Emmett Till\nBut on the jury there were men who helped the brothers commit this awful crime\nAnd so this trial was a mockery, but nobody there seemed to mind\n\n[Verse 5]\nI saw the morning papers but I could not bear, to see\nThe smiling brothers walking' down the courthouse stairs\nFor the jury found them innocent and the brothers they went free\nWhile Emmett's body floats the foam of a Jim Crow southern sea\n\n[Verse 6]\nIf you can't speak out against this kind of thing, a crime that's so unjust\nYour eyes are filled with dead men's dirt, your mind is filled with dust\nYour arms and legs they must be in shackles and chains, and your blood it must refuse to flow\nFor you to let this human race fall down so God-awful low!\n\n[Verse 7]\nThis song's just a reminder to remind your fellow man\nThat this kind of thing still lives today in that ghost-robed Ku Klux Klan\nBut if all of us folks that thinks alike, if we gave all we could give\nWe could make this great land of ours a greater place to live", "[Verse 1]\nHollis Brown\nHe lived on the outside of town\nHollis Brown\nHe lived on the outside of town\nWith his wife and five children\nAnd his cabin broken down\n\n[Verse 2]\nHe looked for work and money\nAnd he walked a ragged mile\nHe looked for work and money\nAnd ya' walked a ragged mile\nYour children are so hungry\nThat they don’t know how to smile\n\n[Verse 3]\nYour baby’s eyes look crazy\nThey’re a-tugging at your sleeve\nYour baby’s eyes look crazy\nThey’re a-tugging at your sleeve\nYou walk the floor and wonder why\nWith every breath you breathe\n\n[Verse 4]\nThe rats have got your flour\nBad blood it got your mare\nThe rats have got your flour\nBad blood it got your mare\nIf there’s anyone that knows\nIs there anyone that cares?\n\n[Verse 5]\nHe prayed to the Lord above\nOh please send you a friend\nHe prayed to the Lord above\nOh please send you a friend\nYour empty pockets tell ya'\nThat you ain’t a-got no friend\n\n[Verse 6]\nYour babies are crying louder now\nIt’s a-poundin' on your brain\nYour babies are crying louder now\nIt’s a-poundin' on your brain\nYour wife’s screams are stabbin' ya'\nLike the dirty drivin' rain\n\n[Verse 7]\nYour grass is turnin' black\nThere’s no water in your well\nYour grass is turnin' black\nThere’s no water in your well\nYou spent your last lone dollar\nOn seven shotgun shells\n\n[Verse 8]\nWay out in the wilderness\nA cold coyote calls\nWay out in the wilderness\nA cold coyote calls\nYour eyes fix on the shotgun\nThat’s hanging on the wall\n\n[Verse 9]\nYour brain is a-bleedin'\nAnd your legs can’t seem to stand\nYour brain is a-bleedin'\nAnd your legs can’t seem to stand\nYour eyes fix on the shotgun\nThat you’re holding in your hand\n\n[Verse 10]\nThere’s seven breezes blowin'\nAll around the cabin door\nThere’s seven breezes blowin'\nAll around the cabin door\nSeven shots ring out\nLike the ocean’s poundin' roar\n\n[Verse 11]\nThere’s seven people dead\nOn a South Dakota farm\nThere’s seven people dead\nOn a South Dakota farm\nSomewheres in the distance\nThere’s seven new people born", "[Verse 1]\nOxford Town, Oxford Town\nEverybody’s got their heads bowed down\nThe sun don’t shine above the ground\nI am a-going down to Oxford Town\n\n[Verse 2]\nHe went down to Oxford Town\nGuns and clubs followed him down\nAll because his face was brown\nBetter get away from Oxford Town\n\n[Verse 3]\nOxford Town around the bend\nCome in to the door, he couldn’t get in\nAll because of the color of his skin\nWhat do you think about that, my friend?\n\n[Verse 4]\nMe, my girl, my girl’s son\nWe got met with a tear gas bomb\nI don’t even know why we come\nGoing back where we come from\n\n[Verse 5]\nOxford Town in the afternoon\nEverybody singing a sorrowful tune\nTwo men died beneath the Mississippi moon\nSomebody better investigate soon", "[Verse 1]\nFar between sundown’s finish and midnight’s broken toll\nWe ducked inside the doorways, thunder went crashing\nAs majestic bells of bolts struck shadows in the sounds\nSeemin' to be the chimes of freedom flashing\nFlashing for the warriors whose strength is not to fight\nFlashing for the refugees on the unarmed road of flight\nAnd for each and every underdog soldier in the night\nAnd we gazed upon the chimes of freedom flashing\n\n[Verse 2]\nThrough the city’s melted furnace, unexpectedly we watched\nWith faces hidden as the walls were tightening\nAs the echo of the wedding bells before the blowin’ rain\nDissolved into the bells of the lightning\nTolling for the rebel, tolling for the rake\nTolling for the luckless, they abandoned and forsaked\nTolling for the outcast, burning constantly at stake\nAnd we gazed upon the chimes of freedom flashing\n\n[Verse 3]\nThrough the mad mystic hammering of the wild ripping hail\nThe sky cracked it's poems in naked wonder\nThat the clinging of the church bells blew far into the breeze\nLeavin' only bells of lightning and it's thunder\nStriking for the gentle, striking for the kind\nStriking for the guardians and protectors of the mind\nAnd the poet and the painter far behind his rightful time\nAnd we gazed upon the chimes of freedom flashing\n\n[Verse 4]\nAnd the wild cathedral evening the rain unraveled tales\nFor disrobed faceless forms of no position\nTolling for the tongues with no place to bring their thoughts\nAll down in taken-for-granted situations\nTolling for the deaf and blind, tolling for the mute\nFor the mistreated, mateless mother, the mistitled prostitute\nFor the misdemeanor outlaw, chained and cheated by pursuit\nAnd we gazed upon the chimes of freedom flashing\n\n[Verse 5]\nEven though a cloud’s white curtain in a far-off corner flared\nAnd the hypnotic splattered mist was slowly lifting\nElectric light still struck like arrows, fired but for the ones\nCondemned to drift or else be kept from driftin'\nTolling for the searching ones, on their speechless, seeking trail\nFor the lonesome-hearted lovers with too personal a tale\nAnd for each unharmful, gentle soul misplaced inside a jail\nAnd we gazed upon the chimes of freedom flashing\n\n[Verse 6]\nStarry-eyed and laughing as I recall when we were caught\nTrapped by no track of hours for they hanged suspended\nAs we listened one last time and we watched with one last look\nSpellbound and swallowed ’til the tolling ended\nTolling for the aching whose wounds cannot be nursed\nFor the countless confused, accused, misused, strung-out ones and worse\nAnd for every hung-up person in the whole wide universe\nAnd we gazed upon the chimes of freedom flashin'", "[Verse 1]\nYour breath is sweet\nYour eyes are like two jewels in the sky\nYour back is straight, your hair is smooth\nOn the pillow where you lie\nBut I don't sense affection\nNo gratitude or love\nYour loyalty is not to me\nBut to the stars above\n\n[Chorus]\nOne more cup of coffee for the road\nOne more cup of coffee 'fore I go\nTo the valley below\n\n[Verse 2]\nYour daddy, he's an outlaw\nAnd a wanderer by trade\nHe'll teach you how to pick and choose\nAnd how to throw the blade\nHe oversees his kingdom\nSo no stranger does intrude\nHis voice, it trembles as he calls out\nFor another plate of food\n\n[Chorus]\nOne more cup of coffee for the road\nOne more cup of coffee 'fore I go\nTo the valley below\n\n[Verse 3]\nYour sister sees the future\nLike your mama and yourself\nYou've never learned to read or write\nThere's no books upon your shelf\nAnd your pleasure knows no limits\nYour voice is like a meadowlark\nBut your heart is like an ocean\nMysterious and dark\n\n[Chorus]\nOne more cup of coffee for the road\nOne more cup of coffee 'fore I go\nTo the valley below", "[Verse 1]\nSome of us turn off the lights and we live\nWith the moonlight shooting by\nSome of us scare ourselves to death in the dark\nTo be where the angels fly\nPretty maids all in a row lined up\nOutside my cabin door\nI've never wanted any of them wanting me\nExcept the girl from the Red River Shore\n\n[Verse 2]\nWell, I sat by her side and for a while I tried\nTo make that girl my wife\nShe gave me her best advice and she said\nGo home and lead a quiet life\nWell, I been to the east and I been to the west\nAnd I been out where the black winds roar\nSomehow though I never did get that far\nWith the girl from the Red River Shore\n\n[Verse 3]\nWell, I knew when I first laid eyes on her\nI could never be free\nOne look at her and I knew right away\nShe should always be with me\nWell, the dream dried up a long time ago\nDon't know where it is anymore\nTrue to life, true to me\nWas the girl from the Red River Shore\n\n[Verse 4]\nWell, I'm wearing the cloak of misery\nAnd I've tasted jilted love\nAnd the frozen smile upon my face\nFits me like a glove\nWell, I can't escape from those memories\nOf the one that I'll always adore\nAll those nights, when I lay in the arms\nOf the girl from the Red River Shore\n\n[Verse 5]\nWell, we're living in the shadows of a fading past\nTrapped in the fires of time\nI'd tried not to ever hurt anybody\nAnd to stay out of a life of crime\nAnd when it's all been said and done\nI never did know the score\nOne more day is another day away\nFrom the girl from the Red River Shore\n\n[Verse 6]\nWell, I'm a stranger here in a strange land\nBut I know this is where I belong\nI'll ramble and gamble for the one I love\nAnd the hills will give me a song\nThough nothing looks familiar to me\nI know I've stayed here before\nOnce, a thousand nights ago\nWith the girl from the Red River Shore\n\n[Verse 7]\nWell, I went back to see about her once\nWent back to straighten it out\nEverybody that I talked to had seen us there\nSaid they didn't know who I was talking about\nWell, the sun went down on me a long time ago\nI had to go back from the door\nI wish I could have spent every hour of my life\nWith the girl from the Red River Shore\n\n[Verse 8]\nNow I heard of a guy who lived a long time ago\nA man full of sorrow and strife\nThat if someone around him died and was dead\nHe knew how to bring 'em on back to life\nWell, I don't know what kind of language he used\nOr if they do that kind of thing anymore\nSometimes I think nobody saw me here at all\nExcept the girl from the Red River Shore", "[Verse 1]\nRamona\nCome closer\nShut softly your watery eyes\nThe pangs of your sadness\nWill pass as your senses will rise\nOh the flowers of the city\nThough breath-like\nGet death-like at times\nAnd there’s no use in trying\nTo deal with the dying\nThough I cannot explain that in lines\n\n[Verse 2]\nYour cracked country lips\nI still wish to kiss\nAs to be by the strength of your skin\nYour magnetic movements\nStill capture the minutes I’m in\nBut it grieves my heart, love\nTo see you trying to be a part of\nA world that just don’t exist\nIt’s all just a dream, babe\nA vacuum, a scheme, babe\nThat sucks you into feelin' like this\n\n[Verse 3]\nI can see that your head\nHas been twisted and fed\nWith the worthless foam from the mouth\nI can tell you are torn\nBetween staying and returning\nBack to the South\nYou’ve been fooled into thinking\nThat the finishing end is at hand\nYet there’s no one to beat you\nNo one to defeat you\n'cept the thoughts of yourself feeling bad\n\n[Verse 4]\nI’ve heard you say many times\nThat you’re better than no one\nAnd no one is better than you\nIf you really believe that\nYou know you have nothing to win and nothing to lose\nFrom fixtures and forces and friends\nYour sorrow does stem\nThat hype you and type you\nMaking you feel\nThat you gotta' be just like them\n\n[Verse 5]\nI’d forever talk to you\nBut soon my words\nWould turn into a meaningless ring\nFor deep in my heart\nI know there's no help I can bring\nEverything passes\nEverything changes\nJust do what you think you should do\nAnd someday maybe\nWho knows, baby\nI’ll come and be crying to you", "[Verse 1]\nCorrina, Corrina\nGirl, where you been so long?\nCorrina, Corrina\nGirl, where you been so long?\nI been worrying about you, baby\nBaby, please come home\n\n[Verse 2]\nI got a bird that whistles\nI got a bird that sings\nI got a bird that whistles\nI got a bird that sings\nBut I ain't got Corrina\nLife don’t mean a thing\n\n[Verse 3]\nCorrina, Corrina\nGirl, you’re on my mind\nCorrina, Corrina\nGirl, you’re on my mind\nI’m a-sittin down thinkin of you\nI just can’t keep from crying", "[Verse 1]\nI’m out here a thousand miles from my home\nWalking a road other men have gone down\nI’m seeing your world of people and things\nYour paupers and peasants and princes and kings\n\n[Verse 2]\nHey, hey, Woody Guthrie, I wrote you a song\nAbout a funny old world that’s a-coming along\nSeems sick and it’s hungry, it’s tired and it’s torn\nIt looks like it’s a-dying and it’s hardly been born\n\n[Verse 3]\nHey, Woody Guthrie, but I know that you know\nAll the things that I’m a-saying an a-many times more\nI’m a-singing you the song, but I can’t sing enough\nBecause there’s not many men that done the things that you’ve done\n\n[Verse 4]\nHere’s to Cisco and Sonny and Leadbelly too\nAnd to all the good people that traveled with you\nHere’s to the hearts and the hands of the men\nThat come with the dust and are gone with the wind\n\n[Verse 5]\nI’m a-leaving tomorrow, but I could leave today\nSomewhere down the road someday\nThe very last thing that I’d want to do\nIs to say I’ve been hitting some hard traveling too", "[Verse 1]\nAin't it hard to stumble\nAnd land in some funny lagoon?\nAin't it hard to stumble\nAnd land in some muddy lagoon?\nEspecially when it's nine below zero\nAnd three o'clock in the afternoon\n\n[Verse 2]\nAin't gonna hang no picture\nAin't gonna hang no picture frame\nAin't gonna hang no picture\nOr hang no picture frame\nWell, I might look like Robert Ford\nBut I feel just like a'Jesse James\n\n[Verse 3]\nAnd I wish I was\nOn some Australian mountain range\nOh, I wish I was\nOn some Australian mountain range\nI got no reason to be there, but I\nImagine it would be some kinda change\n\n[Verse 4]\nI got my dark sunglasses\nI got for good luck my black tooth\nI got my dark sunglasses\nI'm carrying my good luck, my black tooth\nDon't ask me nothin' about nothin'\nI just might tell you the truth\n\n[Verse 5]\nI got a woman in Jackson\nOh, I ain't gonna say her name\nI got a woman in Jackson\nI ain't gonna say her name\nShe's a brown-skin woman\nBut I love her just the same", "[Verse 1]\nWell, your railroad gate, you know I just can’t jump it\nSometimes it gets so hard, you see\nI just sitting here beating on my trumpet\nWith all these promises you left for me\nBut where are you tonight, sweet Marie?\n\n[Verse 2]\nWell, I waited for you when I was half sick\nYes, I waited for you when you hated me\nWell, I waited for you inside of the frozen traffic\nYeah, when you knew I had some other place to be\nNow, where are you tonight, sweet Marie?\n\n[Bridge 1]\nWell, anybody can be just like me, obviously\nBut then, now again, not too many can be like you, fortunately\n\n[Verse 3]\nWell, six white horses that you did promise\nWere finally delivered down to the penitentiary\nBut to live outside the law, you must be honest\nI know you always say that you agree\nAlright so where are you tonight, sweet Marie?\n\n[Bridge 2]\nWell, I don’t know how it happened\nBut the riverboat captain, he knows my fate\nBut everybody else, even yourself\nThey’re just gonna have to wait\n\n[Verse 4]\nWell, I got the fever down in my pockets\nThe Persian drunkard, he follows me\nYes, I can take him to your house but I can’t unlock it\nYou see, you forgot to leave me with the key\nOh, where are you tonight, sweet Marie?\n\n[Verse 5]\nWell, I been in jail when all the mail showed\nThat a man can’t give his address out to bad company\nAnd now I stand here lookin’ at your yellow railroad\nIn the ruins of your balcony\nWondering where you are tonight, sweet Marie", "[Verse 1]\nIf today was not a crooked highway\nIf tonight was not a crooked trail\nIf tomorrow wasn’t such a long time\nThen lonesome would mean nothing to you at all\nYes, and only if my own true love was waiting\nAnd if I could hear her heart a-softly pounding\nYes, and only if she was lying by me\nThen I’d lie in my bed once again....\n\n[Verse 2]\nI can’t see my reflection in the waters\nI can’t speak the sounds that show no pain\nI can’t hear the echo of my footsteps\nOr can’t remember the sound of my own name\nYes, and only if my own true love was waiting\nAnd if I could hear her heart a-softly pounding\nYes, and only if she was lying by me\nThen I’d lie in my bed once again...\n\n[Verse 3]\nThere’s beauty in that silver, singing river\nThere’s beauty in the sunrise in the sky\nBut none of these and nothing else can touch the beauty\nThat I remember in my true love’s eyes\nYes, and only if my own true love was waiting\nAnd if I could hear her heart a-softly pounding\nYes, and only if she was lying by me\nThen I’d lie in my bed once again...", "[Verse 1]\nI’m walking through streets that are dead\nWalking, walking with you in my head\nMy feet are so tired, my brain is so wired\nAnd the clouds are weeping\n\n[Verse 2]\nDid I hear someone tell a lie?\nDid I hear someone’s distant cry?\nI spoke like a child; you destroyed me with a smile\nWhile I was sleeping\n\nI’m sick of love but I’m in the thick of it\nThis kind of love I’m so sick of it\n\n[Verse 3]\nI see, I see lovers in the meadow\nI see, I see silhouettes in the window\nI watch them ’till they’re gone and they leave me hanging on\nTo a shadow\n\nI’m sick of love; I hear the clock tick\nThis kind of love; I’m lovesick\n\n[Verse 4]\nSometimes the silence can be like the thunder\nSometimes I want to take to the road and plunder\nCould you ever be true? I think of you\nAnd I wonder\n\nI’m sick of love; I wish I’d never met you\nI’m sick of love; I’m trying to forget you\n\n[Outro]\nJust don’t know what to do\nI’d give anything to be with you"]}