{"Johnny Cash": ["[Verse 1]\nThe other night dear, as I lay sleeping\nI dreamed I held you in my arms\nWhen I awoke, dear, I was mistaken\nSo I bowed my head and I cried\n\n[Chorus]\nYou are my sunshine, my only sunshine\nYou make me happy when skies are gray\nYou'll never know, dear, how much I love you\nPlease don't take my sunshine away\n\n[Verse 2]\nI've always loved you and made you happy\nAnd nothing else could come between\nBut now you've left me to love another\nYou have shattered all of my dreams\n\n[Chorus]\nYou are my sunshine, my only sunshine\nYou make me happy when skies are gray\nYou'll never know, dear, how much I love you\nPlease don't take my sunshine away", "[Produced by Rick Rubin]\n\n[Verse 1]\nI hurt myself today\nTo see if I still feel\nI focus on the pain\nThe only thing that's real\nThe needle tears a hole\nThe old familiar sting\nTry to kill it all away\nBut I remember everything\n\n[Chorus]\nWhat have I become\nMy sweetest friend?\nEveryone I know\nGoes away in the end\nAnd you could have it all\nMy empire of dirt\nI will let you down\nI will make you hurt\n\n[Verse 2]\nI wear this crown of thorns\nUpon my liar's chair\nFull of broken thoughts\nI cannot repair\nBeneath the stains of time\nThe feelings disappear\nYou are someone else\nI am still right here\n\n[Chorus]\nWhat have I become\nMy sweetest friend?\nEveryone I know\nGoes away in the end\nAnd you could have it all\nMy empire of dirt\nI will let you down\nI will make you hurt\n\n[Outro]\nIf I could start again\nA million miles away\nI would keep myself\nI would find a way", "[Verse 1]\nLove is a burning thing\nAnd it makes a fiery ring\nBound by wild desire\nI fell in to a ring of fire\n\n[Chorus]\nI fell into a burning ring of fire\nI went down, down, down\nAnd the flames went higher\nAnd it burns, burns, burns\nThe ring of fire\nThe ring of fire\nI fell into a burning ring of fire\nI went down, down, down\nAnd the flames went higher\nAnd it burns, burns, burns\nThe ring of fire\nThe ring of fire\n\n[Verse 2]\nThe taste of love is sweet\nWhen hearts like ours meet\nI fell for you like a child\nOh, but the fire went wild\n\n[Chorus]\nI fell in to a burning ring of fire\nI went down, down, down\nAnd the flames went higher\nAnd it burns, burns, burns\nThe ring of fire\nThe ring of fire\nI fell into a burning ring of fire\nI went down, down, down\nAnd the flames went higher\nAnd it burns, burns, burns\nThe ring of fire\nThe ring of fire\n\n[Outro]\nAnd it burns, burns, burns\nThe ring of fire\nThe ring of fire\nThe ring of fire\nThe ring of fire\nThe ring of fire\nThe ring...", "[Verse 1]\nI keep a close watch on this heart of mine\nI keep my eyes wide open all the time\nI keep the ends out for the tie that binds\nBecause you're mine, I walk the line\n\n[Verse 2]\nI find it very, very easy to be true\nI find myself alone when each day is through\nYes, I'll admit that I'm a fool for you\nBecause you're mine, I walk the line\n\n[Verse 3]\nAs sure as night is dark and day is light\nI keep you on my mind both day and night\nAnd happiness I've known proves that it's right\nBecause you're mine, I walk the line\n\n[Verse 4]\nYou've got a way to keep me on your side\nYou give me cause for love that I can't hide\nFor you, I know I'd even try to turn the tide\nBecause you're mine, I walk the line\n\n[Verse 1]\nI keep a close watch on this heart of mine\nI keep my eyes wide open all the time\nI keep the ends out for the tie that binds\nBecause you're mine, I walk the line", "[Verse 1]\nI hear the train a comin', it's rolling 'round the bend\nAnd I ain't seen the sunshine since I don't know when\nI'm stuck in Folsom prison, and time keeps draggin' on\nBut that train keeps a rollin' on down to San Antone\n\n[Verse 2]\nWhen I was just a baby my mama told me, \"Son\nAlways be a good boy, don't ever play with guns\"\nBut I shot a man in Reno just to watch him die\nWhen I hear that whistle blowing, I hang my head and cry\n\n[Verse 3]\nI bet there's rich folks eating in a fancy dining car\nThey're probably drinkin' coffee and smoking big cigars\nWell I know I had it coming, I know I can't be free\nBut those people keep a-movin'\nAnd that's what tortures me\n\n[Verse 4]\nWell if they freed me from this prison\nIf that railroad train was mine\nI bet I'd move it on a little farther down the line\nFar from Folsom prison, that's where I want to stay\nAnd I'd let that lonesome whistle blow my blues away", "[ Johnny Cash & June Carter)\nWe got married in a fever, hotter than a pepper sprout\nWe've been talkin' 'bout Jackson, ever since the fire went out\n\n[ Johnny Cash ]\nI'm going to Jackson, I'm gonna mess around\nYeah, I'm goin' to Jackson\nLook out Jackson town\n\n[  June Carter ]\nWell, go on down to Jackson; go ahead and wreck your health\nGo play your hand you big-talkin' man, make a big fool of yourself\nYeah, go to Jackson; go comb your hair!\n\n[Johnny Cash ]\nHoney, I'm gonna snowball Jackson\n\n[  June Carter ]\nSee if I care\n\n[ Johnny Cash ]\nWhen I breeze into that city, people gonna stoop and bow\n\n[  June Carter ]\nHah!!\n\n[ Johnny Cash ]\nAll them women gonna make me, teach 'em what they don't know how\nI'm goin' to Jackson, you turn-a loose-a my coat\n'Cos I'm goin' to Jackson\n\n[  June Carter ]\n\"Goodbye,\" that's all she wrote\n\n[  June Carter ]\nBut they'll laugh at you in Jackson, and I'll be dancin' on a Pony Keg\nThey'll lead you 'round town like a scolded hound\nWith your tail tucked between your legs\nYeah, go to Jackson, you big-talkin' man\nAnd I'll be waitin' in Jackson, behind my Japan Fan\n\n[ Johnny Cash &  June Carter ]\nWell now, We got married in a fever, hotter than a pepper Sprout\nWe've been talkin' 'bout Jackson, ever since the fire went out\nI'm goin' to Jackson, and that's a fact\nYeah, we're goin' to Jackson, ain't never comin' back\n\n[ June Carter]\nMmmmmmmmmmmmmm mhmmmmmmm mmmmmmmmmmmm\n\n[ Johnny Cash ]\nWell, we got married in a fever, hotter than a pepper sprout'\nAnd we've been talkin' 'bout Jackson, ever since the fire went...", "Early one morning while making the rounds\nI took a shot of cocaine and I shot my woman down\nI went right home and I went to bed\nI stuck that loving 44 beneath my head\n\nGot up next morning and I grabbed that gun\nTook a shot of cocaine and away I run\nMade a good run but I run too slow\nThey overtook me down in Juarez, Mexico\n\nLate in the hot joints taking the pills\nIn walked the sheriff from Jericho Hill\nHe said, \"Willy Lee, your name is not Jack Brown\nYou're the dirty hack that shot your woman down\"\n\n\"Yes, oh yes, my name is Willy Lee\nIf you've got the warrant just a-read it to me\nShot her down because she made me slow\nI thought I was her daddy but she had five more.\"\n\nWhen I was arrested I was dressed in black,\nThey put me on a train and they took me back\nHad no friend for to go my bail\nThey slapped my dried up carcass in that county jail\n\nEarly next morning about a half past nine\nI spied the sheriff coming down the line\nTalked and he coughed as he cleared his throat\nHe said, \"Come on you dirty hack into that district court\"\n\nInto the courtroom, my trial began\nWhere I was handled by twelve honest men\nJust before the jury started out\nI saw that little judge commence to look about\n\nIn about five minutes, in walked the man\nHolding the verdict in his right hand\nThe verdict read, in the first degree\nI hollered, \"Lawdy, Lawdy, have mercy on me\"\n\nThe judge he smiled as he picked up his pin\nNinety-nine years in the Folsom Pen\nNinety-nine years underneath that ground\nI can't forget the day I shot that bad bitch down\n\nCome on, you've got to listen unto me\nLay off that whisky, and let that cocaine be", "[Intro]\nAnd I heard, as it were, the noise of thunder. One of the four beasts saying, \"Come and see.\" And I saw, and behold a white horse\n\n[Verse 1]\nThere's a man going 'round taking names\nAnd he decides who to free and who to blame\nEverybody won't be treated all the same\nThere'll be a golden ladder reaching down\nWhen the man comes around\n\nThe hairs on your arm will stand up\nAt the terror in each sip and in each sup\nWill you partake of that last offered cup\nOr disappear into the potter's ground\nWhen the man comes around\n\n[Chorus]\nHear the trumpets, hear the pipers\nOne hundred million angels singing\nMultitudes are marching to the big kettledrum\nVoices calling, voices crying\nSome are born and some are dying\nIt's Alpha and Omega's kingdom come\nAnd the whirlwind is in the thorn tree\nThe virgins are all trimming their wicks\nThe whirlwind is in the thorn tree\nIt's hard for thee to kick against the pricks\n\n[Verse 2]\nTill Armageddon no salaam, no shalom\nThen the father hen will call his chickens home\nThe wise men will bow down before the throne\nAnd at his feet they'll cast their golden crowns\nWhen the man comes around\nWhoever is unjust, let him be unjust still\nWhoever is righteous, let him be righteous still\nWhoever is filthy, let him be filthy still\nListen to the words long written down\nWhen the man comes around\n\n[Chorus]\nHear the trumpets, hear the pipers\nOne hundred million angels singing\nMultitudes are marching to the big kettledrum\nVoices calling, voices crying\nSome are born and some are dying\nIt's Alpha and Omega's kingdom come\nAnd the whirlwind is in the thorn tree\nThe virgins are all trimming their wicks\nThe whirlwind is in the thorn tree\nIt's hard for thee to kick against the pricks\nIn measured hundredweight and penny pound\nWhen the man comes around\n\n[Outro]\nAnd I heard a voice in the midst of the four beasts. And I looked, and behold, a pale horse, and his name that sat on him was Death, and Hell followed with him", "[Chorus 1]\nYou can run on for a long time\nRun on for a long time\nRun on for a long time\nSooner or later, God'll cut you down\nSooner or later, God'll cut you down\n\n[Chorus 2]\nGo tell that long tongue liar\nGo and tell that midnight rider\nTell the rambler, the gambler, the back biter\nTell them that God's gonna cut 'em down\nTell them that God's gonna cut 'em down\n\n[Verse 1]\nWell my goodness gracious, let me tell you the news\nMy head's been wet with the midnight dew\nI've been down on bended knee, talkin' to the man from Galilee\nHe spoke to me in the voice so sweet\nI thought I heard the shuffle of the angel's feet\nHe called my name and my heart stood still\nWhen he said, \"John, go do My will!\"\n\n[Chorus 2]\nGo tell that long tongue liar\nGo and tell that midnight rider\nTell the rambler, the gambler, the back biter\nTell them that God's gonna cut 'em down\nTell them that God's gonna cut 'em down\n\n[Chorus 1]\nYou can run on for a long time\nRun on for a long time\nRun on for a long time\nSooner or later, God'll cut you down\nSooner or later, God'll cut you down\n\n[Verse 2]\nWell, you may throw your rock and hide your hand\nWorkin' in the dark against your fellow man\nBut as sure as God made black and white\nWhat's done in the dark will be brought to the light\n\n[Chorus 1]\nYou can run on for a long time\nRun on for a long time\nRun on for a long time\nSooner or later, God'll cut you down\nSooner or later, God'll cut you down\n\n[Chorus 2]\nGo tell that long tongue liar\nGo and tell that midnight rider\nTell the rambler, the gambler, the back biter\nTell them that God's gonna cut 'em down\nTell them that God's gonna cut 'em down", "[Verse 1]\nMy daddy left home when I was three\nAnd he didn't leave much to ma and me\nJust this old guitar and an empty bottle of booze\nNow, I don't blame him cause he run and hid\nBut the meanest thing that he ever did\nWas before he left, he went and named me \"Sue.\"\n\n[Verse 2]\nWell, he must o' thought that is quite a joke\nAnd it got a lot of laughs from a' lots of folk\nIt seems I had to fight my whole life through.\nSome gal would giggle and I'd get red\nAnd some guy'd laugh and I'd bust his head\nI tell ya, life ain't easy for a boy named \"Sue.\"\n\n[Verse 3]\nWell, I grew up quick and I grew up mean\nMy fist got hard and my wits got keen\nI'd roam from town to town to hide my shame\nBut I made a vow to the moon and stars\nThat I'd search the honky-tonks and bars\nAnd kill that man who gave me that awful name\n\n[Verse 4]\nWell, it was Gatlinburg in mid-July\nAnd I just hit town and my throat was dry\nI thought I'd stop and have myself a brew\nAt an old saloon on a street of mud\nThere at a table, dealing stud\nSat the dirty, mangy dog that named me \"Sue.\"\n\n[Verse 5]\nWell, I knew that snake was my own sweet dad\nFrom a worn-out picture that my mother'd had\nAnd I knew that scar on his cheek and his evil eye\nHe was big and bent and gray and old\nAnd I looked at him and my blood ran cold\nAnd I said: \"My name is 'Sue!' How do you do!\nNow you're going to die!!\"\n\n[Verse 6]\nWell, I hit him hard right between the eyes\nAnd he went down, but to my surprise\nHe come up with a knife and cut off a piece of my ear\nBut I busted a chair right across his teeth\nAnd we crashed through the wall and into the street\nKicking and a' gouging in the mud and the blood and the beer\n\n[Verse 7]\nI tell you, I've fought tougher men\nBut I really can't remember when\nHe kicked like a mule and he bit like a crocodile\nI heard him laugh and then I heard him cuss\nHe went for his gun and I pulled mine first\nHe stood there lookin' at me and I saw him smile\n\n[Verse 8]\nAnd he said: \"Son, this world is rough\nAnd if a man's gonna make it, he's gotta be tough\nAnd I knew I wouldn't be there to help ya along\nSo I give ya that name and I said goodbye\nI knew you'd have to get tough or die\nAnd it's the name that helped to make you strong\n\n[Verse 9]\nHe said: \"Now you just fought one hell of a fight\nAnd I know you hate me, and you got the right\nTo kill me now, and I wouldn't blame you if you do\nBut ya ought to thank me, before I die\nFor the gravel in ya guts and the spit in ya eye\nBecause I'm the son-of-a-bitch that named you Sue\n\n[Verse 10]\nI got all choked up and I threw down my gun\nAnd I called him my pa, and he called me his son\nAnd I came away with a different point of view\nAnd I think about him, now and then\nEvery time I try and every time I win\nAnd if I ever have a son, I think I'm gonna name him\nBill or George! Anything but Sue! I still hate that name!", "Well, you wonder why I always dress in black\nWhy you never see bright colors on my back\nAnd why does my appearance seem to have a somber tone\nWell, there's a reason for the things that I have on\n\nI wear the black for the poor and the beaten down\nLiving in the hopeless, hungry side of town\nI wear it for the prisoner who has long paid for his crime\nBut is there because he's a victim of the times\n\nI wear the black for those who've never read\nOr listened to the words that Jesus said\nAbout the road to happiness through love and charity\nWhy, you'd think He's talking straight to you and me\n\nWell, we're doing mighty fine, I do suppose\nIn our streak of lightning cars and fancy clothes\nBut just so we're reminded of the ones who are held back\nUp front there ought to be a man in black\n\nI wear it for the sick and lonely old\nFor the reckless ones whose bad trip left them cold\nI wear the black in mourning for the lives that could have been\n\nEach week we lose a hundred fine young men\nAnd, I wear it for the thousands who have died\nBelieving that the Lord was on their side\nI wear it for another hundred thousand who have died\nBelieving that we all were on their side\n\nWell, there's things that never will be right I know\nAnd things need changing everywhere you go\nBut 'til we start to make a move to make a few things right\nYou'll never see me wear a suit of white\n\nAh, I'd love to wear a rainbow every day\nAnd tell the world that everything's okay\nBut I'll try to carry off a little darkness on my back\nUntil things are brighter, I'm the Man In Black", "[Intro]\nI was totin' my pack along the dusty Winnemucca road\nWhen along came a semi with a high an' canvas covered load\n\"If you're goin' to Winnemucca, Mack, with me you can ride\"\nAnd so I climbed into the cab and then I settled down inside\nHe asked me if I'd seen a road with so much dust and sand\nAnd I said, \"Listen, I've traveled every road in this here land\"\n\n[Chorus]\nI've been everywhere, man\nI've been everywhere, man\nCrossed the desert's bare, man\nI've breathed the mountain air, man\nOf travel I've a'had my share, man\nI've been everywhere\n\n[Verse 1]\nI've been to Reno, Chicago, Fargo, Minnesota\nBuffalo, Toronto, Winslow, Sarasota\nWichita, Tulsa, Ottawa, Oklahoma\nTampa, Panama, Mattawa, La Paloma\nBangor, Baltimore, Salvador, Amarillo\nTocopilla, Barranquilla, and Padilla, I'm a killer\n\n[Chorus]\nI've been everywhere, man\nI've been everywhere, man\nCrossed the desert's bare, man\nI've breathed the mountain air, man\nOf travel I've a'had my share, man\nI've been everywhere\n\n[Verse 2]\nI've been to Boston, Charleston, Dayton, Louisiana\nWashington, Houston, Kingston, Texarkana\nMonterey, Faraday, Santa Fe, Tallapoosa\nGlen Rock, Black Rock, Little Rock, Oskaloosa\nTennessee to Hennessey, Chicopee, Spirit Lake\nGrand Lake, Devil's Lake, Crater Lake, for Pete's sake\n\n[Chorus]\nI've been everywhere, man\nI've been everywhere, man\nCrossed the desert's bare, man\nI've breathed the mountain air, man\nOf travel I've a'had my share, man\nI've been everywhere\n\n[Verse 3]\nI've been to Louisville, Nashville, Knoxville, Ombabika\nSchefferville, Jacksonville, Waterville, Costa Rica\nPittsfield, Springfield, Bakersfield, Shreveport\nHackensack, Cadillac, Fond du Lac, Davenport\nIdaho, Jellico, Argentina, Diamantina\nPasadena, Catalina, see what I mean'a\n\n[Chorus]\nI've been everywhere, man\nI've been everywhere, man\nCrossed the desert's bare, man\nI've breathed the mountain air, man\nOf travel I've a'had my share, man\nI've been everywhere\n\n[Verse 4]\nI've been to Pittsburgh, Parkersburg, Gravelbourg, Colorado\nEllensburg, Rexburg, Vicksburg, El Dorado\nLarimore, Admore, Haverstraw, Chatanika\nChaska, Nebraska, Alaska, Opelaka\nBaraboo, Waterloo, Kalamazoo, Kansas City\nSioux City, Cedar City, Dodge City, what a pity\n\n[Chorus]\nI've been everywhere, man\nI've been everywhere, man\nCrossed the desert's bare, man\nI've breathed the mountain air, man\nOf travel I've a'had my share, man\nI've been everywhere\n\n[Outro]\nI've been everywhere", "[Verse 1]\nIs it getting better\nOr do you feel the same?\nWill it make it easier on you, now\nYou got someone to blame?\n\n[Chorus]\nYou say one love, one life\nWhen it's one need in the night\nOne love, we get to share it\nIt leaves you, baby, if you don't care for it\n\n[Verse 2]\nDid I disappoint you\nOr leave a bad taste in your mouth?\nYou act like you never had love\nAnd you want me to go without\n\n[Chorus]\nWell, it's too late tonight\nTo drag the past out into the light\nWe're one, but we're not the same\nWe get to carry each other, carry each other\nOne\n\n[Verse 3]\nHave you come here for forgiveness?\nHave you come to raise the dead?\nHave you come here to play Jesus\nTo the lepers in your head?\n\n[Chorus]\nDid I ask too much? More than a lot\nYou gave me nothing, now it's all I got\nWe're one, but we're not the same\nWell, we hurt each other, and we're doing it again\n\n[Bridge]\nYou say love is a temple, love a higher law\nLove is a temple, love the higher law\nYou ask me to enter, but then you make me crawl\nAnd I can't be holding on to what you've got\nWhen all you've got is hurt\n\n[Final Chorus]\nOne love, one blood\nOne life, you've got to do what you should\nOne life with each other\nSisters, brothers\nOne life, but we're not the same\nWe get to carry each other, carry each other\nOne\nOne", "[Verse 1]\nWell I won't back down, no I won't back down\nYou can stand me up at the gates of hell\nBut I won't back down\nGoing to stand my ground, won't be turned around\nAnd I'll keep this world from dragging me down\nGoing to stand my ground and I won't back down\n\n[Chorus]\nHey baby, there is no easy way out\nHey I will stand my ground and I won't back down\n\n[Verse 2]\nWell I know what's right, I got just one life\nIn a world that keeps on pushing me around\nBut I stand my ground and I won't back down\n\n[Chorus]", "[Produced by Rick Rubin]\n\n[Chorus]\nThere ain't no grave\nCan hold my body down\nThere ain't no grave\nCan hold my body down\n\n[Verse 1]\nWhen I hear that trumpet sound\nI'm going to rise right out of the ground\nAin't no grave\nCan hold my body down\nWell, look way down the river\nAnd what do you think I see\nI see a band of angels\nAnd they're coming after me\n\n[Chorus]\nAin't no grave\nCan hold my body down\nThere ain't no grave\nCan hold my body down\n\n[Verse 2]\nWell, look down yonder, Gabriel\nPut your feet on the land and sea\nBut Gabriel, don't you blow your trumpet\nUntil you hear from me\n\n[Chorus]\nThere ain't no grave\nCan hold my body down\nAin't no grave\nCan hold my body down\n\n[Verse 3]\nWell meet me, Jesus, meet me\nMeet me in the middle of the air\nAnd if these wings don't fail me\nI will meet you anywhere\n\n[Chorus]\nAin't no grave\nCan hold my body down\nThere ain't no grave\nCan hold my body down\n\n[Verse 4]\nWell meet me, Mother and Father\nMeet me down the river road\nAnd Mama, you know that I'll be there\nWhen I check in my load\n\n[Chorus]\nAin't no grave\nCan hold my body down\nThere ain't no grave\nCan hold my body down\nThere ain't no grave\nCan hold my body down", "I want to live\nI want to give\nI've been a miner\nFor a heart of gold\nIt's these expressions\nI never give\nThat keeps me searching\nFor a heart of gold\nAnd I'm getting old\nKeeps me searching\nFor a heart of gold\nAnd I'm getting old\n\nI've been to Hollywood\nI've been to Redwood\nI crossed the ocean\nFor a heart of gold\nI've been in my mind\nIt's such a fine line\nThat keeps me searching\nFor a heart of gold\nAnd I'm getting old\nKeeps me searching\nFor a heart of gold\nAnd I'm getting old\n\nKeep me searching\nFor a heart of gold\nYou keep me searching\nFor a heart of gold\nAnd I'm getting old\nI've been a miner\nFor a heart of gold", "[Johnny:]\nIf I were a carpenter\nAnd you were a lady\nWould you marry me anyway?\nWould you have my baby?\n\n[June:]\nIf you were a carpenter\nAnd I were a lady\nI'd marry you anyway\nI'd have your baby\n\n[Johnny:]\nIf a tinker was my trade\nWould I still find you\n\n[June:]\nI'd be carrying the pots you made\nFollowing behind you\n\n[Hook: Both]\nSave your  love through loneliness\nSave your love through sorrow\nI gave you my onliness\nGive me your tomorrow\n\n[Johnny:]\nIf I were a miller\nAt a mill wheel grinding\nWould you miss your color blouse\nAnd your soft shoe shining?\n\n[June:]\nIf you were a miller\nAt a mill wheel grinding\nI'd miss my color blouse\nAnd my soft shoe shining\n\n[Hook: Both]\nSave your  love through loneliness\nSave your love through sorrow\nI gave you my onliness\nGive me your tomorrow\n\n[Johnny:]\nIf I worked my hands in wood\nWould you still love me?\n\n[June:]\nI'd answered you, \"Yes I would\"\nAnd would you not be above me\n\n[Johnny:]\nIf I were a carpenter\nAnd you were a lady\n\n[June:]\nI'd marry you anyway\nI'd have your baby\n\n[Hook: Both]\nSave your  love through loneliness\nSave your love through sorrow\nI gave you my onliness\nGive me your tomorrow", "[Verse 1]\nEverybody knows where you go when the sun goes down\nI think you only live to see the lights of town\nI wasted my time when I would try, try, try\nCause when the lights have lost their glow, you'll cry, cry, cry\n\n[Verse 2]\nSoon your sugar-daddies will all be gone\nYou'll wake up some cold day and find you're alone\nYou'll call for me but I'm gonna tell you: \"Bye, bye, bye!\"\nWhen I turn around and walk away, you'll cry, cry, cry\n\n[Chorus]\nYou're gonna cry, cry, cry and you'll cry alone\nWhen everyone's forgotten and you're left on your own\nYou're gonna cry, cry, cry\n\n[Verse 3]\nI lie awake at night to wait 'til you come in\nYou stay a little while and then you're gone again\nEvery question that I ask, I get a lie, lie, lie\nFor every lie you tell, you're gonna cry, cry, cry\n\n[Verse 4]\nWhen your fickle love gets old, no one will care for you\nThen you'll come back to me for a little love that's true\nI'll tell you no and then you'll ask me: \"Why, why, why?\"\nWhen I remind you of all of this, you'll cry, cry, cry\n\n[Outro]\nYou're gonna cry, cry, cry and you'll want me then\nIt'll hurt when you think of the fool you've been\nYou're gonna cry, cry, cry", "[Verse]\nAt my door the leaves are falling\nA cold wild wind will come\nSweethearts walk by together\nAnd I still miss someone\nI go out on a party\nAnd look for a little fun\nBut I find a darkened corner\nBecause I still miss someone\n\nOh, no I never got over those blues eyes\nI see them every where\nI miss those arms that held me\nWhen all the love was there\nI wonder if she's sorry\nFor leaving what we'd begun\nThere's someone for me somewhere\nAnd I still miss someone\n\nI still miss someone\n\nOh, no I never got over those blues eyes\nI see them every where\nI miss those arms that held me\nWhen all the love was there\nI wonder if she's sorry\nFor leaving what we'd begun\nThere's someone for me somewhere\nAnd I still miss someone\nI still miss someone", "[Verse 1]\nTen years ago on a cold dark night\nSomeone was killed 'neath the town hall light\nThere were few at the scene, but they all agreed\nThat the slayer who ran looked a lot like me\n\n[Chorus]\nShe walks these hills in a long black veil\nShe visits my grave when the night winds wail\nNobody knows, nobody sees\nNobody knows but me\n\n[Verse 2]\nThe Judge said, \"Son, what is your alibi?\nIf you were somewhere else, you won't have to die\"\nI spoke not a word, though it meant my life\nI'd been in the arms of my best friend's wife\n\nNow the scaffold seemed high, and eternity was near\nShe stood in the crowd, but she shed not a tear\nBut some times at night when the cold wind calls\nShe comes to my grave and she moans o'er my bones\n\n[Chorus]\nShe walks these hills in a long black veil\nShe visits my grave when the night winds wail\nNobody knows, nobody sees\nNobody knows but me\n\n[Outro]\nNobody knows, nobody sees\nNobody knows but me", "[Verse 1: Johnny Cash]\nEarly one morning\nWith time to kill\nI borrowed Jebb's rifle\nAnd sat on the hill\nI saw a lone rider\nCrossing the plain\nI drew a bead on him\nTo practice my aim\nMy brother's rifle\nWent off in my hand\nA shot rang out\nAcross the land\nThe horse, he kept running\nThe rider was dead\n\n[Chorus: Johnny Cash]\nI hung my head\nI hung my head\n\n[Verse 2: Johnny Cash]\nI set off running\nTo wake from the dream\nMy brother's rifle\nWent into the sheen\nI kept on running\nInto the south lands\nThat's where they found me\nMy head and my hands\nThe sheriff, he asked me\n\"Why had I run?\"\nAnd then it came to me\nJust what I had done\nAnd all for no reason\nJust one piece of lead\n\n[Chorus: Johnny Cash]\nI hung my head\nI hung my head\n\n[Verse 3: Johnny Cash]\nHere in the courthouse\nThe whole town was there\nI see the judge\nHigh up in his chair\n\"Explain to the courtroom\nWhat went through your mind\nAnd we'll ask the jury\nWhat verdict they find\"\nI felt the power\nOf death over life\nI orphaned his children\nI widowed his wife\nI begged their forgiveness\nI wish I was dead\n\n[Chorus: Johnny Cash]\nI hung my head\nI hung my head\nI hung my head\nI hung my\n\n[Verse 4: Johnny Cash]\nEarly one morning\nWith time to kill\nI see the gallows\nUp on the hill\nAnd out in the distance\nA trick of the brain\nI see a lone rider\nCrossing the plain\nAnd he'd come to fetch me\nTo see what they'd done\nAnd we'll ride together\nTo kingdom come\nI pray for God's mercy\nFor soon I'll be dead\n\n[Chorus: Johnny Cash]\nI hung my head\nI hung my head\nI hung my head\nI hung my head", "[Verse 1]\nAn old cowboy went ridin' out one dark and windy day\nUpon a ridge he rested as he went along his way\nWhen all at once a mighty herd of red-eyed cows he saw\nPlowin' through the ragged skies and up a cloudy drawl\n\nTheir brands were still on fire and their hooves were made of steel\nTheir horns were black and shiny and their hot breath he could feel\nA bolt of fear went through him as they thundered through the sky\nFor he saw the riders coming hard and he heard their mournful cry\n\n[Chorus]\nYippie-yi-oh, yippie-yi-aie!\nGhost riders in the sky\n\n[Verse 2]\nTheir faces gaunt, their eyes were blurred, their shirts all soaked with sweat\nHe's ridin' hard to catch that herd but he ain't caught 'em yet\n'Cause they've got to ride forever on that range up in the sky\nOn horses snortin' fire as they ride on, hear their cry\n\nAs the riders loped on by him, he heard one call his name\n\"If you want to save your soul from hell from ridin' on our range\nThen cowboy, change your ways today or with us you will ride\nTryin' to catch the devil's herd across these endless skies\"\n\n[Chorus]\nYippie-yi-oh, yippie-yi-aie!\nGhost riders in the sky\nGhost riders in the sky\nGhost riders in the sky", "[Verse 1]\nWell, you're my friend\nAnd can you see\nMany times we've been out drinking\nMany times we've shared our thoughts\nBut did you ever, ever notice\nThe kind of thoughts I got?\nWell, you know I have a love\nA love for everyone I know\nAnd you know I have a drive\nTo live, I won't let go\nBut can you see its opposition\nComes rising up sometimes?\nThat its dreadful and position\nComes blacking in my mind\n\n[Chorus]\nAnd that I see a darkness[x3]\nDid you know how much I love you?\nIs a hope that somehow you\nCan save me from this darkness\n\n[Verse 2]\nWell, I hope that someday, buddy\nWe have peace in our lives\nTogether or apart\nAlone or with our wives\nAnd we can stop our whoring\nAnd pull the smiles inside\nAnd light it up forever\nAnd never go to sleep\nMy best unbeaten brother\nThis isn't all I see\n\n[Chorus]", "[Chorus]\nNow I taught the weeping willow how to cry\nAnd I showed the clouds how to cover up a clear blue sky\nAnd the tears that I cried for that woman are going to flood you, Big River\nThen I'm going to sit right here until I die\n\n[Verse 1]\nI met her accidentally in St. Paul, Minnesota\nAnd it tore me up every time I heard her drawl, Southern drawl\nThen I heard my dream was back Downstream cavorting in Davenport\nAnd I followed you, Big River, when you called\n\n[Verse 2]\nThen you took me to St. Louis later on down the river\nA freighter said she's been here but she's gone, boy, she's gone\nI found her trail in Memphis, but she just walked up the bluff\nShe raised a few eyebrows and then she went on down alone\n\n[Verse 3]\nNow, won't you batter down by Baton Rouge, River Queen, roll it on\nTake that woman on down to New Orleans, New Orleans\nGo on, I've had enough; dump my blues down in the gulf\nShe loves you, Big River, more than me\n\n[Chorus]\nNow I taught the weeping willow how to cry cry cry\nAnd I showed the clouds how to cover up a clear blue sky\nAnd the tears that I cried for that woman are going to flood you Big River\nThen I'm going to sit right here until I die", "[Verse 1]\nWhere the road is dark and the seed is sowed\nWhere the gun is cocked and the bullet's cold\nWhere the miles are marked in the blood and gold\nI'll meet you further on up the road\n\n\nGot on my dead man's suit and my smilin' skull ring\nMy lucky graveyard boots and a song to sing\nI got a song to sing, it keeps me out of the cold\nAnd I'll meet you further on up the road\n\n[Hook]\nFurther on up the road\nFurther on up the road\nWhere the way is dark and the night is cold\nOne sunny mornin' we'll rise I know\nAnd I'll meet you further on up the road\n\n[Verse 2]\nNow I been out in the desert, just doin' my time\nSearchin' through the dust, lookin' for a sign\nIf there's a light up ahead, well brother I don't know\nBut I got this fever burnin' in my soul\n\n[Bridge]\nFurther on up the road\nFurther on up the road\nFurther on up the road\nFurther on up the road\n\n[Hook]\nOne sunny mornin' we'll rise I know\nAnd I'll meet you further on up the road\nOne sunny mornin' we'll rise I know\nAnd I'll meet you further on up the road", "[Verse 1]\nSome glad morning when this life is over\nI'll fly away\nTo a home on God's celestial shore\nI'll fly away\n\n[Chorus]\nI'll fly away, o Glory\nI'll fly away (In the morning)\nWhen I die, Hallelujah, bye and bye\nI'll fly away\n\n[Verse 2]\nWhen the shadows of this life are gone\nI'll fly away\nLike a bird from prison bars has flown\nI'll fly away\n\n[Chorus]\nI'll fly away, o Glory\nI'll fly away (In the morning)\nWhen I die, Hallelujah, bye and bye\nI'll fly away\n\n[Verse 3]\nJust a few more weary days and then\nI'll fly away\nTo a land where joy shall never end\nI'll fly away\n\n[Chorus]\nI'll fly away, o Glory\nI'll fly away (In the morning)\nWhen I die, Hallelujah, bye and bye\nI'll fly away", "[Verse 1]\nI'm just a poor wayfaring stranger\nTravelling through this world below\nThere's no sickness, no toil, nor danger\nIn that bright land to which I go\n\n[Pre-Chorus 1]\nI'm going there to see my Father\nAnd all my loved ones who've gone on\n\n[Chorus]\nI'm just going over Jordan\nI'm just going over home\n\n[Verse 2]\nI know dark clouds will gather around me\nI know my way is hard and steep\nBut beauteous fields arise before me\nWhere God's redeemed, their vigils keep\n\n[Pre-Chorus 2]\nI'm going there to see my Mother\nShe said she'd meet me when I come\n\n[Chorus]\nSo, I'm just going over Jordan\nI'm just going over home", "I'm a charger\nThat charges through the night\nLike an orange bolt of lightning\nPassing everything in sight\nI'm the best pal the Duke boys' ever had\nI'm thunder on the highway looking bad, bad, bad\n\nI'm a knight\nLike the kind in shining armor\nWith my polished body gleaming\nI'm a fighter and a charmer\nIf trouble comes your way just ask for me\nMy friends all know me as the General Lee\n\nI'm the General Lee\nA piston pumpin' steel belted cavalry\nI'll never let you down when you're riding with me\nBuckle up and I'll show you what I mean\nTake a look back there\nSirens blowing red lights flashing everywhere\nWe'll cross the field and we'll be runnin' free\nThey'll eat dust with compliments of me\nThe General Lee\n\nI'm a hero\nAnd that's how I'll make you feel\nWhen you're riding shotgun with me\nAnd the law is at your heels\nI'm glory bound and when the chase is done\nI'll take off through the mountains and have fun, fun, fun\n\nI've got style\nTearing through the curves\nWith my flag waving proudly to the people that I serve\nI'm number 1 and I'll always be\nThe pride of the South they call the General Lee\n\nI'm the General Lee\nA piston pumpin' steel belted cavalry\nI'll never let you down when you're riding with me\nBuckle up and I'll show you what I mean\nTake a look back there\nSirens blowing red lights flashing everywhere\nI'll jump that pond and we'll be running free\nAnd they'll go swimming compliments of me\nThe General Lee\nThe General Lee\nGeneral Lee", "[Verse 1]\nI saw her through the window today\nShe was sittin' in the Silver Spoon Cafe\nI started to keep going but something made me stop\nShe used to love me a lot\n\nShe looked lonely and I knew the cure\nOld memories would win her heart for sure\nI thought I'd walk on in and I'd give it my best shot\nShe used to love me a lot\n\nI sat down beside her and she smiled\nShe said \"where have you been? It's been a while\"\nShe was glad to see me, I could almost read her thoughts\nShe used to love me a lot\n\n[Hook 1]\nShe used to love me with a love that wouldn't die\nLooking at her now I can't believe I said goodbye\nIt would only take a minute to turn back the clock\nShe used to love me a lot\n\n[Verse 2]\nI remember how good it was back then\nAnd I said \"it's not too late to start again\nWe could spend the night together, take up where we left off\"\nShe used to love me a lot\n\nBut I panicked as she turned to walk away\nAs she went out the door I heard her say\n\"Yes I'm in need of something, but something you ain't got\nBut I used to love you a lot\"\n\n[Hook 2]\nI thought she loved me with a love that wouldn't die\nLooking at her now I can't believe she said goodbye\nShe just left me standing there, I've never been so shocked\nShe used to love me a lot\n\n[Outro]\nShe used to love me a lot\nShe used to love me a lot\nShe used to love me a lot\nShe used to love me a lot", "Early one mornin' while makin' the rounds\nI took a shot of cocaine and I shot my woman down\nI went right home and I went to bed\nI stuck that lovin' .44 beneath my head\n\nGot up next mornin' and I grabbed that gun\nTook a shot of cocaine and away I run\nMade a good run but I run too slow\nThey overtook me down in Juarez, Mexico\n\nLaid in the hot joints takin' the pill\nIn walked the sheriff from Jericho Hill\nHe said Willy Lee your name is not Jack Brown\nYou're the dirty hack that shot your woman down\n\nSaid yes, oh yes, my name is Willy Lee\nIf you've got a warrant just a-read it to me\nShot her down because she made me slow\nI thought I was her daddy, but she had five more\n\nWhen I was arrested I was dressed in black\nThey put me on a train and they took me back\nHad no friend for to go my bail\nThey slapped my dried up carcass in that county jail\n\nEarly next mornin' bout a half past nine\nI spied the sheriff coming down the line\nUp then he coughed as he cleared his throat\nHe said, \"Come on you dirty hack - into that district court\"\n\nInto the courtroom my trial began\nWhere I was handled by twelve honest men\nJust before the jury started out\nI saw that little judge commence to look about\n\nIn about five minutes in walked a man\nHolding the verdict in his right hand\nThe verdict read in the first degree\nI hollered, \"Lawdy Lawdy, have mercy on me\"\n\nThe judge, he smiled as he picked up his pen\n99 years in the Folsom pen\n99 years underneath that ground\nI can't forget the day I shot that bad bitch down\n\nCome on you've gotta listen unto me\nLay off that whiskey and let that cocaine be", "[Verse 1]\nWell, I left Kentucky back in '49\nAnd went to Detroit working on assembly line\nThe first year they had me putting wheels on Cadillacs\nEvery day I'd watch them beauties roll by\nAnd sometimes I'd hang my head and cry\nBecause I always wanted me one that was long and black\nOne day I devised myself a plan\nThat should be the envy of most any man\nI'd sneak it out of there in a lunchbox in my hand\nNow getting caught meant getting fired\nBut I figured I'd have it all by the time I retired\nI'd have me a car worth at least a hundred grand\n\n[Chorus]\nI'd get it one piece at a time\nAnd it wouldn't cost me a dime\nYou'd know it's me when I come through your town\nI'm going to ride around in style\nI'm going to drive everybody wild\nBecause I'll have the only one there is around\n\n[Verse 2]\nSo the very next day when I punched in\nWith my big lunchbox, and with help from my friend\nI left that day with a lunchbox full of gears\nI've never considered myself a thief\nBut GM wouldn't miss just one little piece\nEspecially if I strung it out over several years\nThe first day I got me a fuel pump\nAnd the next day I got me an engine and a trunk\nThen I got me a transmission and all of the chrome\nThe little things I could get in my big lunchbox\nLike nuts, and bolts, and all four shocks\nBut the big stuff we snuck out in my buddy's mobile home\nNow, up to now my plan went all right\nUntil we tried to put it all together one night\nAnd that's when we noticed that something was definitely wrong\nThe transmission was a '53\nAnd the motor turned out to be a '73\nAnd when we tried to put in the bolts all the holes were gone\nSo we drilled it out so that it would fit\nAnd with a little bit of help from an a-daptor kit\nWe had that engine running just like a song\nNow the headlights, they was another sight\nWe had two on the left and one on the right\nBut when we pulled out the switch all three of them come on\nThe back end looked kind of funny too\nBut we put it together and when we got through\nWell, that's when we noticed that we only had one tail-fin\nAbout that time my wife walked out\nAnd I could see in her eyes that she had her doubts\nBut she opened the door and said \"Honey, take me for a spin\"\nSo we drove up town just to get the tags\nAnd I headed her right on down main drag\nI could hear everybody laughing for blocks around\nBut up there at the court house they didn't laugh\nBecause to type it up it took the whole staff\nAnd when they got through the title weighed sixty pounds\n\n[Chorus]\nI got it one piece at a time\nAnd it didn't cost me a dime\nYou'll know it's me when I come through your town\nI'm going to ride around in style\nI'm going to drive everybody wild\nBecause I'll have the only one there is around\n\n[Outro]\nUh, yeah, Red Ryder?\nThis is the Cotton Mouth\nIn the Psycho-Billy Cadillac, come on\nHuh? This is the Cotton Mouth\nAnd negatory on the cost of this mo-chine, there, Red Ryder\nYou might say I went right up to the factory\nAnd picked it up, it's cheaper that way\nUh, what model is it?\nWell, it's a '49, '50, '51, '52, '53, '54, '55, '56\n'57, '58, '59 automobile\nIt's a '60, '61, '62, '63, '64, '65, '66, '67\n'68, '69, '70 automobile", "[Verse 1]\nGo away from my window\nLeave at your own chosen speed\nI'm not the one you want, babe\nI'm not the one you need\nYou say you're looking for someone\nWho's never weak but always strong\nTo protect you and defend you\nWhether you are right or wrong\nSomeone to open each and every door\n\n[Chorus]\nBut it ain't me, babe\nNo, no, no, it ain't me, babe\nIt ain't me you're looking for, babe\n\n[Verse 2]\nGo lightly from the ledge, babe\nGo lightly on the ground\nI'm not the one you want, babe\nI'll only let you down\nYou say you're looking for someone\nWho'll promise never to part\nSomeone to close his eyes for you\nSomeone to close his heart\nSomeone to die for you and more\n\n[Chorus]\n\n[Verse 3]\nYou say you're looking for someone\nTo pick you up each time you fall\nTo gather flowers constantly\nAnd to come each time you call\nAnd will love you for your life\nAnd nothing more\n\n[Chorus]", "[Verse]\nWell they're building a gallows outside my cell I've got 25 minutes to go\nAnd the whole town's waiting just to hear me yell I've got 24 minutes to go\nWell they gave me some beans for my last meal I've got 23 minutes to go\nBut nobody asked me how I feel I've got 22 minutes to go\nWell I sent for the governor and the whole dern bunch with 21 minutes to go\nAnd called up the mayor but he's out to lunch I've got 20 more minutes to go\nThen the sheriff said boy I'm gonna watch you die got 19 minutes to go\nSo I laughed in his face and I spit in his eye got 18 minutes to go\nNow here comes the preacher for to save my soul with 13 minutes to go\nAnd he's talking about burning but I'm so cold I've 12 more minutes to go\nNow they're testing the trap and it chills my spine 11 more minutes to go\nAnd the trap and the rope aw they work just fine got 10 more minutes to go\nWell I'm waiting on the pardon that'll set me free with 9 more minutes to go\nBut this is for real so forget about me got 8 more minutes to go\nWith my feet on the trap and my head on the noose got 5 more minutes to go\nWon't somebody come and cut me loose with 4 more minutes to go\nI can see the mountains I can see the skies with 3 more minutes to go\nAnd it's too dern pretty for a man that don't want to die 2 more minutes to go\nI can see the buzzards I can hear the crows 1 more minute to go\nAnd now I'm swinging and here I go-o-o-o-o-o-o-o-o-o!", "[Verse 1]\nA young cowboy named Billy Joe grew restless on the farm\nA boy filled with wonderlust who really meant no harm\nHe changed his clothes and shined his boots\nAnd combed his dark hair down\nAnd his mother cried as he walked out\n\n[Chorus]\nDon't take your guns to town son\nLeave your guns at home Bill\nDon't take your guns to town\n\n[Verse 2]\nHe laughed and kissed his mom\nAnd said your Billy Joe's a man\nI can shoot as quick and straight as anybody can\nBut I wouldn't shoot without a cause\nI'd gun nobody down\nBut she cried again as he rode away\n\n[Chorus]\nDon't take your guns to town son\nLeave your guns at home Bill\nDon't take your guns to town\n\n[Verse 3]\nHe sang a song as on he rode\nHis guns hung at his hips\nHe rode into a cattle town\nA smile upon his lips\nHe stopped and walked into a bar\nAnd laid his money down\nBut his mother's words echoed again\n\n[Chorus]\nDon't take your guns to town son\nLeave your guns at home Bill\nDon't take your guns to town\n\n[Verse 4]\nHe drank his first strong liquor then to calm his shaking hand\nAnd tried to tell himself atlast he had become a man\nA dusty cowpoke at his side began to laugh him down\nAnd he heard again his mothers words\n\n[Chorus]\nDon't take your guns to town son\nLeave your guns at home Bill\nDon't take your guns to town\n\n[Verse 5]\nFilled with rage then\nBilly Joe reached for his gun to draw\nBut the stranger drew his gun and fired\nBefore he even saw\nAs Billy Joe fell to the floor\nThe crowd all gathered around\nAnd wondered at his final words\n\n[Chorus]\nDon't take your guns to town son\nLeave your guns at home Bill\nDon't take your guns to town", "[Chorus]\nHey, get rhythm when you get the blues\nCome on, get rhythm when you get the blues\nGet a rock and' roll feeling in your bones\nPut taps on your toes and get gone\nGet rhythm when you get the blues\n\n[Verse 1]\nA Little shoeshine boy he never gets low down\nBut he's got the dirtiest job in town\nBending low at the peoples feet\nOn the windy corner of the dirty street\nWell, I asked him while he shined my shoes\nHow'd he keep from getting the blues\nHe grinned as he raised his little head\nPopped a shoeshine rag and then he said\n\n[Chorus]\nGet rhythm when you get the blues\nCome on, get rhythm when you get the blues\nA jumpy rhythm makes you feel so fine\nIt'll shake all your trouble from your worried mind\nGet rhythm when you get the blues\n\nHey, get rhythm when you get the blues\nCome on, get rhythm when you get the blues\nGet a rock and' roll feeling in your bones\nPut taps on your toes and get gone\nGet rhythm when you get the blues\n\n[Verse 2]\nWell, I sat down to listen to the shoeshine boy\nAnd I thought I was going to jump for joy\nSlapped on the shoe polish left and right\nHe took a shoeshine rag and he held it tight\nHe stopped once to wipe the sweat away\nI said you're a mighty little boy to be-a working that way\nHe said I like it with a big wide grin\nKept on a popping and he said again\n\n[Chorus]\nGet rhythm when you get the blues\nCome on, get rhythm when you get the blues\nIt only costs a dime, just a nickel a shoe\nBut does a million dollars worth of good for you\nGet rhythm when you get the blues", "[Pre-Chorus]\nYour own, personal Jesus\nSomeone to hear your prayers\nSomeone who cares\nYour own, personal Jesus\nSomeone to hear your prayers\nSomeone who's there\n\n[Chorus]\nFeeling unknown\nAnd you're all alone\nFlesh and bone\nBy the telephone\nLift up the receiver\nI'll make you a believer\nTake second best\nPut me to the test\nThings on your chest\nYou need to confess\nI will deliver\nYou know I'm a forgiver\nReach out and touch faith\nReach out and touch faith\n\n[Pre-Chorus]\nYour own, personal Jesus\nSomeone to hear your prayers\nSomeone who cares\nYour own, personal Jesus\nSomeone to hear your prayers\nSomeone to care\n\n[Chorus]\nFeeling unknown\nAnd you're all alone\nFlesh and bone\nBy the telephone\nLift up the receiver\nI'll make you a believer\nI will deliver\nYou know I'm a forgiver\nReach out and touch faith\nReach out and touch faith\nReach out and touch faith\nReach out and touch faith", "[Verse 1]\nYou wired me awake\nAnd hit me with a hand of broken nails\nYou tied my lead and pulled my chain\nTo watch my blood begin to boil\n\n[Chorus]\nBut I'm going to break\nI'm going to break my\nGoing to break my rusty cage and run\nI'm going to break\nI'm going to break my\nGoing to break my rusty cage and run\n\n[Verse 2]\nToo cold to start a fire\nI'm burning diesel, burning dinosaur bones\nI'll take the river down to Stillwater\nAnd ride a pack of dogs\n\n[Chorus]\nBut I'm going to break\nI'm going to break my\nGoing to break my rusty cage and run\nI'm going to break\nI'm going to break my\nGoing to break my rusty cage and run\n\n[Verse 3]\nWhen the forest burns along the road\nLike God's eyes in my headlights\nWhen the dogs are looking for their bones\nAnd it's raining icepicks on your steel shore\n\n[Chorus]\nI'm going to break\nI'm going to break my\nI'm going to break my rusty cage and run\nI'm going to break\nI'm going to break my\nGoing to break my rusty cage and run\nI'm going to break\nI'm going to break my\nGoing to break my rusty cage and run\nI'm going to break\nI'm going to break my\nGoing to break my rusty cage and run", "They gave him his orders at Monroe Virginia\nSaying Steve you're way behind time\nThis is not 38 this is old 97\nYou must put her into Spencer on time\n\nHe turned around and said to his black greasy fireman\n\"Shovel on a little more coal\nAnd when we cross that White Old Mountain\nWatch old 97 roll\"\n\nAnd then a telegram came to Washington station\nThis is how it read:\nIt said, \"That brave engineer that has run old 97\nIs lying down in Danville, dead\"\n\nHe was going down the grade making 90 miles an hour\nHis whistle broke into a scream\nHe was found in the wreck with his hand on the throttle\nScalded to death by the steam\n\nSo now all you pretty ladies you better take a warning\nFrom this time on and learn\nDon't you speak hard words to your true lover husband\nHe may leave you and never return", "[Verse 1: Johnny Cash]\nFor two long years my head hurt bad\nSo the doctor checked me and he shook his head\nHe said, \"I'm sorry to tell you but your body's outlived your brain\"\nHe said, \"I know this doctor in New York son\nAnd he'll fix you up right with a brand new one\"\nSo the head doctor met me when I stepped down off the train\nHe said, \"We had this bank robber killed last night\nHis body's shot but his brain's alright\nI'll give you a transplant boy, and it'll be okay\"\nI got the new brain in and I was feeling great\nI went right back to Nashville with no headache\nBut something strange happened when I walked in the bank one day\n\n[Chorus]\nI said \"Stick 'em up everybody, I'm robbing this place\nDrop all of your money in my guitar case\nDon't nobody move and don't nobody reach for that door\nA lady said, \"Why, you're Johnny Cash!\"\nI said, \"No ma'am, I'm the Manhattan Flash\nAnd I am the best bank robber in New York\"\n\n[Verse 2]\nNow the other night, Roy Acuff called me\nHe said, \"John, I'd like for you to do the Opry\"\nSo I went out on the stage, but I couldn't sing\nI got into half a verse of 'bout Walk The Line\nAnd something snapped in that head of mine\nI yelled, \"Stick 'em up! Gimme your money, watches and rings\"\nWell I called New York and talked to that brain quack\nI said, \"Doc, I've got to have my old brain back\"\nHe said, \"I'm sorry there Mr. Cash, but I can't do that\"\nHe said, \"I put your brain in a chicken last Monday\nHe singing your songs and making lots of money\nAnd I got him signed to a ten year recording contract\"\nNow friends, if you see me walking down the street\nRemember what your see ain't necessarily me\nAnd if I try to hold you up, don't blame it on mine\nBut when you got ten bucks that you can blow\nYou ought to catch that Johnny Chicken Show\nHe's done fairs and concerts dates all across the line\n\n[Chorus]\nI said \"Stick 'em up everybody, I'm robbing this place\nDrop all of your money in my guitar case\nDon't nobody move and don't nobody reach for that door\nA lady said, \"Why, you're Johnny Cash!\"\nI said, \"No ma'am, I'm the Manhattan Flash\nAnd I am the best bank robber in New York\"\n\n[Outro]\nWell, I don't pay any income tax\nYou don't pay tax on money you steal\nBut you ought to catch that Johnny Chicken Show\nChicken In Black\nMmmmm...", "[Chorus]\nHow high's the water, mama?\nTwo feet high and rising\nHow high's the water, papa?\nTwo feet high and rising\n\n[Verse 1]\nWe can make it to the road in a homemade boat\nThat's the only thing we got left that'll float\nIt's already over all the wheat and the oats\nTwo feet high and rising\n\n[Chorus]\nHow high's the water, mama?\nThree feet high and rising\nHow high's the water, papa?\nThree feet high and rising\n\n[Verse 2]\nWell, the hives are gone\nI've lost my bees\nThe chickens are sleeping\nIn the willow trees\nCow's in water up past her knees\nThree feet high and rising\n\n[Chorus]\nHow high's the water, mama?\nFour feet high and rising\nHow high's the water, papa?\nFour feet high and rising\n\n[Verse 3]\nHey, come look through the window pane\nThe bus is coming, it's going to take us to the train\nLooks like we'll be blessed with a little more rain\nFour feet high and rising\n\n[Chorus]\nHow high's the water, mama?\nFive feet high and rising\nHow high's the water, papa?\nFive feet high and rising\n\n[Verse 4]\nWell, the rails are washed out north of town\nWe got to head for higher ground\nWe can't come back till the water comes down\nFive feet high and rising\nWell its five feet high and rising", "[Verse 1]\nBelinda was mine until the time that I found her\nHoldin' Jim\nAnd loving him\nThen Sue came along, loved me strong, that's what I thought\nMe and Sue\nBut that died, too\n\n[Chorus]\nDon't know that I will but until I can find me\nA girl who'll stay and won't play games behind me\nI'll be what I am\nA solitary man\nA solitary man\n\n[Verse 2]\nI've had it to here - being where love's a small word\nA part time thing\nA paper ring\nI know it's been done having one girl who loved me\nRight or wrong\nWeak or strong\n\n[Chorus][x2]", "[Produced by John Carter Cash and Rick Rubin]\n\n[Intro-Johnny Cash]\nIt all began when they took me from my home\nAnd put me on Death Row\nA crime for which I am totally innocent, you know\n\n[Verse 1--Johnny Cash]\nI began to warm and chill\nTo objects and their fields\nA ragged cup, a twisted mop\nThe face of Jesus in my soup\nThose sinister dinner deals\nThe meal trolley's wicked wheels\nA hooked bone rising from my food\nAll things either good or ungood\n\n[Chorus--Johnny Cash]\nAnd the mercy seat is waiting\nAnd I think my head is burning\nAnd in a way I'm yearning\nTo be done with all this weighing of the truth\nAn eye for an eye\nAnd a tooth for a tooth\nAnd anyway I told the truth\nAnd I'm not afraid to die\n\n[Verse 2-Johnny Cash]\nI hear stories from the chamber\nChrist was born into a manger\nAnd like some ragged stranger\nHe died upon the cross\nMight I say, it seems so fitting in its way\nHe was a carpenter by trade\nOr at least that's what I'm told\nMy kill-hand's\nTatooed E.V.I.L. across it's brother's fist\nThat filthy five! They did nothing to challenge or resist\nIn Heaven His throne is made of gold\nThe ark of his Testament is stowed\nA throne from which I'm told\nAll history does unfold\nIt's made of wood and wire\nAnd my body is on fire\nAnd God is never far away\nInto the mercy seat I climb\nMy head is shaved, my head is wired\nAnd like a moth that tries\nTo enter the bright eye\nI go shuffling out of life\nJust to hide in death awhile\nAnd anyway I never lied\n\n[Chorus-Johnny Cash]\nAnd the mercy seat is waiting\nAnd I think my head is burning\nAnd in a way I'm yearning\nTo be done with all this weighing of the truth\nAn eye for an eye\nAnd a tooth for a tooth\nAnd anyway I told the truth\nAnd I'm not afraid to die\n\n[Verse 3-Johnny Cash]\nAnd the mercy seat is burning\nAnd I think my head is glowing\nAnd in a way I'm hopin'\nTo be done with all this twisting of the truth\nAn eye for an eye\nAnd a tooth for a tooth\nAnd any way there was no proof\nAnd I'm not afraid to die\nAnd the mercy seat is glowing\nAnd I think my head is smoking\nAnd in a way I'm hoping\nTo be done with all these looks of disbelief\nA life for a life\nAnd a truth for a truth\nAnd I've got nothing left to loose\nAnd I'm not afraid to die\nAnd the mercy seat is smoking\nAnd I think my head is melting\nAnd in a way that's helping\nTo be done with all this twisting of the truth\nAn eye for an eye\nAnd a tooth for a tooth\nAnd any way I told the truth\nBut I'm afraid I told a lie", "[Intro]\nIra Hayes\nIra Hayes\n\n[Chorus]\nCall him drunken Ira Hayes\nHe won't answer anymore\nNot the whiskey drinking Indian\nNor the Marine that went to war\n\n[Verse 1]\nGather round me people there's a story I would tell\nAbout a brave young Indian you should remember well\nFrom the land of the Pima Indian\nA proud and noble band\nWho farmed the Phoenix valley in Arizona land\nDown the ditches for a thousand years\nThe water grew Ira's peoples' crops\nUntil the white man stole the water rights\nAnd the sparkling water stopped\nNow Ira's folks were hungry\nAnd their land grew crops of weeds\nWhen war came, Ira volunteered\nAnd forgot the white man's greed\n\n[Chorus]\nCall him drunken Ira Hayes\nHe won't answer anymore\nNot the whiskey drinking Indian\nNor the Marine that went to war\n\n[Bridge]\nThere they battled up Iwo Jima's hill\nTwo hundred and fifty men\nBut only twenty-seven lived to walk back down again\n\n[Verse 2]\nAnd when the fight was over\nAnd when Old Glory raised\nAmong the men who held it high\nWas the Indian, Ira Hayes\n\n[Chorus]\nCall him drunken Ira Hayes\nHe won't answer anymore\nNot the whiskey drinking Indian\nNor the Marine that went to war\n\n[Bridge]\nIra returned a hero\nCelebrated through the land\nHe was wined and speeched and honored\nEverybody shook his hand\n\n[Verse 3]\nBut he was just a Pima Indian\nNo water, no home, no chance\nAt home nobody cared what Ira'd done\nAnd when the Indians dance\n\n[Chorus]\nCall him drunken Ira Hayes\nHe won't answer anymore\nNot the whiskey drinking Indian\nNor the Marine that went to war\n\n[Verse 4]\nThen Ira started drinking hard\nJail was often his home\nThey'd let him raise the flag and lower it\nLike you'd throw a dog a bone!\nHe died drunk one morning\nAlone in the land he fought to save\nTwo inches of water in a lonely ditch\nWas a grave for Ira Hayes\n\n[Chorus]\nCall him drunken Ira Hayes\nHe won't answer anymore\nNot the whiskey drinking Indian\nNor the Marine that went to war\n\n[Verse 5]\nYeah, call him drunken Ira Hayes\nBut his land is just as dry\nAnd his ghost is lying thirsty\nIn the ditch where Ira died", "Oh come all you young fellers so young and so fine\nSeek not your fortune in a dark dreary mine\nIt'll form as a habit and seep in your soul\nUntil the stream of your blood runs as black as the coal\n\nWhere it's dark as a dungeon, damp as the dew\nDanger is double pleasures are few\nWhere the rain never falls, the sun never shines\nIt's a dark as a dungeon way down in the mine\n\nWell it's many a man that I've seen in my day\n(Uh huh, no laughing during this song please, it's being recorded)\nLike a friend with his dope and a drunkard with his wine\nA man will have lust for the lure of the mine\n\nAnd pray when I'm dead and my ages shall roll\nThat my body would blacken and turn into coal\nThen I'll look from the door of my heavenly home and pity the miner digging my bones\n\nWhere it's dark as a dungeon, damp as the dew\nDanger is double pleasures are few\nWhere the rain never falls, the sun never shines\nIt's a dark as a dungeon way down in the mine", "That bed that I lay on is narrow and cold\nThis sickness inside me tears at my soul\nAnd the devil awaits me, he calls me his son\nFor he knows I'm cornered and too weak to run\n\nFor I soon must return to my gutter of thrills\nWhere joy is the needle or a bottle of pills\nWhere a man welcomes misery like an old friend from home\nThat he uses and abuses till the misery is gone\n\nMy mind's filled with torture my body's in pain\nBut the needle is warm as it sinks in my vein\nJust a matter of seconds then my mind will be free\nFrom the coldness and darkness that dominate me\n\nBut the freedom is short lived and then I'm alone\nI must find the pusher but my money's all gone\nThen the cycle of horror starts over once more\nOh God, let me suffer this misery no more", "[Pre-Chorus]\nWe'll meet again\nDon't know where\nDon't know when\nBut I know\nWe'll meet again\nSome sunny day\n\n[Chorus 1]\nKeep smiling through\nJust like you\nAlways do\nUntil the blue skies drive\nThe dark clouds\nFar away\n\n[Chorus 2]\nAnd will you please say hello\nTo the folks that I know\nTell them that I won't be long\nAnd they'll be happy to know\nThat when you saw me go\nI was singing this song\n\n[Pre-Chorus]\nWe'll meet again\nDon't know where\nDon't know when\nBut I know\nWe'll meet again\nSome sunny day\n\nYeah We'll meet again\nI Don't know where\nI Don't know when\nBut I do know\nThat We'll meet again\nSome sunny day\n\n[Chorus 1]\nSo honey\nKeep on smiling through\nJust like you\nAlways do\nUntil the blue skies drive\nThe dark clouds\nFar away\n\n[Chorus 2]\nAnd will you please say hello\nTo the folks that I know\nTell them that I won't be long\nAnd they'll be happy to know\nThat when you saw me go\nI was singing this song\n\n[Outro]\nWe'll meet again\nDon't know where\nDon't know when\nBut I know\nWe'll meet again\nSome sunny day", "[Instrumental]\n[Verse 1]\nI found him by the railroad track this morning\nI could see that he was nearly dead\nI knelt down beside him and I listened\nJust to hear the words the dying fellow said\nHe said they let me out of prison out in Frisco\nFor ten long years I've paid for what I've done\nI was trying to get back to Louisiana\nTo see my Rose and get to know my son\n\n[Chorus]\nGive my love to Rose please, won't you mister?\nTake her all my money, tell her to buy some pretty clothes\nTell my boy that daddy's so proud of him\nAnd don't forget to give my love to Rose\n\n[Verse 2]\nWon't you tell them I said thanks for waiting for me\nTell my boy to help his mom at home\nTell my Rose to try to find another\nBecause it ain't right that she should live alone\nMister here's a bag with all my money\nIt won't last them long the way it goes\nGod bless you for finding me this morning\nNow don't forget to give my love to Rose\n\n[Chorus]\nGive my love to Rose please, won't you mister?\nTake her all my money, tell her to buy some pretty clothes\nTell my boy that daddy's so proud of him\nAnd don't forget to give my love to Rose", "[Verse]\nI walked through a county courthouse square\nOn a park bench, an old man was sitting there\nI said \"Your old court house is kind of run down\"\nHe said \"Naw, it'll do for our little town\"\nI said \"Your old flag pole is leaned a little bit\"\nAnd that's a ragged old flag you got hanging on it\nHe said \"Have a seat\", and I sat down\n\"Is this the first time you've been to our little town?\"\nI said \"I think it is\"\nHe said \"I don't like to brag, but we're kind of proud of\nThat Ragged Old Flag\nYou see, we got a little hole in that flag there\nWhen Washington took it across the Delaware\nAnd It got powder burned the night Francis Scott Key sat watching it\nWriting Say Can You See\nIt got a rip in New Orleans, with Packingham & Jackson\nTugging at its seams\nAnd It almost fell at the Alamo\nBeside the Texas flag\nBut she waved on though\nShe got cut with a sword at Chancellorsville\nAnd she got cut again at Shiloh Hill\nThere was Robert E. Lee and Beauregard and Bragg\nAnd the south wind blew hard on\nThat Ragged Old Flag\nOn Flanders Field in World War I\nShe got a big hole from a Bertha Gun\nShe turned blood red in World War II\nShe hung limp, and low, a time or two\nShe was in Korea, Vietnam, She went where she was sent\nBy her Uncle Sam\nShe waved from our ships upon the briny foam\nAnd now they've about quit waving back here at home\nIn her own good land here She's been abused\nShe's been burned, dishonored, denied an' refused\nAnd the government for which she stands\nHas been scandalized throughout out the land\nAnd she's getting thread bare, and she's wearing thin\nBut she's in good shape, for the shape she's in\nBecause she's been through the fire before\nAnd I believe she can take a whole lot more\"\n\n[Outro]\nSo we raise her up every morning\nAnd we bring her down slow every night\nWe don't let her touch the ground\nAnd we fold her up right\nOn second thought\nI do like to brag\nBecause  I'm mighty proud of\nThat Ragged Old Flag", "[Verse 1]\nNow this here's a story about the Rock Island Line\nWell the Rock Island Line she runs down into New Orleans\nThere's a big tollgate down there and you know\nIf you got certain things on board when you go through the tollgate\nWell you don't have to pay the man no toll\nWell a train driver he pulled up to the tollgate\nAnd a man hollered and asked him what all he had on board and said\n\n[Chorus 1]\nI got livestock\nI got livestock\nI got cows\nI got pigs\nI got sheep\nI got mules\nI got all livestock\n\n[Verse 2]\nWell he said you're alright boy you don't have to pay no toll\nYou can just go right on through so he went on through the tollgate\nAnd as he went through he started picking up a little bit of speed\nPicking up a little bit of steam\nHe got on through he turned and looked back at the man he said\n\n[Chorus 1]\nWell I fooled you\nI fooled you\nI got pigiron\nI got pigiron\nI got all pigiron\n\n[Chorus 2]\nDown the Rock Island Line she's a mighty good road\nRock Island Line it's the road to ride\nRock Island Line it's a mighty good road\nWell if you ride it you got to ride it like you find it\nGet your ticket at the station for the Rock Island Line\n\n[Verse 3]\nLooked cloudy in the west and it looked like rain\nRound the curve came a passenger train\nNorth bound train on a southbound track\nHe's alright a leaving but he won't be back\n\n[Chorus 2]\nDown the Rock Island Line she's a mighty good road\nRock Island Line it's the road to ride\nRock Island Line it's a mighty good road\nWell if you ride it you got to ride it like you find it\nGet your ticket at the station for the Rock Island Line\n\n[Verse 4]\nOh I may be right and I may be wrong\nBut you're gonna miss me when I'm gone\nWell the engineer said before he died\nThere were two more drinks that he'd like to try\nConductor said what could they be\nA hot cup of coffee and a cold glass of tea\n\n[Chorus 2]\nDown the Rock Island Line she's a mighty good road\nRock Island Line it's the road to ride\nRock Island Line it's a mighty good road\nWell if you ride it you got to ride it like you find it\nGet your ticket at the station for the Rock Island Line", "[Verse]\nSan Quentin, you've been livin' hell to me\nYou've hosted me since nineteen sixty three\nI've seen 'em come and go and I've seen them die\nAnd long ago I stopped asking why\nSan Quentin, I hate every inch of you\nYou've cut me and have scarred me through and through\nAnd I'll walk out a wiser weaker man\nMister Congressman, you can't understand\nSan Quentin, what good do you think you do?\nDo you think I'll be different when you're through?\nYou bent my heart and mind and you warp my soul\nAnd your stone walls turn my blood a little cold\nSan Quentin, may you rot and burn in hell\nMay your walls fall and may I live to tell\nMay all the world forget you ever stood\nAnd may all the world regret you did no good\n\n[Outro]\nSan Quentin, you've been living hell to me", "Well I woke up Sunday morning\nWith no way to hold my head, that didn't hurt\nAnd the beer I had for breakfast wasn't bad\nSo I had one more for dessert\nThen I fumbled in my closet through my clothes\nAnd found my cleanest dirty shirt\nThen I washed my face and combed my hair\nAnd stumbled down the stairs to meet the day\n\nI'd smoked my mind the night before\nWith cigarettes and the songs I'd been pickin'\nBut I lit my first and watched a small kid\nPlayin' with a can that he was kicking\nThen I walked across the street\nAnd caught the Sunday smell of someone's fryin' chicken\nAnd it took me back to somethin'\nThat I'd lost somewhere, somehow along the way\n\nOn a Sunday morning sidewalk\nI'm wishing Lord that I was stoned\nCause there's something in a Sunday\nThat makes a body feel alone\nAnd there's nothin' short of dyin'\nThat's half as lonesome as the sound\nOf a sleepin' city sidewalk\nAnd Sunday mornin' comin' down\n\nIn the park I saw a daddy\nWith a laughin' little girl that he was swingin'\nAnd I stopped beside a Sunday school\nAnd listened to the songs they were singin'\nThen I headed down the street\nAnd somewhere far away a lonely bell was ringin'\nAnd it echoed thru the canyon\nLike the disappearing dreams of yesterday\n\nOn a Sunday morning sidewalk\nI'm wishing Lord that I was stoned\nCause there's something in a Sunday\nThat makes a body feel alone\nAnd there's nothin' short of dyin'\nThat's half as lonesome as the sound\nOf a sleepin' city sidewalk\nAnd Sunday mornin' comin' down", "[Produced by Rick Rubin]\n\n[Verse]\nThe beast in me\nIs caged by frail and fragile bars\nRestless by day\nAnd by night rants and rages at the stars\nGod help the beast in me\nThe beast in me\nHas had to learn to live with pain\nAnd how to shelter from the rain\nAnd in the twinkling of an eye\nMight have to be restrained\nGod help the beast in me\nSometimes it tries to kid me\nThat it's just a teddy bear\nAnd even somehow manage to vanish in the air\nAnd that is when I must beware\nOf the beast in me that everybody knows\nThey've seen him out dressed in my clothes\nPatently unclear\nIf it's New York or New Year\nGod help the beast in me", "[Chorus]\nWanted man in California\nWanted man in Buffalo\nWanted man in Kansas City\nWanted man in Ohio\nWanted man in Mississippi\nWanted man in old Cheyenne\nWherever you might look tonight you might see this wanted man\n\n[Verse]\nI might be in Colorado\nOr Georgia by the sea\nWorking for some man who may not know at all who I might be\nIf you ever see me coming and if you know who I am\nDon't you breathe it to nobody because you know I'm on the lamb\nWanted man by Lucy Watson\nWanted man by Jeannie Brown\nWanted man by Nellie Johnson\nWanted man in this next town\nI've had all that I wanted of a lot of things I've had\nAnd a lot more than I needed of some things that turned out bad\nI got sidetracked in El Paso\nStopped to get myself a map\nWent the wrong way in Juarez with Juanita on my lap\nWent to sleep in Shreveport\nWoke up in Abilene\nWondering why I'm wanted at some town half way in between\nWanted man in Albuquerque\nWanted man in Syracuse\nWanted man in Tallahassee\nWanted man in Baton Rouge\nThere's somebody set to grab me\nAnywhere that I might be\nAnd wherever you might look tonight\nYou might get a glimpse of me\n\n[Chorus]", "[Verse]\nOh, Danny boy, the pipes, the pipes are calling\nFrom glen to glen, and down the mountain side\nThe summer's gone, and all the roses fallin'\nIt's you, it's you must go and I must bide\nBut come yet back when summer's in the meadow\nOr when the valley's hushed and white with snow\nI'll be here in sunshine or in shadow\nOh, Danny boy, oh, Danny boy, I love you so\nBut if you come, when all the flowers are dying\nAnd I am dead, as dead I well may be\nYou'll come and find the place where I am lying\nAnd kneel and say an \"ave\" there for me\nAnd I will know, though soft you tread above me\nAnd then my grave will richer, sweeter be\nAnd you'll bend down and tell me that you love me\nAnd I will rest in peace until you come to me", "As I walked out on the streets of Laredo\nAs I walked out on Laredo one day\nI spied a young cowboy all wrapped in white linen\nWrapped in white linen as cold as the clay\n\"I can see by your outfit that you are a cowboy\"\nThese words he did say as I boldly walked by\n\"Come and sit down beside me and hear my sad story\nI'm shot in the breast and I know I must die\"\n\n\"It was once in the saddle, I used to go dashing\nOnce in the saddle, I used to go gay\nFirst to the card-house and then down to Rose's\nBut I'm shot in the breast and I'm dying today\nGet six jolly cowboys to carry my coffin\nSix dance-hall maidens to bear up my pall\nThrow bunches of roses all over my coffin\nRoses to deaden the clods as they fall\"\n\n\"Then beat the drum slowly, play the Fife lowly\nPlay the dead march as you carry me along\nTake me to the green valley, lay the sod o'er me\nI'm a young cowboy and I know I've done wrong\"\n\n\"Then go write a letter to my grey-haired mother\nAnd tell her the cowboy that she loved has gone\nBut please not one word of the man who had killed me\nDon't mention his name and his name will pass on\"\nWhen this he had spoken, the hot sun was setting\nThe streets of Laredo grew cold as the clay\nWe took the young cowboy down to the green valley\nAnd there stands his marker we made to this day\n\nWe beat the drum slowly, play the Fife lowly\nPlay the dead march as we carried him along\nDown in the green valley, lay the sod over him\nHe was a young cowboy and he said he'd done wrong", "There once was a musical troupe\nA picking, singing folk group\nThey sang the mountain ballads\nAnd the folk songs of our land\nThey were long on musical ability\nFolks thought they would go far\nBut political incompatibility led to their downfall\n\nWell, the one on the right was on the left\nAnd the one in the middle was on the right\nAnd the one on the left was in the middle\nAnd the guy in the rear was a Methodist\n\nThis musical aggregation toured the entire nation\nSinging the traditional ballads\nAnd the folk songs of our land\nThey performed with great virtuosity\nAnd soon they were the rage\nBut political animosity prevailed upon the stage\n\nWell, the one on the right was on the left\nAnd the one in the middle was on the right\nAnd the one on the left was in the middle\nAnd the guy in the rear burned his driver's license\n\nWell the curtain had ascended\nA hush fell on the crowd\nAs thousands there were gathered\nTo hear the folk songs of our land\nBut they took their politics seriously\nAnd that night at the concert hall\nAs the audience watched deliriously\nThey had a free-for-all\n\nWell, the one on the right was on the bottom\nAnd the one in the middle was on the top\nAnd the one on the left got a broken arm\nAnd the guy in the rear said, \"Oh dear\"\n\nNow this should be a lesson if you plan to start a folk group\nDon't go mixing politics with the folk songs of our land\nJust work on harmony and diction\nPlay your banjo well\nAnd if you have political convictions\nKeep them to yourself\n\nNow, the one on the left works in a bank\nAnd the one in the middle drives a truck\nThe one on the right's an all-night deejay\nAnd the guy in the rear got drafted", "[Verse 1]\nI went out walking through the streets paved with gold\nLifted some stones\nSaw the skin and bones\nOf a city without a soul\nI went out walking under an atomic sky\nWhere the ground won't turn\nAnd the rain it burns\nLike the tears when I said goodbye\n\n[Chorus]\nYeah I went with nothing\nNothing but the thought of you\nI went wandering\nI went drifting through the capitals of tin\nWhere men can't walk\nOr freely talk\nAnd sons turn their fathers in\n\n[Verse 2]\nI stopped outside a church house\nWhere the citizens like to sit\nThey say they want the kingdom\nBut they don't want God in it\n\n[Chorus]\n\n[Verse 3]\nI went out with nothing\nNothing but the thought of you\nI went wandering\nI went out walking\nDown that winding road\nWhere no one's trusting no one\nAnd conscience a too heavy load\nI went out riding, down that ol'eight lane\nI passed by a thousand signs\nLooking for my own name\n\n[Chorus]\n\n[Verse 4]\nI went with nothing\nBut the thought you'd be there, too\nLooking for you\nI went out there in search of experience\nTo taste and to touch and to feel's as much\nAs a man can before he repents\nI went out searching, looking for one good man\nA spirit who would not bend or break\nWho could sit at his father's right hand\nI went out walking with a bible and a gun\nThe word of God lay heavy on my heart\nI was sure I was the one\nNow Jesus, don't you wait up\nJesus, I'll be home soon\nYea I went out for the papers\nTold her I'd be back by noon\nYeah I left with nothing\nBut the thought you'd be there too\nLooking for you\nYeah I left with nothing\nNothing but the thought of you\nI went wandering", "[Verse 1]\nLook a-yonder comin'\nComin' down that railroad track\nHey, look a-yonder comin'\nComin' down that railroad track\nIt's the Orange Blossom Special\nBringin' my baby back\n\n[Verse 2]\nWell, I'm going down to Florida\nAnd get some sand in my shoes\nOr maybe Californy\nAnd get some sand in my shoes\nI'll ride that Orange Blossom Special\nAnd lose these New York blues\n\n[Interlude]\n\"Say man, when you going back to Florida?\"\n\"When am I goin' back to Florida? I don't know, don't reckon I ever will.\"\n\"Ain't you worried about getting your nourishment in New York?\"\n\"Well, I don't care if I do-die-do-die-do-die-do-die.\"\n\n[Verse 3]\nHey talk about a-ramblin'\nShe's the fastest train on the line\nTalk about a-travellin'\nShe's the fastest train on the line\nIt's that Orange Blossom Special\nRollin' down the seaboard line", "[Intro]\n(Dream on, dream on teenage queen)\n(Prettiest girl we've ever seen)\n\n[Verse 1]\nThere's a story in our town\nOf the prettiest girl around\nGolden hair and eyes of blue\nHow those eyes could flash at you\n(How those eyes could flash at you)\nBoys hung around her by the score\nBut she loved the boy next door\nWho worked at the candy store\n(Dream on, dream on teenage queen)\n(Prettiest girl we've ever seen)\n\n[Verse 2]\nShe was tops in all they said\nIt never once went to her head\nShe had everything it seems\nNot a care, this teenage queen\n(Not a care, this teenage queen)\nOther boys could offer more\nBut she loved the boy next door\nWho worked at the candy store\n(Dream on, dream on teenage queen)\n(You should be a movie queen)\n\n[Verse 3]\nHe would marry her next spring\nSaved his money, bought a ring\nThen one day a movie scout\nCame to town to take her out\n(Came to town to take her out)\nHollywood could offer more\nSo she left the boy next door\nWorking at the candy store\n(Dream on, dream on teenage queen)\n(See you on the movie screen)\n\n[Verse 4]\nVery soon she was a star\nPretty house and shiny car\nSwimming pool and a fence around\nBut she missed her old home town\n(But she missed her old home town)\nAll the world was at her door\nAll except the boy next door\nWho worked at the candy store\n(Dream on, dream on teenage queen)\n(Saddest girl we've ever seen)\n\n[Verse 5]\nThen one day the teenage star\nSold her house and all her cars\nGave up all her wealth and fame\nLeft it all and caught a train\n(Left it all and caught a train)\nDo I have to tell you more\nShe came back to the boy next door\nWho worked at the candy store\n\n[Outro]\n(Now this story has some more\nYou'll hear it all at the candy store)", "[Verse 1]\nI've wept for those who suffer long\nBut how I weep for those who've gone\nInto rooms of grief and questioned wrong\nBut keep on killing\nIt's in the soul to feel such things\nBut weak to watch without speaking\nOh what mercy sadness brings\nIf God be willing\n\n[Chorus]\nThere is a train that's heading straight\nTo heaven's gate, to heaven's gate\nAnd on the way, child and man\nAnd woman wait, watch and wait\nFor redemption day\n\n[Verse 2]\nFire rages in the streets\nAnd swallows everything it meets\nIt's just an image often seen\nOn television\nCome leaders, come you men of great\nLet us hear you pontificate\nYour many virtues laid to waste\nAnd we aren't listening\n\n[Chorus]\nThere is a train that's heading straight\nTo heaven's gate, to heaven's gate\nAnd on the way, child and man\nAnd woman wait, watch and wait\nFor redemption day\n\n[Verse 3]\nWhat do you have for us today\nThrow us a bone but save the plate\nOn why we waited until so late\nWas there no oil to excavate\nNo riches in trade for the fate\nOf every person who died in hate\nThrow us a bone, you men of great\n\n[Chorus]\nThere is a train that's heading straight\nTo heaven's gate, to heaven's gate\nAnd on the way, child and man\nAnd woman wait, watch and wait\nFor redemption day\n\n[Outro]\nIt's buried in the countryside\nIt's exploding in the shells at night\nIt's everywhere a baby cries\nFreedom\nFreedom\nFreedom", "I have found a friend in Jesus, He's everything to me\nHe's the fairest of ten thousand to my soul\nHe's the Lily of the Valley, in Him alone I see\nAll I need to cleanse and make me fully whole\n\nIn sorrow He's my comfort, in trouble He's my stay\nAnd He tells me every care on Him to roll\nHe's the lily of the valley, the bright and morning star\nHe's the fairest of ten thousand to my soul\n\nHe will never, never leave me nor yet forsake me here\nWhile I live by faith and do His blessed will\nThere's a wall of fire about me and I've nothing now to fear\nWith His manna He my hungry soul shall fill\n\nAnd then sweeping up to glory to see His blessed face\nWhere rivers of delight shall ever roll\nHe's the lily of the valley, the bright and morning star\nHe's the fairest of ten thousand to my soul", "[Verse]\nWell you ask me if I'll forget my baby\nI guess I will, someday\nI don't like it but I guess things happen that way\nYou ask me if I'll get along\nI guess I will, someway\nI don't like it but I guess things happen that way\nGod gave me that girl to lean on\nThen he put me on my own\nHeaven help me be a man\nAnd have the strength to stand alone\nI don't like it but I guess things happen that way\nYou ask me if I'll miss her kisses\nI guess I will, everyday\nI don't like it but I guess things happen that way\nYou ask me if I'll find another\nI don't know. I can't say\nI don't like it but I guess things happen that way\nGod gave me that girl to lean on\nThen he put me on my own\nHeaven help me be a man\nAnd have the strength to stand alone\nI don't like it but I guess things happen that way", "I remember when I was a lad\nTimes were hard and things were bad\nBut there's a silver lining behind every cloud\nJust poor people, that's all we were\nTrying to make a living out of black land dirt\nWe'd get together in a family circle singing loud\n\nDaddy sang bass\nMama sang tenor\nMe and little brother would join right in there\nSinging seems to help a troubled soul\nOne of these days and it won't be long\nI'll rejoin them in a song\nI'm going to join the family circle at the throne\nNo, the circle won't be broken\nBy and by, Lord, by and by\n\nDaddy sang bass\nMama sang tenor\nMe and little brother would join right in there\nIn the sky, Lord, in the sky\n\nNow I remember after work\nMama would call in all of us\nYou could hear us singing for a country mile\nNow little brother has done gone on\nBut, I'll rejoin him in a song\nWe'll be together again up yonder in a little while\n\nDaddy sang bass\nMama sang tenor\nMe and little brother would join right in there\nIn the sky, Lord, in the sky\n\nDaddy sang bass\nMama sang tenor\nMe and little brother would join right in there\nIn the sky, Lord, in the sky\n\nSongwriter:  Carl Perkins", "[Verse 1]\nSix foot six he stood on the ground\nHe weighed two hundred and thirty-five pounds\nBut I saw that giant of a man brought down\nTo his knees by love\nHe was the kind of man that would gamble on luck\nLook you in the eye and never back up\nBut I saw him crying like a little whipped pup\nBecause of love\n\n[Chorus]\nYou can't see it with your eyes, hold it in your hands\nBut like the wind it covers our land\nStrong enough to rule the heart of any man\nThis thing called love\nIt can lift you up never let you down\nTake your world and turn it around\nEver since time nothing's ever been found\nThat's stronger than love\n\n[Verse 2]\nMost men are like me, they struggle and doubt\nThey trouble their minds day in and day out\nToo busy with living to worry about\nA little word like love\nBut when I see a mother's tenderness\nAs she holds her young close to her breast\nThen I thank God that the world's been blessed\nWith a thing called love\n\n[Chorus]\nYou can't see it with your eyes, hold it in your hands\nBut like the wind it covers our land\nStrong enough to rule the heart of any man\nThis thing called love\nIt can lift you up never let you down\nTake your world and turn it around\nEver since time nothing's ever been found\nThat's stronger than love", "To the town of Agua Fria rode a stranger one fine day\nHardly spoke to folks around him didn't have too much to say\nNo one dared to ask his business no one dared to make a slip\nFor the stranger there amongst them had a big iron on his hip\nBig iron on his hip\n\nIt was early in the morning when he rode into the town\nHe came riding from the south side slowly lookin' all around\nHe's an outlaw loose and running came the whisper from each lip\nAnd he's here to do some business with the big iron on his hip\nBig iron on his hip\n\nIn this town there lived an outlaw by the name of Texas Red\nMany men had tried to take him and that many men were dead\nHe was vicious and a killer though a youth of twenty four\nAnd the notches on his pistol numbered one an nineteen more\nOne and nineteen more\n\nNow the stranger started talking made it plain to folks around\nWas an Arizona ranger wouldn't be too long in town\nHe came here to take an outlaw back alive or maybe dead\nAnd he said it didn't matter he was after Texas Red\nAfter Texas Red\n\nWasn't long before the story was relayed to Texas Red\nBut the outlaw didn't worry men that tried before were dead\nTwenty men had tried to take twenty men had made a slip\nTwenty one would be the ranger with the big iron on his hip\nBig iron on his hip\n\nThe morning passed so quickly it was time for them to meet\nIt was twenty past eleven when they walked out in the street\nFolks were watching from their windows every-body held their breath\nThey knew this handsome ranger was about to meet his death\nAbout to meet his death\n\nThere was forty feet between them when they stopped to make their play\nAnd the swiftness of the ranger is still talked about to-day\nTexas Red had not cleared leather when a bullet fairly ripped\nAnd the rangers aim was deadly with the big iron on his hip\nBig iron on his hip\n\nIt was over in a moment and the folks had gathered round\nThere before them lay the body of the outlaw on the ground\nOh he might have gone on living but he made one fatal slip\nWhen he tried to match the ranger with the big iron on his hip\nBig iron on his hip\n\nBig iron Big iron\nWhen he tried to match the ranger with the big iron on his hip\nThe Big Iron on his hip", "[Verse]\nThere are places I'll remember\nAll my life\nThough some have changed\nSome forever\nNot for better\nSome have gone and some remain\nAll these places have their moments\nWith lovers and friends\nI still can recall\nSome are dead and some are living\nIn my life\nI've loved them all\nBut of all these friends and lovers\nThere is no one\nCompares with you\nAnd these memories\nLose their meaning\nWhen I think of love\nAs something new\n\n[Chorus]\nThough I know I'll never lose affection\nFor people and things that went before\nI know I'll often stop and think about them\nIn my life\nI love you more\nThough I know I'll never lose affection\nFor people and things that went before\nI know I'll often stop and think about them\nIn my life\nI love you more\nIn my life\nI love you more", "Father\nIt's not time to make a change\nJust relax, take it easy\nYou're still young, that's your fault\nThere's so much you have to know\nFind a girl, settle down\nIf you want you can marry\nLook at me, I am old, but I'm happy\n\nI was once like you are now\nAnd I know that it's not easy\nTo be calm when you've found something going on\nBut take your time, think a lot\nWhy think of everything you've got\nFor you will still be here tomorrow, but your dreams may not\n\n[Son]\nHow can I try to explain\nWhen I do he turns away again\nIt's always been the same, the same old story\nFrom the moment I could talk\nI was ordered to listen\nThere's a way and I know that I have to go away\nI know I have to go\n\n[Father]\nIt's not time to make a change\nJust sit down, take it slowly\nYou're still young, that's your fault\nThere's so much you have to go through\nFind a girl, settle down\nIf you want you can marry\nLook at me, I am old, but I'm happy\n\n[Son]\nAll the times that I cried\nKeeping all the things I knew inside\nIt's hard, but it's harder to ignore it\nIf they were right, I'd agree\nBut it's them you know not me\nNow there's a way and I know that I have to go away\nI know I have to go", "[Verse 1]\nHey porter! Hey porter!\nWould you tell me the time?\nHow much longer will it be 'til we cross\nThat Mason Dixon Line?\nAt daylight would ya tell that engineer\nTo slow it down?\nOr better still, just stop the train\nBecause I want to look around\n\n[Verse 2]\nHey porter! Hey porter!\nWhat time did you say?\nHow much longer will it be 'til I can\nSee the light of day?\nWhen we hit Dixie will you tell that engineer\nTo ring his bell?\nAnd ask everybody that ain't asleep\nTo stand right up and yell\n\n[Verse 3]\nHey porter! Hey porter!\nIt's getting light outside\nThis old train is puffing smoke\nAnd I have to strain my eyes\nBut ask that engineer if he will\nBlow his whistle please\n'Cause I smell frost on cotton leaves\nAnd I feel that Southern breeze\n\n[Verse 4]\nHey porter! Hey porter!\nPlease get my bags for me\nI need nobody to tell me now\nThat we're in Tennessee\nGo tell that engineer to make that\nLonesome whistle scream\nWe're not so far from home\nSo take it easy on the steam\n\n[Verse 5]\nHey porter! Hey porter!\nPlease open up the door\nWhen they stop the train I'm going to get off first\nBecause I can't wait no more\nTell that engineer I said thanks a lot\nAnd I didn't mind the fare\nI'm going to set my feet on Southern soil\nAnd breathe that Southern air", "[Verse 1]\nWell I'm going start out walking\nJust you wait and see\nUh-huh guitar picker\nYou ain't leaving without me\n\n[Chorus]\nOh you big mouth woman\nYou long legged guitar picking man\nBut we can work this out uh huh\nYes ma'm I think we can\n\n[Verse 2]\nWell I stole the Hope diamond\nHoping I could shut your mouth\nBut how am I going wear it\nIf I got to hide it out\n\n[Chorus]\nWell you big mouth woman\nYou long legged guitar picking man\nBut we can work this out uh huh\nYes ma'm I think we can\n\n[Verse 3]\nWell I bought you a first class ticket\nFor a luxury liner cruise\nI got out in that ocean\nLooked around and there was you\n\n[Chorus]\nOh you big mouth woman\nYou long legged guitar picking man\nBut we can work this out uh huh\nYes ma'm I think we can\n\n[Verse 4]\nI bought you a big long limousine\nBut I don't want no car\nI gave my love and everything\nBut you're still what you are\nYou're just a big mouth woman\nYou long legged guitar picking man\nBut we can work this out uh huh\nYes ma'm I think we can\nOh honey I love that big sweet mouth\nYou a long legged guitar picking man\nHa ha I'm going to pick it for you\nNow you a nice guitar picking man", "[Verse 1]\nBack about eighteen and twenty-five\nI left Tennessee very much alive\nI never would've made it through the Arkansas mud\nIf I hadn't been riding on a Tennessee Stud\nHad some trouble with my sweetheart's Pa\nOne of her brothers was a bad outlaw\nI wrote a letter to my Uncle Fud\nAnd I rode away on the Tennessee Stud\n\n[Chorus]\nThe Tennessee Stud was long and lean\nThe color of the sun and his eyes were green\nHe had the nerve and he had the blood\nThere never was a horse like the Tennessee Stud\n\n[Verse 2]\nDrifted on down into no man's land\nCrossed that river called the Rio Grande\nI raced my horse with a Spaniard foe\nGot me a skin full of silver and gold\nMe and the gambler, we couldn't agree\nWe got in a fight over Tennessee\nWe pulled our guns and he fell with a thud\nAnd I rode away on the Tennessee Stud\n\n[Chorus]\n\n[Verse 3]\nRode right back across Arkansas\nI whipped her brother and\nI whipped her Pa\nI found that girl with the golden hair\nShe was riding on a Tennessee Mare\nPretty little baby on the cabin floor\nLittle horse colt playing round the door\nI loved the girl with the golden hair\nAnd the Tennessee Stud loves the Tennessee Mare\n\n[Chorus]", "Delia, oh Delia\nDelia all my life\nIf I hadn't of shot poor Delia\nI'd have had her for my wife\nDelia's gone\nOne more round\nDelia's gone\n\nFirst time I shot her\nShot her in the side\nHard to watch her suffering\nBut with the second shot she died\nDelia's gone\nOne more round\nDelia's gone\n\nWell the guilty get a sentence\nBut I ain't going to tell you mine\nCause I got a brother in Memphis\nWho got Life, or ninety-nine\nDelia's gone\nOne more round\nDelia's gone\n\nBut jailer, oh, jailer\nJailer I can't sleep\nCause all around my bedside\nI hear the patter of Delia's feet\nDelia's gone\nOne more round\nDelia's gone\n\nNow you give me my hammer\nI'll drag the ball and chain\nAnd every rock I bust\nI seem to ring out Delia's name\nDelia's gone\nOne more round\nDelia's gone\n\nDelia's gone\nOne more round\nDelia's gone", "[Verse 1]\nHear that lonesome whippoorwill\nHe sounds too blue to fly\nThe midnight train is whining low\n\n[Chorus]\nI'm so lonesome I could cry\n\n[Verse 2]\nI've never seen a night so long\nWhen time goes crawling by\nThe moon just went behind a cloud\nTo hide its face and cry\nDid you ever see a Robin weep\nWhen leaves begin to die\nThat means he's lost his will to live\n\n[Chorus]\nI'm so lonesome I could cry\n\n[Instrumental break]\n\n[Verse 3]\nThe silence of a falling star\nLights up a purple sky\nAnd as I wonder where you are\n\n[Chorus]\nI'm so lonesome I could cry\nI'm so lonesome I could cry", "[Verse]\nThe first time ever I saw your face, I thought the sun rose in your eyes\nAnd the moon and stars were the gifts you gave\nTo the dark and the endless sky, my love\nAnd the first time ever I kissed your mouth\nI felt the earth move through my hands\nLike the trembling heart of a captive bird\nThat was there at my command\nAnd the first time ever I lay with you\nI felt your heart so close to mine\nAnd I know our joy would fill the earth\nAnd last till the end of time, my love\n\n[Outro]\nThe first time ever I saw your face", "There's a lot of strange men in cell block ten\nBut the strangest of them all\nWas a friend of mine who spent his time\nStaring at the wall\nStaring at the wall\n\nIn his hand was a note that his gal had wrote\nProving crime don't pay\nWas the very same gal he robbed and stole for\nNamin' their wedding day\nNamin' their wedding day\n\nAs he looked at the wall\nSo strong and tall\nI heard him softly curse\nNobody at all ever climbed that wall\nBut I'm going to be the first\nI'm going to be the first\n\nThen the warden walked by and said son don't try\nI'd hate to see you fall\nBecause there is no doubt they'll carry you out\nIf you ever touch that wall\nIf you ever touch that wall\n\nWell a years gone by since he made his try\nBut I can still recall\nHow hard he tried and the way he died\nBut he never made that wall\nHe never made that wall\n\nWell there's never been a man who shook this camp\nBut I knew a man who tried\nThe newspapers called it a jailbreak plan\nBut I know it was suicide\nI know it was suicide", "[Verse 1]\nDesperado, why don't you come to your senses\nYou been out riding fences for so long now\nOh, you're a hard one\nBut I know that you've got your reasons\nThese things that are pleasing you\nCan hurt you somehow\n\n[Chorus 1]\nDon't you draw the queen of diamonds, boy\nShe'll beat you if she's able\nKnow the queen of hearts is always your best bet\nNow it seems to me, some fine things\nHave been laid upon your table\nBut you only want the things that you can't get\n\n[Verse 2]\nDesperado, oh, you aren't getting any younger\nYour pain and your hunger, they're driving you home\nAnd freedom, oh freedom\nWell, that's just some people talking\nYour prison is walking\nThrough this world all alone\n\n[Chorus 2]\nAnd don't your feet get cold in the winter time\nThe sky won't snow, the sun won't shine\nIt's hard to tell the night time from the day\nYou're losing all your highs and lows\nIsn't it funny how the feeling\nGoes away\n\n[Verse 3]\nDesperado, why don't you come to your senses\nCome down from your fences, and open the gate\nIt may be raining, but there's a rainbow above you\nYou better let somebody love you\nYou better let somebody love you\nYou better let somebody love you\nBefore it's too late", "[Verse 1]\nIt's midnight at a liquor store in Texas\nClosing time another day is done\nWhen a boy walked in the door and points a pistol\nHe can't find a job, but Lord, he's found a gun\nHe pulls it off with no trace of confrontation\nThat he lets the old man run out in the street\nEven though he knows they'll come with guns a blazing\nAlready he can feel that great relief\n\n[Chorus]\nOh, how many travelers get weary\nBearing both their burdens and their scars\nDon't you think they'd love to start all over\nAnd fly like eagles out among the stars?\n\n[Verse 2]\nHe pictures the arrival of the cruisers\nSees that old familiar anger in their eyes\nHe knows that when they're shooting at this loser\nThey'll be aiming at the demons in their lives\n\n[Chorus]\nOh, how many travelers get weary\nBearing both their burdens and their scars\nDon't you think they'd love to start all over\nAnd fly like eagles out among the stars?\n\n[Verse 3]\nThe evening news carried all the details\nHe dies in every living room in town\nIn his own a bottle's thrown in anger\nAnd his father cries, he'll never live this down\n\n[Chorus]\nOh, how many travelers get weary\nBearing both their burdens and their scars\nDon't you think they'd love to start all over\nAnd fly like eagles out among the stars?\n\nAnd fly like eagles out among the stars?", "[Verse]\nThese are my people this is the land where my forefathers lie\nThese are my people in brotherhood we're heirs of a creed to live by\nA creed that proclaims that by loved ones blood stains\nThis is my land and these are my people\nThese are my people they were born on and lived by the land\nThese are my people and their cities were raised by hard working hands\nAnd their faces to tell that they're holding on well\nTo this their land yes these are my people\nThese are my people these are the ones who will reach for the stars\nThese are my people that a light of the earth you can tell they are ours\nA new step to take and a new day will break\nFor this my land yes these are my people these're my people hmm", "[Verse 1]\nThere are some people who say we cannot tell\nWhether we are saved or whether all is well\nThey say we only can hope and trust that it is so\nWell, I was there when it happened and so I guess I ought to know\n\n[Chorus 1]\nYes, I know when Jesus saved me, (saved my soul)\nThe very moment He forgave me, (made me whole)\nHe took away my heavy burdens\nLord, He gave me peace within, (peace within)\n\n[Chorus 2]\nSatan can't make me doubt it, (I won't doubt it)\nIt's real and I'm going to shout it, (I'm going to shout it)\nI was there when it happened\nAnd so I guess I ought to know\n\n[Verse 2]\nI don't care who tells me salvation is not real\nThough the world may argue, that we cannot feel\nThe heavy burden's lifted and the vile sins go\nI was there when it happened and so I guess I ought to know\n\n[Chorus 1]\nYes, I know when Jesus saved me, (saved my soul)\nThe very moment He forgave me, (made me whole)\nHe took away my heavy burdens\nLord, He gave me peace within, (peace within)\n\n[Chorus 2]\nSatan can't make me doubt it, (I won't doubt it)\nIt's real and I'm going to shout it, (I'm going to shout it)\nI was there when it happened\nAnd so I guess I ought to know", "[Verse 1]\nThe old man turned off the radio\nSaid, \"Where did all of the old songs go?\"\n\"Kids sure play funny music these days!\"\n\"They play it in the strangest ways.\"\nSaid, \"It looks to me like they've all gone wild.\"\n\"It was peaceful back when I was a child\"\nWell, man, could it be that the girls and boys\nAre trying to be heard above your noise?\nAnd the lonely voice of youth cries\n\n\"What is truth?\"\n\n[Verse 2]\nA little boy of three sitting on the floor\nLooks up and says, \"Daddy, what is war?\"\n\"Son, that's when people fight and die.\"\nThe little boy of three says, \"Daddy, why?\"\nA young man of seventeen in Sunday school\nBeing taught the golden rule\nAnd by the time another year has gone around\nIt may be his turn to lay his life down\nCan you blame the voice of youth for asking\n\n\"What is truth?\"\n\n[Verse 3]\nA young man sitting on the witness stand\nThe man with the book says - \"Raise your hand!\"\n\"Repeat after me, I solemnly swear\"\nThe man looked down at his long hair\nAnd although the young man solemnly swore\nNobody seems to hear anymore\nAnd it didn't really matter if the truth was there\nIt was the cut of his clothes and the length of his hair\nAnd the lonely voice of youth cries\n\n\"What is truth?\"\n\n[Verse 4]\nThe young girl dancing to the latest beat\nHas found new ways to move her feet\nThe young man speaking in the city square\nIs trying to tell somebody that he cares\nYeah, the ones that you're calling wild\nAre going to be the leaders in a little while\nThis old world's waking to a new born day\nAnd I solemnly swear that it'll be their way\nYou better help the voice of youth find\n\nWhat is truth?\n\nAnd the lonely voice of youth cries\nWhat is truth?", "[Verse 1: Johnny Cash]\nWhen you're weary, feeling small\nWhen tears are in your eyes, I will dry them all\nI'm on your side, oh, when times get rough\nAnd friends just can't be found\n\n[Chorus: Johnny Cash]\nLike a bridge over troubled water\nI will lay me down\nLike a bridge over troubled water\nI will lay me down\n\n[Verse 2: Johnny Cash]\nWhen you're down and out\nWhen you're on the street\nWhen evening falls, so hard\nI will comfort you\n\n[Verse 3: Johnny Cash & Fiona Apple]\nI'll take your part\nWhen darkness comes\nAnd pain is all around\n\n[Chorus: Johnny Cash & Fiona Apple]\nLike a bridge over troubled water\nI will lay me down\nLike a bridge over troubled water\nI will lay me down\n\n[Verse 4: Johnny Cash]\nSail on, silver girl\nSail on by\nYour time has come, to shine\nAll your dreams are on their way\n\n[Verse 5: Johnny Cash & Fiona Apple]\nSee how they shine\nOh, If you need a friend\nI'm sailing right behind\n\n[Chorus: Johnny Cash & Fiona Apple]\nLike a bridge over troubled water\nI will ease your mind\nLike a bridge over troubled water\nI will ease your mind", "I was on my way to you and I was worried\nI was all torn up and nervous cause I knew that you'd be gone\nI knocked and crossed my fingers while I waited\nAnd I couldn't hold the teardrops when I walked away alone\n\nIt's all over, it's all over, my heart echoed it's all over\nEvery minute that you cry for her is wasted don't you know\nIt's all over, it's all over, my heart echoed it's all over\nStop your cryin' turn around and let her go\n\nI'd been runnin' 'round in circles like a baby\nI was in a daze because I loved you so, I couldn't see\nI was broken in a million little pieces\nWhen I saw enough to realize, you didn't care for me\n\nIt's all over, it's all over, my heart echoed\nEvery minute that you cry for her is wasted don't you know\nIt's all over, it's all over, so forget her\nStop your cryin' turn around and let her go, let her go, boy\nLet her go", "[Verse]\nMy grandfather's clock was too large for the shelf\nSo it stood ninety years on the floor\nIt was taller by half than the old man himself\nThough it weighed not a pennyweight more\nIt was bought on the morn of the day that he was born\nAnd was always his treasure and pride\nBut it stopped, short never to go again\nWhen the old man died\nNinety years without slumbering\nTik,tok,tik,tok\nHis life seconds numbering\nTik,tok,tik,tok\nIt stopped, short never to go again\nWhen the old man died\nMy grandfather said that of those he could hire\nNot a servant so faithful he found\nFor it wasted no time and had but one desire\nAt the close of each week to be wound\nAnd it kept in its place, not a frown upon its face\nAnd its hands never hung by its side\nBut it stopped short, never to go again\nWhen the old man died\nIt rang and alarmed in the dead of the night\nAn alarm that for years had been dumb\nAnd we knew that his spirit was pluming for flight\nThat his hour for departure had come\nStill the clock kept the time with a soft and muffled chime\nAs we silently stood by his side\nBut it stopped short, never to go again\nWhen the old man died\nNinety years without slumbering\nHis life seconds numbering\nIt stopped short, never to go again\nWhen the old man died", "[Verse]\nJohn Henry's Papy woke him up one midnight\nHe said before the sheriff comes I wanna tell you, listen boy\nSaid learn to ball a jack, learn to lay a track, learn to pick and shovel too, and take my hammer, it'll do anything you tell it to\nJohn Hery's mammie had about a dozen babies, John Henry's papie told tale about a dozen times\nThe babies all got sick and when the doctor wanted money, he said I'll pay you quarter at a time, startin' tomorow, that's the pay for a steel driver on this line\nThen the section foreman said hey hammer swinger, I see you brought your own hammer boy, but what else can all those muscles do?\nAnd he said, I can turn a jack, I can lay a track, I can pick and shovel too\n(can you swing a hammer boy?)\nI can I'll do anything you hire me to\nNow ain't you something so high and mighty with your muscles, just go ahead pick up that hammer, pick up the hammer\nHe said get a rusty spike and swing it down three times, I'll pay you a nickel a day for every inch you sink it to, go on and do what you say you can do\nWith a steep nose hammer on a four foot switch panel, John Henry raised it back till it touched his heels, then the spike went through the cross tie and it split it half in two, 35 cents a day for driven steel\n(sweat sweat boy, sweat, you owe me two more swings)\nI was born for driven steel\nWell John Henry hammered in the mountain, he'd give a grunt and he'd give groan with every swing, the women folks for miles around, heard him and come down, to watch him make the cold steel ring, Lord what a swinger, just listen to that cold steel ring\nBut the bad boss come up laughing at John Henry, said you full of vinegar now, but you bout through, were gonna get a steam drill to do your share of drivin, then what's all them muscles gonna do, huh John Henry, gonna take a little bit of vinegar out of you\nJohn Henry said I feed four little brothers, and my baby sister's walking on her knees, did the Lord say that machines awtta take the place of living, and what's a subsitute for bread and beans, I ain't seen it, do engines get rewarded for their steam\nJohn Henry hid in a coal mine for his dinner now, had thirty minutes to rest before the bell, the mine boss hollered get up whoever you are and get a pick ax, give me enough coal to start another hill, and keep it burning, mine me enough to start another hill\nJohn Henry said to his captain, a man ain't nothin but a man, but if you bring that steam drill round, I'll beat it fair and honest, I'll die with my hammer in my hand, but I'll be laughing, cuz you can't replace a steel driven man\nThere was a big crowd of people at the mountain, John Henry said to the steam drill how is you, pardon me mister steam drill, I suppose you didn't hear me, I said how you, well can you turn a jack, can you lay a track, can you pick and shovel too, listen this hammer swingers talkin' to you\n2000 people hollered go John Henry, then somebody hollered the mountain's caving in, John Henry told the captain, tell the kind folks not to worry, that ain't nothin but my hammer suckin' wind, keeps me breathing, a steel drivers muscle I intend\nCaptain tell the people move back further, I'm at the finish line and I ain't no drill, she's so far behind you ain't got the brains to quit it, when she blows up she'll scatter cross the hills, Lord Lordy, when she blows up she'll scatter cross the hills\nWell John Henry had a little woman, I believe the lady's name was Polly Ann, yeah that was his good woman, John Henry threw his hammer over his shoulder and went on home, he layed down to rest his weary back and early next morining he said come here Polly Ann come here sugar, ya know I believe this is the first time I ever watched the sun come up that I couldn't come up with it\nTake my hammer Polly Ann and go to that rail road, swing that hammer like you seen me do it, and when your swinging with the lead men, they'll all know they'll all know your John Henry's woman, but tell them that's not all I can do, tell em I can hoist a jack, and I can lay a track, I can pick and shovel too, ain't no machine can, that's been proved to you\nThere was a big crowd of mourners at the church house, the section hands laid him in the sand, trains go by on the rails John Henry laid, they slow down and take off their hats, the men do, when they come to the palce John Henrys laid, rests on his back, some say mornin steel driver you sure were a hammer swinger, then they go along pickin up speed, clikty clak, clikty clak, down there lies a steel driven man oh Lord, down there lies a steel driven man, down there lies a steel driven man oh Lord, down there lies a steel driven man", "[Verse 1]\nOn A Monday I Was Arrested (Uh Huh)\nOn A Tuesday They Locked Me In The Jail (Oh Boy)\nOn A Wednesday My Trial Was Attested\nOn A Thursday They Said Guilty And The Judge's Gavel Fell\n\n[Chorus]\nI Got Stripes - Stripes Around My Shoulders\nI Got Chains - Chains Around My Feet\nI Got Stripes - Stripes Around My Shoulders\nAnd Them Chains - Them Chains They're About To Drag Me Down\n\n[Verse 2]\nOn A Monday My Momma Come To See Me\nOn A Tuesday They Caught Me With A File\nOn A Wednesday I'm Down In Solitary\nOn A Thursday I Start On Bread And Water For A While\n\n[Chorus] [x2]", "Trouble in mind, I'm blue\nBut I won't be blue always\n'Cause that sun is gonna shine in my back door someday\n\nI'm going down to the river\nI'm going top take me a rocking chair\nAnd if the blues don't leave, I rock on away from here\n\nTrouble in mind, I'm blue\nBut I won't be blue always\n'Cause that sun is gonna shine in my back door someday\n\nTrouble in mind, that's true\nI have almost lost my mind\nLife ain't worth living, I feel like I could die\n\nTrouble in mind, I'm blue\nMy poor heart is healing slow\nI've never had such trouble in my whole life before\n\nI'm gonna lay my head on some lonesome railroad line\nAnd let that 2:19 special ease my troubled mind\n\nTrouble in mind, I'm blue\nBut I won't be blue always\n'Cause that sun is gonna shine in my back door someday", "[Verse 1]\nI was down in music city 'bout a week ago\nI wanted to see the brand old Loper show\nSo I held a cap and I headed down to Opryland\nThey said they sold their last ticket the day before\nSo I kinda just hung around the backstage door\nAnd down the steps she came, man oh man\nMy favourite female country star\nShe waved her fans and headed for her car\nHer tire, unlike her body, was very flat\nShe said, could you change my tire\nI said your wish is my desire\nAs she raised the lid, I grabbed her bumper jack\nShe said I sure do appreciate you changing my tire\n\n[Chorus]\nIf I told you who it was, if I told you who it was\nYou'd say I was making it up\nYou've seen her on the screen and in country magazines\nYou'd think I was making it up\nShe said it was our little secret and by golly\nI'm gonna keep it\nAnyway you wouldn't believe it\nIf I told you who it was\n\n[Verse 2]\nShe said you need a lift and I said well\nYou can drop me of at the York motel\nSo we headed down Briley parkway in the town\nI told her I got all your records ma'am\nShe smiled and said well I be damned\nShe said, you're kind of cute fella, wanna mess around\nWhen we got to my room just the people lied\nI said sure wish I could've heard you sing tonight\nShe smiled at me and said what do you wanna hear?\nWell if I was one of them country music folks\nI'll tell you, she'd sure get my vote for the best performance of the year\n\n[Chorus]\nIf I told you who it was, if I told you who it was\nYou'd say I was making it up\nYou've seen her on the screen and in country magazines\nYou'd think I was making it up\nShe said it was our little secret and by golly\nI'm gonna keep it\nAnyway you wouldn't believe it\nIf I told you who it was\n\n[Verse 2]\nWell I tell you this much\nWhen I put my arms around her and squeezed her real tight\nShe looked up at me with those big beautiful eyes\nTook a deep breath and a sigh and said:\n\"Howdy I'm just so proud to be here!\"\n\n[Chorus]\nIf I told you who it was, if I told you who it was\nYou'd say I was making it up\nYou've seen her on the screen and in country magazines\nYou'd think I was making it up\nShe said it was our little secret and by golly\nI'm gonna keep it\nAnyway you wouldn't believe it\nIf I told you who it was", "[Verse 1]\nI love you because you understand dear\nEvery little thing I try to do\nYou're always there to lend a helping hand dear\nBut most of all I love you because you're you\n\n[Chorus]\nNo matter what may be the style or season\nI know your love will always see me through\nI love you for a hundred thousand reasons\nBut most of all I love you because you're you\n\n[Verse 2]\nI love you because my heart is lighter\nEvery time I'm walking by your side\nI love you because the future's brighter\nThe glow to happiness you've opened wide\n\n[Chorus]\nNo matter what the world may say about me\nI know your heart will always be true\nI love you for the way you never doubt me\nBut most of all I love you because you're you", "[Produced by Rick Rubin]\n\n[Verse]\nDelia, oh, Delia Delia all my life\nIf I hadn't have shot poor\nDelia I'd have had her for my wife\nDelia's gone, one more round Delia's gone\n\nI went up to Memphis\nAnd I met Delia there found her in her parlor\nAnd I tied to her chair\nDelia's gone, one more round Delia's gone\n\nShe was low down and trifling\nAnd she was cold and mean\nKind of evil make me want to Grab my sub machine\nDelia's gone, one more round Delia's gone\n\nFirst time I shot her I shot her in the side\nHard to watch her suffer\nBut with the second shot she died\nDelia's gone, one more round Delia's gone\n\nBut jailer, oh, jailer Jailer\nI can't sleep 'cause all around my bedside\nI hear the patter of Delia's feet\nDelia's gone, one more round Delia's gone\n\nSo if you woman's devilish\nYou can let her run\nOr you can bring her down and do her\nLike Delia got done\nDelia's gone, one more round Delia's gone", "[Verse]\nIf you could read my mind, love\nWhat a tale my thoughts could tell\nJust like an old time movie\nAbout a ghost from a wishing well\nIn a castle dark or a fortress strong\nWith chains upon my feet\nYou know that ghost is me\nAnd I will never be set free\nAs long as I'm a ghost that you can't see\n\nIf I could read your mind, love\nWhat a tale your thoughts could tell\nJust like a paperback novel\nThe kind the drugstores sell\nWhen you reached the part where the heartaches come\nThe hero would be me\nBut heroes often fail\nAnd you won't read that book again\nBecause the ending's just too hard to take!\n\nI'd walk away like a movie star\nWho gets burned in a three way script\nEnter number two\nA movie queen to play the scene\nOf bringing all the good things out in me\nBut for now, love, let's be real;\nI never thought I could act this way\nAnd I've got to say that I just don't get it\nI don't know where we went wrong\nBut the feeling's gone\nAnd I just can't get it back\n\nIf you could read my mind, love\nWhat a tale my thoughts could tell\nJust like an old time movie\nAbout a ghost from a wishing well\nIn a castle dark or a fortress strong\nWith chains upon my feet\nBut stories always end\nAnd if you read between the lines\nYou'll know that I'm just trying to understand\nThe feelings that you lack\nI never thought I could feel this way\nAnd I've got to say that I just don't get it\nI don't know where we went wrong\nBut the feeling's gone\nAnd I just can't get it back", "[Verse 1]\nIt should be a while before I see Dr. Death\nSo it would sure be nice if I could get my breath\nWell I'm not the crying nor the whining kind\nUntil I hear the whistle of the 309\n\n[Chorus]\nOf the 309, of the 309\nPut me in my box on the 309\n\n[Verse 2]\nTake me to the depot, put me to bed\nBlow an electric fan on my gnarly old head\nEverybody take a look, see I'm doing fine\nThen load my box on the 309\n\n[Chorus]\n\n[Verse 3]\nHey sweet baby, kiss me hard\nDraw my bath water, sweep my yard\nGive a drink of my wine to my Jersey cow\nI wouldn't give a hoot in hell for my journey now\nOn the 309, on the 309\nI hear the sound of a railroad train\nThe whistle blows and I'm gone again\nIt will take me higher than a Georgia pine\nStand back children, it's a 309\n\n[Chorus]\n\n[Verse 4]\nA chicken in the pot and turkey in the corn\nAin't felt this good since jubilee morn\nTalk about luck, well I got mine\nAsthma coming down like a 309\nWrite me a letter, sing me a song\nTell me all about it, what I did wrong\nMeanwhile I will be doing fine\nThen load my box on the 309\n\n[Chorus]", "[Verse 1]\nMorning found me lying on a floor in New Orleans\nLooking like the patches was about to eat my jeans\nFeeling like my belly was a warehouse for the blues\nAnd I sure miss my sweet Cocaine Carolina\nMet her on an ocean liner, called her Cocaine Carolina\nShe was quite a lady then and I was twenty two\nGod knows how much I adored her, I just never could afford her\nCocaine Carolina, how did I get hooked on you?\n\n[Chorus]\nSo goodbye Cocaine Carolina, you and I are through\nI'm going back to Sandy Scag, she knows just what to do\nShe don't love me for my money, she just wants my body honey\nCocaine Carolina, how did I get hooked on you?\n\n[Verse 2]\nOh someone said if I was lucky I could go back to Kentucky\nLexington was famous for it's bluegrass and its hills\nCarolina, we should get up, don't you know we'll have to split up?\nMaybe I should go to California\n\n[Chorus]\nSo goodbye Cocaine Carolina, you and I are through\nI'm going back to Sandy Scag, she knows just what to do\nShe don't love me for my money, she just wants my body honey\nCocaine Carolina, how did I get hooked on you?\n\nSo goodbye Cocaine Carolina, you and I are through\nI'm going back to Sandy Scag, she knows just what to do\nShe don't love me for my money, she just wants my body honey\nCocaine Carolina, how did I get hooked on you?\n\nOh goodbye Cocaine Carolina, you and I are through\nI'm going back to Sandy Scag, she knows just what to do\nShe don't love me for my money, she just wants my body honey\nCocaine Carolina, how did I get hooked on you?\n\nOh goodbye Cocaine Carolina, you and I are through\nI'm going back to Sandy Scag, she knows just what to do\nShe don't love me for my money", "[Verse]\nThere once was a man who just couldn't cry\nHe hadn't cried for years and for years\nNapalmed babies and the movie love story\nFor instance, could not produce tears\nAs a child he had cried as all children will\nThen at some point his tear ducts ran dry\nHe grew to be a man, the feces hit the fan\nThings got bad, but he couldn't cry\nHis dog was run over, his wife up and left him\nAnd after that he got sacked from his job\nLost his arm in the war, was laughed at by a whore\nAh, but sill not a sniffle or sob\nHis novel was refused, his movie was panned\nAnd his big Broadway show was a flop\nHe got sent off to jail; you guessed it, no bail\nOh, but still not a dribble or drop\nIn jail he was beaten, bullied and buggered\nAnd made to make license plates\nWater and bread was all he was fed\nBut not once did a tear stain his face\nDoctors were called in, scientists, too\nTheologians were last and practically least\nThey all agreed sure enough; this was sure no cream puff\nBut in fact an insensitive beast\nHe was removed from jail and placed in a place\nFor the insensitive and the insane\nHe played lots of chess and made lots of friends\nAnd he wept every time it would rain\nOnce it rained forty days and it rained forty nights\nAnd he cried and he cried and he cried and he cried\nOn the forty-first day, he passed away\nHe just dehydrated and died\nWell, he went up to heaven, located his dog\nNot only that, but he rejoined his arm\nDown below, all the critics, they took it all back\nCancer robbed the whore of her charm\n\n[Outro]\nHis ex-wife died of stretch marks, his ex-employer went broke\nThe theologians were finally found out\nRight down to the ground, that old jail house burned down\nThe earth suffered perpetual drought", "I hear the train a comin', it's rolling 'round the bend\nAnd I ain't seen the sunshine since I don't know when\nI'm stuck in Folsom prison, and time keeps draggin' on\nBut that train keeps a rollin' on down to San Antone\n\nWhen I was just a baby my mama told me, \"Son\nAlways be a good boy, don't ever play with guns\"\nBut I shot a man in Reno just to watch him die\nWhen I hear that whistle blowing, I hang my head and cry\n\nSooooEEEE!!\n\nI bet there's rich folks eating from a fancy dining car\nThey're probably drinkin' coffee and smoking big cigars\nWell I know I had it coming, I know I can't be free\nBut those people keep a-movin'\nAnd that's what tortures me\n\nWell if they freed me from this prison\nIf that railroad train was mine\nI bet I'd move it on a little farther down the line\nFar from Folsom prison, that's where I want to stay\nAnd I'd let that lonesome whistle blow my blues away", "I wish I was an apple, a-hangin' on a tree\nAnd every time my Cindy passed, she'd take a little bite of me\n\nGet along, home, Cindy, Cindy, get along home\nGet along home, Cindy, Cindy\nI'll marry you one day\n\nWell, Cindy is my honey the sweetest in the south\nWhen we kissed to bees would all swarm around her mouth\n\nGet along, home, Cindy, Cindy, get along home\nGet along home, Cindy, Cindy, I'll marry you one day\n\nWell, I wish I had a needle and thread, fine as I could sew\nI'd sew my Cindy to my side and down the road I'd go\n\nGet along, home, Cindy, Cindy, get along home\nGet along home, Cindy, Cindy, I'll marry you one day\n\nWell, Cindy got religion. She'd had it once before\nShe grabbed my ole banjo, man and throw it on the floor\n\nGet along, home, Cindy, Cindy, get along home\nGet along home, Cindy, Cindy, I'll marry you one day\n\nWell, it's apples in the summer time, peaches in the fall\nIf I can't have the gal I want I won't have none at all\n\nGet along, home, Cindy, Cindy, get along home\nGet along home, Cindy, Cindy, I'll marry you one day\n\nCindy hugged and kissed me, she hung her head and cried\nI swore she was the prettiest thing that ever lived or died\n\nGet along, home, Cindy, Cindy, get along home\nGet along home, Cindy, Cindy, I'll marry you one day\nI'll marry you one day", "About the time that Daddy left to fight the big war\nI saw my first pistol in the general store\nIn the general store, when I was thirteen\nThought it was the finest thing I ever had seen\nSo l asked if I could have one someday when I grew up\nMama dropped a dozen eggs, she really blew up\nShe really blew up and I didn't understand\nMama said the pistol is the devil's right hand\n\nThe devil's right hand, the devil's right hand\nMama said the pistol is the devil's right hand\n\nMy very first pistol was a cap and ball Colt\nShoot as fast as lightnin' but it loads a mite slow\nLoads a mite slow and soon I found out\nIt can get you into trouble but it can't get you out\nSo then I went and bought myself a Colt 45\nCalled a peacemaker but I didn't know why\nNever knew why, I didn't understand\nCause Mama said the pistol is the devil's right hand\n\nWell I get into a card game in a company town\nCaught a miner cheating I shot the dog down\nShot the dog down, watched the dog fall\nNever touched his holster, never had a chance to draw\nThe trial was in the morning and they drug me out of bed\nAsked me how I pleaded, not guilty I said\nNot guilty I said, you've got the wrong man\nNothing touched the trigger but the devil's right hand", "[Verse]\nFrom his hands it came down\nFrom the side it came down\nFrom the feet it came down\nAnd ran to the ground\nBetween heaven and hell\nA teardrop fell In the deep crimson dew\nThe tree of life grew\nAnd the blood gave life\nTo the branches of the tree\nAnd the blood was the price\nThat set the captives free\nAnd the numbers that came\nThrough the fire and the flood Clung to the tree\nAnd were redeemed by the blood\nFrom the tree streamed a light\nThat started the fight around the tree grew a vine\nOn whose fruit I could dine\nMy old friend Lucifer came\nFought to keep me in chains\nBut I saw through the tricks\nOf six-sixty-six\nAnd the blood gave life\nTo the branches of the tree\nAnd the blood was the price\nThat set the captives free\nAnd the numbers that came\nThrough the fire and the flood Clung to the tree\nAnd were redeemed by the blood\nFrom his hands it came down\nFrom his side it came down\nFrom his feet it came down\nAnd ran to the ground\nAnd a small inner voice Said \"You do have a choice.\"\nThe vine engrafted me\nAnd I clung to the tree", "[Verse 1]\nWell, my name it is Sam Hall, Sam Hall\nYes, my name it is Sam Hall, it is Sam Hall\nMy name it is Sam Hall and I hate you, one and all\nAnd I hate you, one and all\n\nDamn your eyes!\n\n[Verse 2]\nI killed a man, they said, so they said\nI killed a man, they said, so they said\nI killed a man, they said and I smashed in his head\nAnd I left him laying dead\n\nDamn his eyes!\n\n[Verse 3]\nBut swinging, I must go, I must go\nA swinging, I must go, I must go\nA swinging, I must go while you critters down below\nYell up, \"Sam, I told you so!\"\n\nDamn your eyes!\n\n[Verse 4]\nI saw Molly in the crowd, in the crowd\nI saw Molly in the crowd, in the crowd\nI saw Molly in the crowd and I hollered, right out loud\nHey there Molly, aren't you proud\n\nDamn your eyes!\n\n[Verse 5]\nThen the Sheriff, he came too, he came too\nAh, yeah, the Sheriff, he came too, he came too\nThe Sheriff, he come too and he said, \"Sam, how are you?\"\nAnd I said, \"Well, Sheriff, how are *you*?\n\nDamn your eyes!\"\n\n[Verse 6]\nMy name is Samuel, Samuel\nMy name is Samuel, Samuel\nMy name is Samuel, and I'll see you all in hell!\nAnd I'll see you all in hell!\n\nDamn your eyes!", "[Verse]\nWell he's not very handsome to look at\nOh he's shaggy and eats like a hog\nAnd he's always killing my chickens\nThat dirty old egg-sucking dog\nEgg-sucking dog\nI'm gonna stomp your head in the ground\nIf you don't stay out of my hen house\nYou dirty old egg-sucking hound\nNow if he don't stop eating my eggs up\nThough I'm not a real bad guy\nI'm going to get my rifle and send him\nTo that great chicken house in the sky\nEgg-sucking dog\nYou're always hanging around\nBut you'd better stay out of my hen house\nYou dirty old egg-sucking hound", "[Verse 1]\nMy name is Joe Roberts, I work for the state\nI'm a sergeant out on Perenville barracks number 8\nI've always done an honest job, honest as I could\nGot a brother named Frankie, Frankie isn't no good\nEver since we were young kids, it's been the same come down\nI'd get a call on the short wave, Frankie's in trouble downtown\nWell, if it was any other man, I'd put him straight away\nBut sometimes when it's your brother, you look the other way\n\n[Chorus]\nYeah, me and Frankie laughing and drinking, nothing feels better than blood on blood\nTaking turns dancing with Maria while the band played \"The Night of the Johnstown Flood\"\nI catch him when he's straying, like any brother should\nMan turns his back on his family, he ain't no good\n\n[Verse 2]\nWell, Frankie went into the army back in 1965\nI got a farm deferment, settled down, took Maria for my wife\nBut them wheat prices kept on dropping, until it was like we's getting robbed\nFrankie came home in '68, and me, I took this job\n\n[Chorus]\nYeah, me and Frankie laughing and drinking, nothing feels better than blood on blood\nTaking turns dancing with Maria while the band played \"The Night of the Johnstown Flood\"\nI catch him when he's straying, teach him how to walk that line\nMan turns his back on his family, ain't no friend of mine\n\n[Verse 3]\nThe night was like any other, I got a call about a quarter to nine\nThere was trouble at a roadhouse out on the Michigan line\nThere was a kid on the floor, looking bad, bleeding hard from his head\nThere was a girl crying at a table, it was Frankie, she said\nI ran out and I jumped in my car, then I hit the lights\nI must have done about a hundred and ten to Michigan County that night\nIt was down by the crossroads, out by willow bank\nSeen the Buick with Ohio plates, behind the wheel was Frank\nWell, I chased him through them county roads, until the sign said Canadian border five miles from here\nPulled over to the side out the highway, watched the taillights disappear\n\n[Chorus]\nYeah, me and Frankie laughing and drinking, nothing feels better than blood on blood\nTaking turns dancing with Maria while the band played \"The Night of the Johnstown Flood\"\nI catch him when he's straying, like any brother should\nMan turns his back on his family, he ain't no good", "[Verse 1: Rodney Crowell]\nI'm back on board that '49 Ford in 1956\nLong before the sun came up, way out in the sticks\nThe headlight showed a two rut roadway\nBack up in the pines\nFirst time I heard Johnny Cash sing I Walk The Line\n\n[Verse 2: Rodney Crowell]\nI got my thrill behind the wheel upon my daddy's lap\nGrandpa rode co-pilot with a flashlight and a map\nCane pole out the window, it was in the summertime\nFirst time I heard Johnny Cash sing I Walk The Line\n\n[Hook 1: Johnny Cash]\nI keep a close watch on this heart of mine\nI keep my eyes wide open all the time\nI keep the ends out for the tie that binds\nBecause you're mine, I walk the line\n\n[Verse 3: Rodney Crowell]\nI never will forget that day, I know the time and place\nIt sounded like the whole thing came right down from outer space\nI still can see those headlights and that dashboard in my mind\nThe first time I heard Johnny Cash sing I Walk The Line\n\n[Hook 2: Johnny Cash]\nI find it very very easy to be true\nI find myself alone when each day's through\nYes I'll admit that I'm a fool for you\nBecause you're mine, I walk the line\n\n[Guitar Solo: Johnny Cash]\nAh, skinny pack\n(Mmmmmmmmmmm)\n\n[Verse 4: Rodney Crowell]\nAll these long years later it's still music to my ears\nI swear it sounds as good right now as anything I hear\nI've seen the Mona Lisa, I've heard Shakespeare read real fine\nJust like hearing Johnny Cash sing I Walk The Line\n\n[Hook 3: Johnny Cash]\nAs sure as night is dark and day is light\nI keep you on my mind both day and night\nAnd happiness I've known proves that it's right\nBecause you're mine, I walk the line\n\n[Outro: Johnny Cash]\nBecause you're mine, I walk the line"]}